[
  {
    "name": "barn",
    "type": "building",
    "value": 500,
    "source": "Carpenter's Shop",
    "basicDescription": "Normal sized barn for animals",
    "longDescription": "",
    "recipe": [
        "egg",
        "milk"
    ]
  },
  {
    "name": "bigBarn",
    "type": "building",
    "value": 1000,
    "source": "Carpenter's Shop",
    "basicDescription": "Huge barn for animals",
    "longDescription": "",
    "recipe": [
        "barn"
    ]
  },
  {
    "name": "bigBarn",
    "type": "building",
    "value": 1000,
    "source": "Carpenter's Shop",
    "basicDescription": "Huge barn for animals",
    "longDescription": "",
    "recipe": [
        "barn"
    ]
  },
  {
    "name": "grassStarter",
    "type": "crops",
    "value": 50,
    "source": "General Store, Joja Mart",
    "basicDescription": "Place this on your farm to start a new patch of grass.",
    "longDescription": "Instantly places a patch of Grass when used on the ground.  Over time, it'll grow and spread to surrounding tiles.  Grass can be harvested with the Sycthe to produce Hay once a Silo is built.  On Winter 1st, all grass on the farm will die.",
    "seasonToGrow": [
        "spring",
        "summer",
        "fall"
    ]
  },
  {
    "name": "sugar",
    "type": "food",
    "value": 50,
    "source": "Mill, General Store, Joja Mart",
    "basicDescription": "Adds sweetness to pastries and candies.  Too much can be unhealthy.",
    "longDescription": "A cooking ingredient used in many recipes. Using a Mill, three Sugars can be crafted from one Beet.  Beets placed inside will appear as Sugar beside the Mill the next morning.  Sugar made this way is profitable when using regular or silver quality Beets at 150g for three Sugars.  However it is better to create Beet Pickles using the preserves jar to sell at 250g.",
    "heal": 11,
    "energy": 25
  },
  {
    "name": "wheatFlour",
    "type": "food",
    "value": 50,
    "source": "Mill, General Store, Joja Mart",
    "basicDescription": "A common cooking ingredient made from crushed wheat seeds.",
    "longDescription": "A cooking ingredient that can be consumed by itself.  One Wheat Flour can be crafted from one Wheat using a Mill.  Wheat placed inside the Mill will appear in the box beside the Mill the next morning.  Doing this is profitable at 50g per item.  It can then be cooked into Bread for another 10g profit, but using the Wheat to create Beer is more profitable at 200g per item.",
    "heal": 5,
    "energy": 13
  },
  {
    "name": "rice",
    "type": "food",
    "value": 100,
    "source": "General Store, Joja Mart",
    "basicDescription": "A basic grain often served under vegetables.",
    "longDescription": "A cooking ingredient that can be used in a variety of recipes.  I like to eat it everyday.",
    "heal": 5,
    "energy": 13
  },
  {
    "name": "oil",
    "type": "artisanGoods",
    "value": 100,
    "source": "General Store, Joja Mart",
    "basicDescription": "All purpose cooking oil.",
    "longDescription": "An Artison Good and common cooking ingredient made from the Oil Maker.  There is no quality rating so its sell price doesn't benefit from quality increeases.  Also it's sell price doesn't benefit from the Artisan Profession.  Oil made from base quality Sunflowers, cultivated sunflower seeds and all qualities of corn is profitable, though corn is more profitable in the Keg or Preserves Jar.  The processing times vary by ingredient.  1 Corn takes 16.66 hours, 1 Sunflower Seeds takes 53.33 hours and 1 Sunflower takes 1 hour.  ",
    "heal": 5,
    "energy": 13
  },
  {
    "name": "vinegar",
    "type": "food",
    "value": 100,
    "source": "General Store",
    "basicDescription": "An Aged fermented liquid used in many cooking recipes.",
    "longDescription": "Used as a cooking ingredient that can be used in a variety of recipes. ",
    "heal": 5,
    "energy": 13
  },
  {
    "name": "basicFertilizer",
    "type": "crafting",
    "value": 2,
    "source": "General Store, Crafting",
    "basicDescription": "Improves soil quality a little, increasing your chance to grow quality crops. Mix into tilled soil.",
    "longDescription": "A Fertilizer that helps by improving soil quality. It can be crafted with a recipe gained through Farming Level 1. It must be placed on tilled soil before planting a seed.  It affects only the basic harvest (Potatoes, Blueberries, Cranberries, etc.), meaning that extra crops gained at a single harvest will be regular quality.",
    "recipe": [
      "sap",
      "sap"
    ]
  },
  {
    "name": "qualityFertilizer",
    "type": "crafting",
    "value": 10,
    "source": "General Store after year 2, Crafting",
    "basicDescription": "Improves soil quality, increasing your chance to grow quality crops. Mix into tilled soil.",
    "longDescription": "A Fertilizer that improves the chance to grow a Quality Crop. It can be crafted with a recipe gained through Farming Level 9. It may occasionally be sold by the Travelling Card for 100-1000g. It must be placed on tilled soil before planting a seed.  It affects only the basic harvest (Potatoes, Blueberries, Cranberries, etc.), meaning that extra crops gained at a single harvest will be regular quality.",
    "recipe": [
      "sap",
      "sap",
      "anyFish"
    ]
  },
  {
    "name": "sweetGemBerry",
    "type": "crops",
    "value": 3000,
    "source": "Rare Seed grown in the Fall",
    "basicDescription": "It's by far the sweetest thing you've ever smelled.",
    "longDescription": "The Sweet Gem Berry is a crop that grows from a Rare Seed after 24 days. It is not considered a Fruit or Vegetable and thus cannot be used in a Keg or Preserves Jar. It also does not benefit from the Tiller profession. It can be purchased from the Traveling Cart for Gold.png9,000-15,000g. Rare Seeds can be purchased from the Traveling Cart for Gold.png1,000g in Spring & Summer, or for Gold.png600-1,000g in any season. Rare Seeds can also be produced from a Sweet Gem Berry using the Seed Maker. Despite its high value, the berry is regarded as a neutral gift by everyone in Stardew Valley. However, if you give one to Old Master Cannoli in the Secret Woods, you will get a Stardrop in return, and your Energy will increase permanently. In multiplayer, only one berry needs to be given for all players to receive a Stardrop.",
    "recipe": [
      "rareSeed"
    ]
  },
  {
    "name": "rareSeed",
    "type": "crops",
    "value": 200,
    "source": "Traveling Cart in Spring and Summer",
    "basicDescription": "Sow in fall. Takes all season to grow.",
    "longDescription": "The Rare Seed is a type of seed. A mature plant yields a Sweet Gem Berry. One to five Rare Seeds can be purchased at the Traveling Cart for Gold.png1,000g each during Spring and Summer. During any season, there is also a 1.26% chance that the merchant will be selling 1-5 Rare Seeds for Gold.png600-1,000g each. (You may see Rare Seeds occupying two slots in the merchant's offerings in Spring and Summer). Rare Seeds can also be obtained by using the Seed Maker. Despite the description stating that this seed 'takes all season to grow', it takes only 24 days. If using Speed-Gro or Deluxe Speed-Gro, the player has up to Day 7 of Fall to plant this seed, and it will be harvestable before Winter.",
    "growthTimeDays": 28,
    "seasonToGrow": [
      "fall"
    ]
  },
  {
    "name": "basicRetainingSoil",
    "type": "crafting",
    "value": 4,
    "source": "General Store, Crafting",
    "basicDescription": "This soil has a chance of staying watered overnight. Mix into tilled soil.",
    "longDescription": "A fertilizer that helps by keeping soil watered.  Can be placed on tilled soil before or after planting a seed, or at any stage of crop growth.  The chance for retaining water is about 33%.  The recipe can be obtained at Farming Level 4.",
    "recipe": [
      "stone",
      "stone"
    ]
  },
  {
    "name": "qualityRetainingSoil",
    "type": "crafting",
    "value": 5,
    "source": "General Store, Crafting, Oasis",
    "basicDescription": "This soil has a good chance of staying watered overnight. Mix into tilled soil.",
    "longDescription": "A fertilizer that helps by keeping soil watered.  Can be placed on tilled soil before or after planting a seed, or at any stage of crop growth.  The chance for retaining water is about 66%.  The recipe can be obtained at Farming Level 7 and produces 2 items per craft.",
    "recipe": [
      "stone",
      "stone",
      "clay"
    ]
  },
  {
    "name": "speedGro",
    "type": "crafting",
    "value": 20,
    "source": "General Store, Crafting, Oasis",
    "basicDescription": "Stimulates leaf production. Guaranteed to increase growth rate by at least 10%. Mix into tilled soil.",
    "longDescription": "A Fertilizer that helps by speeding crop growth.  Can be placed on tilled soil before or after planting a seed, or at any stage of crop growth (but as of v1.2, there's a bug that prevents any effect unless applied before planting a seed). The recipe can be obtained at Farming Level 3 and produces 5 items per craft. Crafting is always cheaper than purchasing it regardless of the Clam quality.",
    "recipe": [
      "pineTar",
      "clam"
    ]
  },
  {
    "name": "deluxeSpeedGro",
    "type": "crafting",
    "value": 40,
    "source": "General Store, Crafting, Oasis",
    "basicDescription": "Stimulates leaf production. Guaranteed to increase growth rate by at least 25%. Mix into tilled soil.",
    "longDescription": "A Fertilizer that helps by speeding crop growth.  Can be placed on tilled soil before or after planting a seed, or at any stage of crop growth (but as of v1.2, there's a bug that prevents any effect unless applied before planting a seed).  The chance for retaining water is about 66%.  The recipe can be obtained at Farming Level 8 and produces 5 items per craft. Crafting is always cheaper than purchasing it regardless of the Clam quality.  It is sold at the Pierre's General Store in year 2 onwards.",
    "recipe": [
      "oakResin",
      "coral"
    ]
  },
  {
    "name": "wallpaper",
    "type": "furniture",
    "value": 0,
    "source": "General Store, JojaMart",
    "basicDescription": "Decorates the walls of one room.",
    "longDescription": "A new wallpaper is available at the store each day.  The wallpaper sold at JojaMart will be sold the next day at Pierre's.  It can also be bought from a Catalogue. Wallpaper is a one time use and does not stack.  They cover the whole room they're placed in and can be also placed on hallway walls between rooms."
  },
  {
    "name": "flooring",
    "type": "furniture",
    "value": 0,
    "source": "General Store, JojaMart",
    "basicDescription": "Decorates the floor of one room.",
    "longDescription": "A new flooring is available at the store each day.  The flooring sold at JojaMart will be sold the next day at Pierre's.  It can also be bought from a Catalogue. Wallpaper is a one time use and does not stack.  They cover the whole room they're placed in and can be also placed on hallway walls between rooms."
  },
  {
    "name": "cherrySapling",
    "type": "crops",
    "value": 850,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Cherry Tree. Bears fruit in the spring. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into a Cherry Tree, after which will produce one fruit each day during the Spring.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 3400g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["winter"]
  },
  {
    "name": "apricotSapling",
    "type": "crops",
    "value": 500,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Apricot Tree. Bears fruit in the spring. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Apricot Tree, after which will produce one fruit each day during the Spring.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 2000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["winter"]
  },
  {
    "name": "orangeSapling",
    "type": "crops",
    "value": 1000,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Orange Tree. Bears fruit in the summer. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Orange Tree, after which will produce one fruit each day during the Summer.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 4000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "peachSapling",
    "type": "crops",
    "value": 1500,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Peach Tree. Bears fruit in the summer. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Peach Tree, after which will produce one fruit each day during the Summer.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 6000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "pomegranateSapling",
    "type": "crops",
    "value": 1500,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Pomegranate Tree. Bears fruit in the summer. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Pomegranate Tree, after which will produce one fruit each day during the Fall.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 6000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "appleSapling",
    "type": "crops",
    "value": 1000,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Apple Tree. Bears fruit in the summer. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Apple Tree, after which will produce one fruit each day during the Fall.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 4000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "catalogue",
    "type": "furniture",
    "value": 0,
    "source": "General Store",
    "basicDescription": "Provides unlimited access to all wallpapers and floors... from the convenience of your home!",
    "longDescription": "A piece of Furniture that once placed, allows the player to purchase every Wallpaper and Flooring item for 0g in unlimited quantity.  This item is similar to the Furniture Catalogue sold at the Carpenter's Shop which gives access to Furniture items."
  },
  {
    "name": "bouquet",
    "type": "all",
    "value": 100,
    "source": "General Store",
    "basicDescription": "A gift that shows your romantic interest.",
    "longDescription": "A special gift that you can give to any or all marriage candidates whom you've gained an 8-heart friendship with. Giving this to a marriage candidate results in their status changing to boyfriend or girlfriend on the Social tab of the pause menu.  Giving this unfreezes the friendship level with each recipient allowing it to increase to 10 hearsts, and to decay (meaning friendship will go down if they are not talked to each day). "
  },
  {
    "name": "largePack",
    "type": "tools",
    "value": 0,
    "source": "General Store",
    "basicDescription": "Unlocks the 2nd row of inventory (12 more slots, total 24).",
    "longDescription": "Available at the start of the game, this will unlock 12 more slots upon purchase."
  },
  {
    "name": "deluxePack",
    "type": "tools",
    "value": 0,
    "source": "General Store",
    "basicDescription": "Unlocks the 3rd row of inventory (12 more slots, total 36).",
    "longDescription": "Available after purchasing the Large Pack, this will unlock 12 more slots upon purchase."
  },
  {
    "name": "parsnipSeeds",
    "type": "crops",
    "value": 10,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 4 days to mature.",
    "longDescription": "A type of seed which grows and produces Parsnips when mature. These can be obtained via the Seed Maker as well as having a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 20g.",
    "growthTimeDays": 4,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "beanStarter",
    "type": "crops",
    "value": 30,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 10 days to mature, but keeps producing after that. Yields multiple beans per harvest. Grows on a trellis.",
    "longDescription": "A type of seed which grows and produces Green Beans when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 60g.",
    "growthTimeDays": 10,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "cauliflowerSeeds",
    "type": "crops",
    "value": 40,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 12 days to produce a large cauliflower.",
    "longDescription": "A type of seed which grows and produces Cauliflower when mature. These can be obtained via the Seed Maker as well as having a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 80g. Nine seeds can be obtained from Gunther at the Museum after donating 5 items.",
    "growthTimeDays": 12,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "potatoSeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 6 days to mature, and has a chance of yielding multiple potatoes at harvest.",
    "longDescription": "A type of seed which grows and produces Potatoes when mature. These can be obtained via the Seed Maker as well as having a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 50g.  Potato seeds have a random chance to produce extra potatoes partially based upon Daily Luck.",
    "growthTimeDays": 6,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "cactusSeeds",
    "type": "crops",
    "value": 0,
    "source": "Oasis in the Desert",
    "basicDescription": "Can only be grown indoors. Takes 12 days to mature, and then produces fruit every 3 days.",
    "longDescription": "ACactus Seeds are a type of seed. Mature plants yield Cactus Fruit. They can be purchased only from Sandy at the Oasis for Gold.png150g. Cactus Seeds can be planted outdoors, but will be either missing or dead the next day. Cactus plants may only be grown in the Greenhouse or inside another building using a Garden Pot. Cactus Fruit harvested from Cactus Seeds will never be iridium quality. Iridium quality Cactus Fruit is obtainable only by Foraging in The Desert after choosing the Botanist Profession. Harvesting Cactus plants gives Farming experience points.",
    "growthTimeDays": 12,
    "seasonToGrow": [
      "all"
    ]
  },
  {
    "name": "tulipBulb",
    "type": "crops",
    "value": 10,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in spring. Takes 6 days to produce a colorful flower. Assorted colors.",
    "longDescription": "A type of seed which grows and produces Tulips when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 20g.",
    "growthTimeDays": 6,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "kaleSeeds",
    "type": "crops",
    "value": 35,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 6 days to mature. Harvest with the scythe.",
    "longDescription": "A type of seed which grows and produces Kale when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 70g.",
    "growthTimeDays": 6,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "jazzSeeds",
    "type": "crops",
    "value": 15,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in spring. Takes 7 days to produce a blue puffball flower.",
    "longDescription": "A type of seed which grows and produces Blue Jazz flowers when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 30g.",
    "growthTimeDays": 7,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "garlicSeeds",
    "type": "crops",
    "value": 20,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 4 days to mature.",
    "longDescription": "A type of seed which grows and produces Garlic when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 40g.  These are only available in the General Store starting from year 2.",
    "growthTimeDays": 4,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "melonSeeds",
    "type": "crops",
    "value": 40,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 12 days to mature.",
    "longDescription": "A type of seed which grows and produces Melons when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 80g.  Nine seeds can be obtained from Gunther at the Museum after donating 10 items.",
    "growthTimeDays": 12,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "tomatoSeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 11 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Tomatoes when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 50g.  When harvested, each tomato plant gives 1 Tomato every 4 days, with a small random chance for more tomatoes.",
    "growthTimeDays": 11,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "blueberrySeeds",
    "type": "crops",
    "value": 40,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 13 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Blueberries when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 80g.  When harvested, each blueberry plant gives 3 Blueberries every 4 days with a small chance formore Blueberries.",
    "growthTimeDays": 13,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "pepperSeeds",
    "type": "crops",
    "value": 20,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 5 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Hot Peppers when mature. These can be obtained via the Seed Maker as well as a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 40g.  When harvested each Hot Pepper plant gives 1 Hot Pepper every 3 days with a small chance for more Hot Peppers. ",
    "growthTimeDays": 5,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "wheatSeeds",
    "type": "crops",
    "value": 5,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer or fall. Takes 4 days to mature. Harvest with the scythe.",
    "longDescription": "A type of seed which grows and produces Wheat when mature. These can be obtained via the Seed Maker as well as a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 10g.",
    "growthTimeDays": 4,
    "seasonToGrow": ["summer", "fall"]
  },
  {
    "name": "radishSeeds",
    "type": "crops",
    "value": 20,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 6 days to mature.",
    "longDescription": "A type of seed which grows and produces Radishes when mature. These can be obtained via the Seed Maker as well as a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 40g.",
    "growthTimeDays": 6,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "poppySeeds",
    "type": "crops",
    "value": 50,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in summer. Produces a bright red flower in 7 days.",
    "longDescription": "A type of seed which grows and produces Poppy flowers when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 100g.",
    "growthTimeDays": 7,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "spangleSeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in summer. Takes 8 days to produce a vibrant tropical flower. Assorted colors.",
    "longDescription": "A type of seed which grows and produces Summer Spangle flowers when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 50g.",
    "growthTimeDays": 8,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "hopsStarter",
    "type": "crops",
    "value": 30,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 11 days to grow, but keeps producing after that. Grows on a trellis.",
    "longDescription": "A type of seed which grows and produces Hops when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 60g.",
    "growthTimeDays": 11,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "cornSeeds",
    "type": "crops",
    "value": 75,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer or fall. Takes 14 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Corn when mature. These can be obtained via the Seed Maker as well as a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 150g. Corn plants continue to produces every 4 days.",
    "growthTimeDays": 14,
    "seasonToGrow": [
        "summer",
        "fall"
      ]
  },
  {
    "name": "sunflowerSeeds",
    "type": "crops",
    "value": 20,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in summer or fall. Takes 8 days to produce a large sunflower. Yields more seeds at harvest.",
    "longDescription": "A type of seed which grows and produces Sunflowers and 0-3 Sunflower Seeds when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the JoJaMart for 125g or potentially 100g at the Travelling Cart. It's sell price is 100g if it was purchased instead of harvested.  It can be used to create oil via an Oil Maker.",
    "growthTimeDays": 8,
    "seasonToGrow": ["summer", "fall"]
  },
  {
    "name": "redCabbageSeeds",
    "type": "crops",
    "value": 50,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 9 days to mature.",
    "longDescription": "A type of seed which grows and produces Red Cabbage when mature. These can be obtained via the Seed Maker. This is only available at the General Store and Night Market starting year 2. It is cheapest to buy at the General Store or Night Market for 100g.",
    "growthTimeDays": 9,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "eggplantSeeds",
    "type": "crops",
    "value": 10,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 5 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Eggplants when mature. These can be obtained via the Seed Maker and has a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 20g. When harvested, each Eggplant bush gives 1 Eggplant for every 5 days, with a very small random chance for more Eggplants",
    "growthTimeDays": 5,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "cornSeeds",
    "type": "crops",
    "value": 75,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the summer or fall. Takes 14 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Corn when mature. These can be obtained via the Seed Maker and has a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 150g. When harvested, each Corn plant gives 1 Corn for every 4 days.",
    "growthTimeDays": 14,
    "seasonToGrow": ["fall", "summer"]
  },
  {
    "name": "pumpkinSeeds",
    "type": "crops",
    "value": 50,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 13 days to mature.",
    "longDescription": "A type of seed which grows and produces Pumpkins when mature. These can be obtained via the Seed Maker and has a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 150g.",
    "growthTimeDays": 13,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "bokChoySeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 4 days to mature.",
    "longDescription": "A type of seed which grows and produces Bok Choy when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 50g.",
    "growthTimeDays": 4,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "yamSeeds",
    "type": "crops",
    "value": 30,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 10 days to mature.",
    "longDescription": "A type of seed which grows and produces Bok Choy when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 60g.",
    "growthTimeDays": 10,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "cranberrySeeds",
    "type": "crops",
    "value": 60,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 7 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Cranberries when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 240 or possibly 180g at the Travelling Cart.  When harvested each plant gives 2 Cranberries every 5 days with a small chance for more Cranberries.",
    "growthTimeDays": 7,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "fairySeeds",
    "type": "crops",
    "value": 100,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant in fall. Takes 12 days to produce a mysterious flower. Assorted Colors.",
    "longDescription": "A type of seed which grows and produces Fairy Rose flowers when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 200g.",
    "growthTimeDays": 12,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "amaranthSeeds",
    "type": "crops",
    "value": 35,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 7 days to grow. Harvest with the scythe.",
    "longDescription": "A type of seed which grows and produces Amaranth when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 70g.",
    "growthTimeDays": 7,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "grapeStarter",
    "type": "crops",
    "value": 30,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 10 days to grow, but keeps producing after that. Grows on a trellis.",
    "longDescription": "A type of seed which grows and produces Grapes when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 60g. Continues to produces grapes every 3 days",
    "growthTimeDays": 10,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "artichokeSeeds",
    "type": "crops",
    "value": 15,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 8 days to mature.",
    "longDescription": "A type of seed which grows and produces Grapes when mature. These can be obtained via the Seed Maker or potentially from Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 30g.  It is only available to buy at the General Store or Night Market starting year 2 but can be bought at the Travelling Cart from the start for 100g-1000g.",
    "growthTimeDays": 8,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "energyTonic",
    "type": "food",
    "value": 500,
    "source": "Clinic",
    "basicDescription": "Restores a lot of energy.",
    "longDescription": "Restores a lot of energy.  Use it after a long day of work.",
    "heal": 200,
    "energy": 500
  },
  {
    "name": "muscleRemedy",
    "type": "food",
    "value": 500,
    "source": "Clinic",
    "basicDescription": "When you've pushed your body too hard, drink this to remove 'Exhaustion'",
    "longDescription": "Use this when you're tired.  Helpful after a long day of work.",
    "heal": 22,
    "energy": 50
  },
  {
    "name": "copperOre",
    "type": "minerals",
    "value": 5,
    "source": "Blacksmith, The Mines, Fishing, Artifact Spot, Geodes, Panning, Traveling Cart",
    "basicDescription": "A common ore that can be smelted into bars",
    "longDescription": "The Mines (Levels 31-39) have a high concentration of copper nodes. The surrounding regular rocks also have a high probability of dropping a single copper ore. Copper Ore is obtained from copper nodes with a pickaxe. Mining a copper node will yield between 1 and 3 copper ore. The Miner Profession can further increase this.  Copper ore can be smelted in a Furnace to create a Copper Bar. The smelting requires 5 copper ore and 1 coal to begin and takes 30 in-game minutes to complete. Can be bought at the Blacksmith for 75g each in year 1 and 150g each in year 2+."
  },
  {
    "name": "ironOre",
    "type": "minerals",
    "value": 10,
    "source": "Blacksmith, The Mines, Fishing, Artifact Spot, Geodes, Panning, Traveling Cart",
    "basicDescription": "A fairly common ore that can be smelted into bars.",
    "longDescription": "The Mines (Levels 41 - 79) have a high concentration of Iron Nodes with potential abundance at Levels 70 - 79. Iron Ore is obtained from Iron nodes with a pickaxe. Mining an Iron Node will yield between 1 and 3 Iron Ore. The Miner Profession can further increase this.  Iron ore can be smelted in a Furnace to create an Iron Bar. The smelting requires 5 iron ore and 1 coal to begin and takes 2 hours to complete. Can be bought at the Blacksmith for 150g each in year 1 and 250g each in year 2+."
  },
  {
    "name": "coal",
    "type": "minerals",
    "value": 15,
    "source": "Charcoal Kiln, Recycling Marchine, Blacksmith, The Mines, Fishing, Geodes, Panning, Traveling Cart",
    "basicDescription": "A combustible rock that is useful for crafting and smelting.",
    "longDescription": "Coal is a basic resource. It can be obtained in many different ways, primarily from rocks or Dust Sprites in The Mines, purchased from Clint at the Blacksmith shop, or using a Charcoal Kiln. It may also be produced by recycling trash or found in Fishing Treasure Chests. A random amount of coal may be found in addition to metal ores by Panning. Coal is used in some crafting recipes and is necessary for smelting ore or Quartz in a furnace. A Charcoal Kiln can be used to convert 10 wood into 1 coal. Coal purchased at the Blacksmith costs 150g during year 1, so it is cheaper in year 1 to buy 10 wood for 100g from Robin at the Carpenter's Shop and convert that wood into coal in the Charcoal Kiln. After year 1, wood pricing increases to 50g per piece but coal increases to only 250g, so it is cheaper to purchase coal directly."
  },
  {
    "name": "goldOre",
    "type": "minerals",
    "value": 25,
    "source": "Blacksmith, The Mines, Fishing, Frozen Geode, Magma Geode, Omni Geode, Panning, Traveling Cart",
    "basicDescription": "A fairly common ore that can be smelted into bars.",
    "longDescription": "Gold Ore is a resource that can be placed in a furnace, along with coal, to create a Gold Bar. Each bar requires 5 gold ore and one coal to create, taking about five in-game hours. Gold ore can be mined from gold nodes in the Mines at levels 80+, in the Skull Cavern rarely at levels 60+ and more commonly at levels 80+, and has a chance to spawn in the Quarry. Gold ore can also be found by breaking boxes and barrels in the mines. Other random sources of gold ore are fishing treasure chests and beachfront Artifact Spots. Gold ore may also be found inside Frozen Geodes, Magma Geodes, or Omni Geodes, or from Panning. The Traveling Cart may occasionally sell it for 100-1,000g. Gold ore can be sold for 25g each. It can be purchased for 400g each from the Blacksmith in year 1, totaling 2,000g per bar. In year 2+, it can be purchased from the Blacksmith for 750g each, totaling 3,750g per bar."
  },
  {
    "name": "copperHoe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Hoe",
    "basicDescription": " It is used primarily to till soil for Farming, and to dig up Artifact Spots.",
    "longDescription": "Upgrading to a Copper Hoe will increase the maximum area of effect to 3 tiles, in a line in front of you via holding down the action button."
  },
  {
    "name": "steelHoe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Copper Hoe",
    "basicDescription": " It is used primarily to till soil for Farming, and to dig up Artifact Spots.",
    "longDescription": "Upgrading to a Steel Hoe will increase the maximum area of effect to 5 tiles, in a line in front of you via holding down the action button."
  },
  {
    "name": "goldHoe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Steel Hoe",
    "basicDescription": " It is used primarily to till soil for Farming, and to dig up Artifact Spots.",
    "longDescription": "Upgrading to a Gold Hoe will increase the maximum area of effect to 3x3 tiles, in a line in front of you via holding down the action button."
  },
  {
    "name": "iridiumHoe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Gold Hoe",
    "basicDescription": " It is used primarily to till soil for Farming, and to dig up Artifact Spots.",
    "longDescription": "Upgrading to an Iridium Hoe will increase the maximum area of effect to 6x3 tiles, in a line in front of you via holding down the action button."
  },
  {
    "name": "copperPickaxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Pickaxe",
    "basicDescription": "It is used mainly for breaking stones and picking up placed equipment or furniture.",
    "longDescription": "Upgrading to a Copper Pickaxe will allow you to break large rocks in the mine. These give 10 stone. It reduces the hits needed for other rocks."
  },
  {
    "name": "steelPickaxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Copper Pickaxe",
    "basicDescription": "It is used mainly for breaking stones and picking up placed equipment or furniture.",
    "longDescription": "Upgrading to a Steel Pickaxe will allow you to break boulders on The Farm. Can mine the barrier inside the mine that blocks the player from talking with Dwarf. It further reduces the hits needed for other rocks."
  },
  {
    "name": "goldPickaxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Steel Pickaxe",
    "basicDescription": "It is used mainly for breaking stones and picking up placed equipment or furniture.",
    "longDescription": "Upgrading to a Gold Pickaxe allows you to break any meteorites that land on your farm. It further reduces the hits needed for other rocks."
  },
  {
    "name": "iridiumPickaxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Gold Pickaxe",
    "basicDescription": "It is used mainly for breaking stones and picking up placed equipment or furniture.",
    "longDescription": "Upgrading to an Iridium Pickaxe further reduces the hits needed for other rocks."
  },
  {
    "name": "copperAxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Axe",
    "basicDescription": "The Axe is a tool used to chop branches, trees and small stumps, as well as for removing or harvesting certain objects, especially important for obtaining Wood.",
    "longDescription": "Upgrading to a Copper Axe will allow you to chop Large Stumps. 8 hits to chop a fully-grown tree, and 4 hits for a small stump.  "
  },
  {
    "name": "steelAxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Copper Axe",
    "basicDescription": "The Axe is a tool used to chop branches, trees and small stumps, as well as for removing or harvesting certain objects, especially important for obtaining Wood.",
    "longDescription": "Upgrading to a Steel Axe will allow you to chop Large Logs. 6 hits to chop a fully-grown tree, and 3 hits for a small stump. The Steel Axe is required to remove the Large Log that blocks the entrance to the Secret Woods. "
  },
  {
    "name": "goldAxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Steel Axe",
    "basicDescription": "The Axe is a tool used to chop branches, trees and small stumps, as well as for removing or harvesting certain objects, especially important for obtaining Wood.",
    "longDescription": "Upgrading to a Gold Axe allows you to only need 4 hits to chop a fully-grown tree, and 2 hits for a small stump. 2 hits for a stage 4 tree, and one hit for a stage 3 tree and below."
  },
  {
    "name": "iridiumAxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Golden Axe",
    "basicDescription": "The Axe is a tool used to chop branches, trees and small stumps, as well as for removing or harvesting certain objects, especially important for obtaining Wood.",
    "longDescription": "Upgrading to an Iridium Axe allows you to only need 2 hits to chop a fully-grown tree, and 1 hit for a small stump. 1 hit for a stage 4 tree and below."
  },
  {
    "name": "copperWateringCan",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Watering Can",
    "basicDescription": "The Watering Can is a tool obtained at the beginning of the game that is used to water Crops.",
    "longDescription": "Upgrading to a Copper Watering Can will have the capacity increased to 55 charges. Also increases maximum area of effect to 3 tiles in a straight line."
  },
  {
    "name": "steelWateringCan",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Copper Watering Can",
    "basicDescription": "The Watering Can is a tool obtained at the beginning of the game that is used to water Crops.",
    "longDescription": "Upgrading to a Steel Watering Can will have the capacity increased to 70 charges. Also increases maximum area of effect to 5 tiles in a straight line."
  },
  {
    "name": "goldWateringCan",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Steel Watering Can",
    "basicDescription": "The Watering Can is a tool obtained at the beginning of the game that is used to water Crops.",
    "longDescription": "Upgrading to a Gold Watering Can will have the capacity increased to 85 charges. Also increases maximum area of effect to a 3x3 area (9 corresponding tiles)."
  },
  {
    "name": "iridiumWateringCan",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Gold Watering Can",
    "basicDescription": "The Watering Can is a tool obtained at the beginning of the game that is used to water Crops.",
    "longDescription": "Upgrading to a Iridium Watering Can will have the capacity increased to 100 charges. Also increases maximum area of effect to a 6x3 area (18 corresponding tiles)"
  },
  {
    "name": "jojaCola",
    "type": "food",
    "value": 25,
    "source": "Fishing, JojaMart, Vending Machine, Soda Machine, Garbage Cans",
    "basicDescription": "The flagship product of Joja Corporation",
    "longDescription": "Joja Cola is a type of trash. It can be found in all fishing spots during all seasons and in Garbage Cans. It can also be purchased at JojaMart for 75g or from the Vending Machine in The Stardrop Saloon. Players who choose to complete the Joja Warehouse instead of the Community Center will be rewarded with a Soda Machine that produces one Joja Cola per day. It is the only trash item that can be purchased. Along with the Rotten Plant, it cannot be recycled. When caught while fishing, Joja Cola gives 3 Fishing XP.",
    "heal": 5,
    "energy": 13
  },
  {
    "name": "jojaWallpaper",
    "type": "furniture",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Decorates the walls of one room",
    "longDescription": "A great way to show your love and support to the Joja corporatation."
  },
  {
    "name": "jColaLight",
    "type": "furniture",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Can be placed inside your house.",
    "longDescription": "Another great way to show your love and support to the Joja corporatation."
  },
  {
    "name": "minecarts",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the minecart system that runs between the bus stop, the mountains, and Pelican Town.",
    "longDescription": "Repairs the minecart system that runs between the bus stop, the mountains, and Pelican Town."
  },
  {
    "name": "minecarts",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the minecart system that runs between the bus stop, the mountains, and Pelican Town.",
    "longDescription": "Destinations available from Town. The Minecart is a method of travel unlocked after completing the Boiler Room Bundles or by purchasing it from the Joja Community Development Form at JojaMart for 15,000g. After the Boiler room bundle is completed the 'minecart' is not usable till the day after because the Junimos fix it that night. Minecarts allow you to travel between four destinations throughout Stardew Valley."
  },
  {
    "name": "panning",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Removes the glimmering boulder near the mine entrance.",
    "longDescription": "Removes the glimmering boulder near the mine entrance."
  },
  {
    "name": "bridge",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the broken bridge in the mountains. The broken bridge east of The Mines will be repaired, enabling access to the Quarry.",
    "longDescription": "Repairs the broken bridge in the mountains. The broken bridge east of The Mines will be repaired, enabling access to the Quarry."
  },
  {
    "name": "greenhouse",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the old ruins on the farm, turning it into a greenhouse.",
    "longDescription": "Repairs the old ruins on the farm, turning it into a greenhouse."
  },
  {
    "name": "bus",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the bus that runs to Calico Desert.",
    "longDescription": "Repairs the bus that runs to Calico Desert."
  },
  {
    "name": "salad",
    "type": "food",
    "value": 110,
    "source": "Cooking, The Saloon",
    "basicDescription": "A healthy garden salad.",
    "longDescription": "Salad is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It is also available for purchase daily at The Stardrop Saloon for 220g and may randomly appear in Krobus' shop on Saturdays.",
    "heal": 50,
    "energy": 113,
    "recipe": [
      "leek",
      "dandelion",
      "vinegar"
    ]
  },
  {
    "name": "bread",
    "type": "food",
    "value": 60,
    "source": "Cooking, The Saloon",
    "basicDescription": "A crusty baguette.",
    "longDescription": "Bread is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using Wheat Flour made in the Mill. Bread is available at the Stardrop Saloon every day for 120g, and randomly from Krobus's shop on Saturdays. The recipe can be obtained at Stardrop Saloon for 500g or via The Queen of Sauce (TV) on Year 1, Summer day 28",
    "heal": 22,
    "energy": 50,
    "recipe": [
      "wheatFlour"
    ]
  },
  {
    "name": "spaghetti",
    "type": "food",
    "value": 120,
    "source": "Cooking, The Saloon",
    "basicDescription": "An old favorite",
    "longDescription": "Spaghetti is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It is also available every day at The Stardrop Saloon for 240g and may randomly appear in Krobus' shop on Saturdays.  It can be obtained from Lewis via Mail after friendship has at least 3 hearts.",
    "heal": 75,
    "energy": 33,
    "recipe": [
      "wheatFlour",
      "tomato"
    ]
  },
  {
    "name": "pizza",
    "type": "food",
    "value": 300,
    "source": "Cooking, The Saloon",
    "basicDescription": "It's popular for all the right reasons.",
    "longDescription": "Pizza is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It is also available for purchase daily at The Stardrop Saloon for 600g and may randomly appear in Krobus' shop on Saturdays. The recipe can be obtained at Stardrop Saloon for 600g or via The Queen of Sauce (TV) on Year 2, Spring day 7 ",
    "heal": 67,
    "energy": 150,
    "recipe": [
      "wheatFlour",
      "tomato",
      "cheese"
    ]
  },
  {
    "name": "coffee",
    "type": "artisanGoods",
    "value": 150,
    "source": "Keg, Night Market for free, The Saloon",
    "basicDescription": "It smells delicious.  This is sure to give you a boost.",
    "longDescription": "Coffee is an edible Artisan Good made by placing 5 Coffee Beans inside a Keg. It is also available at The Saloon for 300g. When consumed, it grants the player a unique speed boost for 1m 23s that stacks with speed boosts from other food items. The speed of the players horse is also increased. If consumed after midnight, Coffee does not give a speed boost until the player wakes up in the morning. Despite being considered an Artisan Good, the sale price of Coffee does not benefit from the Artisan Profession. Note that 5 beans of the same quality (normal, silver, or gold) must be used to make coffee; the keg will not accept beans that are not in one stack of 5.",
    "heal": 1,
    "energy": 3,
    "recipe": [
      "coffeeBean",
      "coffeeBean",
      "coffeeBean",
      "coffeeBean",
      "coffeeBean"
    ]
  },
  {
    "name": "hashbrownsRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Hashbrowns.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 2 of Spring 14."
  },
  {
    "name": "omeletRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Omelet.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Spring 28."
  },
  {
    "name": "pancakesRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Pancakes.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Summer 14."
  },
  {
    "name": "breadRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Bread.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Summer 28."
  },
  {
    "name": "tortillaRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Tortilla.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Fall 7."
  },
  {
    "name": "pizzaRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Pizza.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 2 of Spring 7."
  },
  {
    "name": "makiRollRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Maki Rolls.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Summer 21."
  },
  {
    "name": "cheese",
    "type": "food",
    "value": 200,
    "source": "Cheese Press",
    "basicDescription": "It's your basic cheese.",
    "longDescription": "Cheese is an Artisan Good made from the Cheese Press, taking 3.3 hours. Using Milk will produce normal quality Cheese, while Large Milk will produce gold quality Cheese. Cheese can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Cheese. Normal, silver, and gold quality Cheese can be prematurely removed from a cask at any time by striking the cask with an Axe, Hoe, or Pickaxe.",
    "heal": 18,
    "energy": 40,
    "recipe": [
      "milk",
      "largeMilk"
    ]
  },
  {
    "name": "milk",
    "type": "animalProducts",
    "value": 125,
    "source": "Cow",
    "basicDescription": "A jug of cow's milk.",
    "longDescription": "Milk is an animal product obtained from a Cow by using a Milk Pail. It can also be obtained from Sandy at random, who will comment that the player looks thirsty. When a cow has a sufficient friendship and mood level, it can produce a Large Milk, which is more valuable. Milk can be used to make the following Artisan Goods. Note that regular Milk always produces regular quality Cheese, while Large Milk always produces gold-quality Cheese. The quality of the Milk is not a factor.",
    "heal": 17,
    "energy": 38
  },
  {
    "name": "largeMilk",
    "type": "animalProducts",
    "value": 190,
    "source": "Cow",
    "basicDescription": "A large jug of cow's milk.",
    "longDescription": "Large Milk is an animal product obtained from a Cow with sufficient friendship and mood. It can also randomly rotate into the Traveling Cart's stock for 570-1,000g. Large Milk can be used to make the following Artisan Goods. Note that regular Milk always produces regular quality Cheese, while Large Milk always produces gold-quality Cheese. The quality of the Milk is not a factor. Cheese may be aged in Casks to increase its quality.",
    "heal": 22,
    "energy": 50
  },
  {
    "name": "completeBreakfast",
    "type": "food",
    "value": 350,
    "source": "Cooking",
    "basicDescription": "You'll feel ready to take on the world!",
    "longDescription": "Complete Breakfast is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe can be obtained via the Queen of Sauce on Spring 21 of Year 2.",
    "heal": 90,
    "energy": 200,
    "recipe": [
        "friedEgg",
        "milk",
        "hashbrowns",
        "pancakes"
    ]
  },
    {
    "name": "friedEgg",
    "type": "food",
    "value": 35,
    "source": "Cooking",
    "basicDescription": "Sunny-side up.",
    "longDescription": "Fried Egg is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse.",
    "energy": 50,
    "heal": 22,
    "recipe": [
        "egg"
    ]
    },
    {
    "name": "hashbrowns",
    "type": "food",
    "value": 120,
    "source": "Cooking",
    "basicDescription": "Crispy and golden-brown!",
    "longDescription": "Hashbrowns are a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe can be obtained during Year 2 on Spring 14. or at the Saloon for 250g.",
    "energy": 90,
    "heal": 40,
    "recipe": [
        "potato",
        "oil"
    ]
  },
  {
    "name": "oil",
    "type": "food",
    "value": 80,
    "source": "Oil Maker",
    "basicDescription": "All purpose cooking oil.",
    "longDescription": "Oil is an Artisan Good and common cooking ingredient made from the Oil Maker. It can also be obtained from Pierre's General Store for 200g. Oil is given no quality rating, so its sell price doesn't benefit from quality increases. In addition, despite being labeled an 'Artisan Good' in-game, its sell price does not benefit from the Artisan Profession. Its main benefit lies in its use as a cooking ingredient. However, oil made from base quality sunflowers, cultivated sunflower seeds, and all qualities of corn is profitable, though corn is more profitable in the keg or preserves jar. Using a Sunflower to process Oil will be the fastest way, taking only about 60 in-game minutes.",
    "ingredients": [
        "corn",
        "sunflower",
        "sunflowerSeeds"
    ],
    "energy": 13,
    "heal": 5
  },
  {
    "name": "corn",
    "type": "food",
    "value": 50,
    "source": "Corn Seeds",
    "basicDescription": "One of the most popular grains. The sweet, fresh cobs are a summer favorite.",
    "longDescription": "Corn is a vegetable crop that grows from Corn Seeds after 14 days. Can be grown in the Summer and Fall. If a Corn plant (of any growth stage) is in the ground on the 28th of Summer, it will continue growing on the 1st of Fall as though nothing had changed. Fertilizer in the ground underneath a Corn plant on Summer 28 will not disappear on Fall 1.",
    "ingredients": [
        "sunflower",
        "sunflowerSeeds"
    ],
    "energy": 25,
    "heal": 11
  },
  {
    "name": "sunflower",
    "type": "food",
    "value": 80,
    "source": "Sunflower Seeds",
    "basicDescription": "A common misconception is that the flower turns so it's always facing the sun.",
    "longDescription": "The Sunflower is a flower crop that grows from Sunflower Seeds after 8 days. Unlike other flowers, they don't affect the type of Honey produced by nearby Bee Houses. Harvesting a sunflower will drop 1 Sunflower, and 0-3 Sunflower Seeds. The total seed drop often numbers around 75% to 90% of the number of sunflowers harvested. Sunflowers may be planted in both Summer and Fall. There is no difference in their behavior in either season. If a Sunflower plant (of any growth stage) is in the ground on the 28th of Summer, it will continue growing on the 1st of Fall as though nothing had changed. Fertilizer in the ground underneath a Sunflower plant on Summer 28 will not disappear on Fall 1.",
    "ingredients": [
        "corn",
        "sunflower",
        "sunflowerSeeds"
    ],
    "energy": 25,
    "heal": 11
  },
  {
    "name": "pancakes",
    "type": "food",
    "value": 80,
    "source": "Cooking",
    "basicDescription": "A double stack of fluffy, soft pancakes.",
    "longDescription": "Pancakes are a cooked dish. They are prepared using the kitchen inside an upgraded farmhouse. The recipe can be obtained at the Stardrop Saloon for 500g or from the Queen of Sauce TV show on Year 1, Summer 14.",
    "ingredients": [
        "corn",
        "sunflower",
        "sunflowerSeeds"
    ],
    "energy": 25,
    "heal": 11
  },
  {
    "name": "salmonDinner",
    "type": "food",
    "value": 300,
    "source": "Cooking",
    "basicDescription": "The lemon spritz makes it special.",
    "longDescription": "Salmon Dinner is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe can be obtained from Gus through the mail after obtaining three hearts of friendship with him.",
    "ingredients": [
        "salmon",
        "amaranth",
        "kale"
    ],
    "energy": 125,
    "heal": 56
  },
  {
    "name": "goldenPumpkin",
    "type": "all",
    "value": 2500,
    "source": "Spirit's Eve Festival in the Fall",
    "basicDescription": "It's valuable but has no other purpose",
    "longDescription": "he Golden Pumpkin is obtained during the Spirit's Eve Festival. It can be sold through the Shipping Bin for 2,500g or gifted as a Universally Loved gift (despite its description). To obtain the Golden Pumpkin, head north after arriving at the festival. Make your way through the maze until you reach a sign that contains a question mark. Proceed through the bushes to the left of the sign, then move north into a cave. Continue east and then south until you reach the treasure chest with the Golden Pumpkin. The Golden Pumpkin is a universally hated gift in v1.2, which is the current version for Xbox. For players using computers, Nintendo Switch, PlayStation 4 or mobile devices, the Golden Pumpkin is a universally loved gift."
  }
  ,
  {
    "name": "pearl",
    "type": "all",
    "value": 2500,
    "source": "Night Market Festival in the Winter",
    "basicDescription": "A rare treasure from the sea.",
    "longDescription": "The Pearl is a special item that can be obtained only during the Night Market Festival. There is a 0.4% chance to catch it while fishing in the Fishing Submarine. Otherwise, it can be obtained inside the Mermaid Boat by clicking on the clam shells in the correct sequence. The correct sequence is listed in Secret Note #15. From left to right, 1-5-4-2-3. Only one Pearl may be obtained from the Mermaid Boat per player per save file. A Pearl cannot be replicated in a Crystalarium."
  }
  ,
  {
    "name": "prismaticShard",
    "type": "minerals",
    "value": 2000,
    "source": "Geodes, various monsters at low drop rates.",
    "basicDescription": "A very rare and powerful substance with unknown origins.",
    "longDescription": "It is one of the rarest items in the game. It can be obtained from Omni Geodes (0.4%), Iridium Nodes (4%), Mystic Stones (25%), Gem Nodes and Fishing Treasure Chests. It is also a rare drop from Serpents (0.1%), Mummies (0.1%), Shadow Brutes (0.05%), and Shadow Shaman (0.05%). They have a small chance (0.05%) to be dropped by any monster after the player has reached the bottom of The Mines. Prismatic Shards cannot be duplicated in a Crystalarium. A Prismatic Shard can be used in The Desert to obtain the Galaxy Sword. A bug exists where multiple Prismatic Shards will be removed from the inventory if they are all in the same stack when obtaining the Galaxy Sword. The Dwarvish Headstone in the graveyard contains a riddle explaining how to obtain the Galaxy Sword. A Prismatic Shard can also be offered to the Dark Shrine of Selfishness at the Witch's Hut, in order to turn children into doves (getting rid of them permanently)."
  }
  ,
  {
    "name": "rabbitsFoot",
    "type": "animalProducts",
    "value": 565,
    "source": "Rabbit, Serpent, Traveling Cart",
    "basicDescription": "Some say it's lucky.",
    "longDescription": "The Rabbit's Foot is an animal product obtained from a Rabbit with sufficient friendship, mood, and daily luck. It can also occasionally be purchased from the Traveling Cart for 1,695-2,825g, or dropped by Serpents in the Skull Cavern. Luck buffs do not influence the chances of getting a rabbit's foot. In the Skull Cavern, the Serpent has a very low (0.8%) Chance of dropping a Rabbit's Foot."
  },
  {
    "name": "honey",
    "type": "artisanGoods",
    "value": 100,
    "source": "Bee House or Oasis",
    "basicDescription": "It's a sweet syrup produced by bees",
    "longDescription": "Honey is an Artisan Good made from the Bee House, using a variety of flowers. It does this every 4 days in every season other than Winter. It may be purchased from the Oasis on Fridays for Gold.png200g. Only flowers which are fully grown will have an effect on the type of honey produced. Flowers are not used up when a hive produces honey, and multiple hives can make honey from the same flower, so one flower can service a very large number of hives. If a Bee House has produced flower honey, but the flower is harvested before the honey, the honey will become 'Wild Honey.' Similarly, if a Bee House is removed with a tool while it has flower honey ready for harvesting, the honey will go into inventory as 'Honey', which is functionally identical to Wild Honey. Honey purchased from the Oasis or Traveling Cart is called 'Honey', and is also functionally identical to Wild Honey. Honey can be made into mead by placing it inside a keg."
  },
  {
    "name": "wine",
    "type": "artisanGoods",
    "value": 400,
    "source": "Keg",
    "basicDescription": "Drink in moderation.",
    "longDescription": "Wine is an Artisan Good made from the Keg, taking 7 days. It can also be received as a gift at the Feast of the Winter Star. The sell price of Wine depends on the fruit used (3  Base Fruit Value). When consumed, wine causes a Tipsy buff that decreases Speed by 1. The healing effect of Wine is the same no matter what fruit is used to make it. Note: It is possible to acquire Wine that has no base fruit (from the Traveling Cart or a Statue Of Endless Fortune, or as a gift at the Feast of the Winter Star). This item is simply titled 'Wine', and has a selling price of Gold.png400g (or Gold.png560g with the Artisan Profession). Wine can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Wine. Wine takes the longest to age of any item in Casks. It takes 2 seasons of aging to go from basic wine to iridium quality wine. Normal, silver, and gold quality Wine can be prematurely removed from a cask at any time by striking the cask with an Axe, Hoe, or Pickaxe."
  },
  {
    "name": "paleAle",
    "type": "artisanGoods",
    "value": 300,
    "source": "Keg",
    "basicDescription": "Drink in moderation.",
    "longDescription": "Pale Ale is an Artisan Good made from the Keg using Hops, taking 1-2 days. It has the second highest profit per day of any crop used in the Keg (after Starfruit, 12  base Hops value) and takes less time compared to other crops (tied with Wheat). When consumed, Pale Ale causes a Tipsy buff that decreases Speed by 1. Pale Ale can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Pale Ale. Normal, silver, and gold quality Pale Ale can be prematurely removed from a cask at any time by striking the cask with an Axe, Hoe, or Pickaxe.",
    "energy": 50,
    "heal": 22,
    "recipe": [
        "hops"
    ]
  },
  {
    "name": "beer",
    "type": "food",
    "value": 200,
    "source": "Keg, The Saloon",
    "basicDescription": "Drink in Moderation",
    "longDescription": "Beer is an Artisan Good made from the Keg using Wheat, taking 1-2 days. It is also available at The Saloon for 400g. It can also be received as a gift at the Feast of the Winter Star. When consumed, Beer causes a Tipsy Buff that decreases Speed by 1. Beer can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Beer.",
    "heal": 22,
    "energy": 50,
    "recipe": [
      "wheat"
    ]
  },
  {
    "name": "mead",
    "type": "artisanGoods",
    "value": 200,
    "source": "Keg",
    "basicDescription": "A fermented beverage made from honey. Drink in moderation.",
    "longDescription": "Mead is an Artisan Good made from placing Honey inside a Keg, taking 10 hours. Unlike Wine and Juice however, the value of the Mead is not affected by the type of honey used. The sell price of Mead is Gold.png200g, and only aging or the Artisan Profession can increase it. Several types of Flower Honey sell for more than Mead, so the player can actually lose money by making Mead. When consumed, Mead causes a Tipsy buff that decreases Speed by 1. Mead can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Mead. Normal, silver, and gold quality Mead can be prematurely removed from a cask at any time by striking the cask with an Axe, Hoe, or Pickaxe.",
    "heal": 33,
    "energy": 75,
    "recipe": [
      "honey"
    ]
  },
  {
    "name": "cheese",
    "type": "artisanGoods",
    "value": 200,
    "source": "Cheese Press",
    "basicDescription": "It's your basic cheese.",
    "longDescription": "Cheese is an Artisan Good made from the Cheese Press, taking 3.3 hours. Using Milk will produce normal quality Cheese, while Large Milk will produce gold quality Cheese. Cheese can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Cheese. Normal, silver, and gold quality Cheese can be prematurely removed from a cask at any time by striking the cask with an Axe, Hoe, or Pickaxe.",
    "energy": 125,
    "heal": 56,
    "recipe": [
        "milk",
        "largeMilk"
    ]
  },
  {
    "name": "goatCheese",
    "type": "artisanGoods",
    "value": 375,
    "source": "Cheese Press",
    "basicDescription": "Drink in moderation.",
    "longDescription": "Goat Cheese is an Artisan Good made by placing Goat Milk in a Cheese Press (takes 3.3 hours). Goat Cheese can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Goat Cheese. Normal, silver, and gold quality Goat Cheese can be prematurely removed from a cask at any time by striking the cask with an Axe, Hoe, or Pickaxe.",
    "energy": 125,
    "heal": 56
  },
  {
    "name": "juice",
    "type": "artisanGoods",
    "value": 1,
    "source": "Keg",
    "basicDescription": "A sweet, nutritious beverage",
    "longDescription": "Juice is an Artisan Good made from the Keg, taking approximately 4 days. Ignore the selling price on this page.  The selling price depends on the base value of the vegetable input multiplied by 2.25. The healing effect of Juice is the same no matter what vegetable is used to make it. Although Wheat and Hops are classified as vegetables, when used with a Keg, wheat produces Beer and hops produce Pale Ale. ",
    "energy": "75",
    "heal": "33"
  },
  {
    "name": "cloth",
    "type": "artisanGoods",
    "value": 470,
    "source": "Loom",
    "basicDescription": "A bolt of fine wool cloth",
    "longDescription": "Cloth is an Artisan Good made from the Loom using Wool, taking 4 hours. It can also be made from recycling a Soggy Newspaper using the Recycling Machine, and is an occasional drop from Mummies (5% chance) when slain. Emily may occasionally send you a Cloth in the mail.",
    "recipe": [
      "wool"
    ]
  },
  {
    "name": "wool",
    "type": "animalProducts",
    "value": 340,
    "source": "Rabbit, Sheep",
    "basicDescription": "Soft, fluffy wool",
    "longDescription": "Wool is an animal product obtained from a Rabbit or Sheep. Emily may also send you one Wool in the mail as a gift. Wool sells for a base price of Gold.png340g."
  },
  {
    "name": "mayonnaise",
    "type": "artisanGoods",
    "value": 190,
    "source": "Mayonnaise Machine",
    "basicDescription": "It looks spreadable",
    "longDescription": "Mayonnaise is an Artisan Good made from the Mayonnaise Machine, taking 3 hours. Large White/Brown or Dinosaur eggs will produce Gold quality mayonnaise. Normal sized White and Brown eggs will produce regular quality Mayonnaise. The quality of the egg is not a factor in determining the quality of the mayonnaise.",
    "recipe": [
      "egg",
      "largeEgg",
      "brownEgg",
      "largeBrownEgg"
    ]
  },
  {
    "name": "duckEgg",
    "type": "animalProducts",
    "value": 95,
    "source": "Ducks",
    "basicDescription": "It's still warm.",
    "longDescription": "The Duck Egg is an animal product obtained from a Duck. It may be placed in a Big or Deluxe Coop's incubator to create a Duck.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "largeEgg",
    "type": "animalProducts",
    "value": 95,
    "source": "Chicken",
    "basicDescription": "It's an uncommonly large egg!",
    "longDescription": "The Large Egg and the Large Brown Egg are animal products obtained from Chickens with sufficient friendship. Large Eggs produce Quality Mayonnaise when used with a Mayonnaise Machine. For cooking, regular and large eggs may be used interchangeably. Large Eggs can be hatched in an incubator, which comes with a Big or Deluxe Coop.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "egg",
    "type": "animalProducts",
    "value": 50,
    "source": "Chicken",
    "basicDescription": "A regular white/brown chicken egg.",
    "longDescription": "The Egg and the Brown Egg are animal products obtained from White, Brown, or Blue Chickens. Marnie may also gift you 12 eggs at the Feast of the Winter Star. Eggs can be hatched in an incubator, which comes with a Big or Deluxe Coop. Eggs can be used to make the following Artisan Goods. Note that regular eggs always produce regular quality Mayonnaise, while Large Eggs and Dinosaur Eggs always produce gold-quality Mayonnaise. The quality of the egg is not a factor.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "largeBrownEgg",
    "type": "animalProducts",
    "value": 95,
    "source": "Chicken",
    "basicDescription": "It's an uncommonly large brown egg!",
    "longDescription": "The Large Brown Egg are animal products obtained from Chickens with sufficient friendship. Large Eggs produce Quality Mayonnaise when used with a Mayonnaise Machine. For cooking, regular and large eggs may be used interchangeably. Large Eggs can be hatched in an incubator, which comes with a Big or Deluxe Coop.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "brownEgg",
    "type": "animalProducts",
    "value": 50,
    "source": "Chicken",
    "basicDescription": "A regular brown chicken egg.",
    "longDescription": "The Egg and the Brown Egg are animal products obtained from White, Brown, or Blue Chickens. Marnie may also gift you 12 eggs at the Feast of the Winter Star. Eggs can be hatched in an incubator, which comes with a Big or Deluxe Coop. Eggs can be used to make the following Artisan Goods. Note that regular eggs always produce regular quality Mayonnaise, while Large Eggs and Dinosaur Eggs always produce gold-quality Mayonnaise. The quality of the egg is not a factor.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "duckMayonnaise",
    "type": "artisanGoods",
    "value": 375,
    "source": "Mayonnaise Machine",
    "basicDescription": "It's a rich, yellow mayonnaise",
    "longDescription": "Duck Mayonnaise is an Artisan Good made by placing a Duck Egg into a Mayonnaise Machine, taking 3 hours.",
    "recipe": [
      "duckEgg"
    ]
  },
  {
    "name": "voidMayonnaise",
    "type": "artisanGoods",
    "value": 275,
    "source": "Mayonnaise Machine",
    "basicDescription": "A thick, black paste that smells like burnt hair.",
    "longDescription": "Void Mayonnaise is an Artisan Good made by placing a Void Egg inside the Mayonnaise Machine. It may be also be fished from the Witch's Swamp (25% chance if the player does not have one in inventory). Players may only fish a Void Mayonnaise from the Witch's Swamp while the Henchman is guarding the Witch's Hut. Gifting a Void Mayonnaise to the Henchman outside the Witch's Hut will allow players to pass during the quest Goblin Problem.",
    "recipe": [
      "voidEgg"
    ]
  },
  {
    "name": "truffleOil",
    "type": "artisanGoods",
    "value": 1065,
    "source": "Oil Maker",
    "basicDescription": "A gourmet cooking ingredient",
    "longDescription": "Truffle Oil is an Artisan Good made in the Oil Maker from a Truffle. It takes 5 to 6 hours to produce. Despite being listed as 'A gourmet cooking ingredient' there are no cooking recipes that use it, but it is used to make the Rain Totem.",
    "energy": 38,
    "heal": 17,
    "recipe": [
      "truffle"
    ]
  },
  {
    "name": "truffle",
    "type": "animalProducts",
    "value": 625,
    "source": "Pigs",
    "basicDescription": "A gourmet type of mushroom with a unique taste",
    "longDescription": "he Truffle is a type of mushroom that can only be spawned by a Pig on The Farm when the pig is outside the Barn. Since pigs do not go out of the barn in winter, they spawn no truffles in that season. Truffles sell for a base price of Gold.png625g. Despite being spawned by pigs, truffles are not considered to be animal produce, like eggs or milk. They do not receive a price increase from the Rancher profession. And despite being mushrooms, they technically are also not considered to be foraged items. They are not among the items included in the foraging category at the Stardew Valley Fair, nor are they labeled as 'Forage' in inventory. They do, however, benefit from the Gatherer and Botanist professions. Truffles not gathered on the 28th day of a season disappear on the following morning, the 1st day of the new season. On rare occasions, a Truffle can be purchased from the Traveling Cart for 1,875-3,125g.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "pickles",
    "type": "artisanGoods",
    "value": 1,
    "source": "Preserves Jar with any vegetable",
    "basicDescription": "A jar of your home-made pickles",
    "longDescription": "Jellies and pickles can be produced by inserting either a fruit or a vegetable in a preserves jar, respectively. The value of a single jar of jelly or pickles is equal to (2 * Base Crop Value + 50). Jelly and pickles are unaffected by the quality of the fruit or vegetable used. A preserves jar requires 4000 minutes to produce pickles or jelly. This will take 2-3 days, depending on sleep habits."
  },
  {
    "name": "jelly",
    "type": "artisanGoods",
    "value": 1,
    "source": "Preserves Jar with any fruit",
    "basicDescription": "Gooey",
    "longDescription": "Jellies and pickles can be produced by inserting either a fruit or a vegetable in a preserves jar, respectively. The value of a single jar of jelly or pickles is equal to (2 * Base Crop Value + 50). Jelly and pickles are unaffected by the quality of the fruit or vegetable used. A preserves jar requires 4000 minutes to produce pickles or jelly. This will take 2-3 days, depending on sleep habits."
  },
  {
    "name": "cheeseCauliflower",
    "type": "food",
    "value": 300,
    "source": "Cooking.",
    "basicDescription": "It smells great!",
    "longDescription": "Cheese Cauliflower is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It is shortened to 'Cheese Cauli.' in the stove menu in-game. The recipe can be obtained from Pam thru the mail after 3 hearts of friendship has been earned.",
    "energy": 138,
    "heal": 62,
    "recipe": [
      "cauliflower",
      "cheese"
    ]
  },
  {
    "name": "cauliflower",
    "type": "crops",
    "value": 75,
    "source": "Cauliflower Seeds",
    "basicDescription": "Valuable, but slow-growing.  Despite its pale color, the florets are packed with nutrients.",
    "longDescription": "Cauliflower is a vegetable crop that grows from Cauliflower Seeds after 12 days. Cauliflower is one of only three crops that can grow into a giant crop.",
    "energy": 75,
    "heal": 33
  },
  {
    "name": "bakedFish",
    "type": "food",
    "value": 100,
    "source": "Cooking",
    "basicDescription": "Baked fish on a bed of herbs",
    "longDescription": "Baked Fish is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse.  The recipe can be obtained through The Queen of Sauce on TV during Year 1 Summer 7.",
    "energy": 75,
    "heal": 33,
    "recipe": [
      "sunfish",
      "bream",
      "wheatFlour"
    ]
  },
  {
    "name": "sunfish",
    "type": "food",
    "value": 30,
    "source": "River in Spring/Summer from 6am to 7pm during sunny and windy weather.",
    "basicDescription": "A common river fish.",
    "longDescription": "The Sunfish is a fish that can be found in the river during Spring and Summer. It may also be purchased from the Traveling Cart for Gold.png100-1,000g, or found in Garbage Cans during Spring and Summer. The Sunfish may also be caught on the Riverlands Farm or on the Hill-top Farm.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "pufferfish",
    "type": "fish",
    "value": 200,
    "source": "Ocean",
    "basicDescription": "Inflates when threatened",
    "longDescription": "The Pufferfish is a fish that can be caught at the beach, on sunny summer days between 12pm and 4pm. It can also be purchased from the Traveling Cart for Gold.png600-1,000g.",
    "energy": -100
  },
  {
    "name": "anchovy",
    "type": "fish",
    "value": 30,
    "source": "Ocean",
    "basicDescription": "A small silver fish found in the ocean.",
    "longDescription": "he Anchovy is a fish that can be found in the ocean during the Spring and Fall. At higher Fishing skill, it may be easier to catch by casting less than the max distance.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "tuna",
    "type": "fish",
    "value": 100,
    "source": "Ocean",
    "basicDescription": "A large fish that lives in the ocean",
    "longDescription": "The Tuna is a fish that can be found in the ocean during the Summer and Winter. Though not common, it can also be found in trash cans.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "sardine",
    "type": "fish",
    "value": 40,
    "source": "Ocean",
    "basicDescription": "A common ocean fish.",
    "longDescription": "The Tuna is a fish that can be found in the ocean during the Summer and Winter. Though not common, it can also be found in trash cans.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "bream",
    "type": "fish",
    "value": 45,
    "source": "River",
    "basicDescription": "A fairly common river fish that becomes active at night.",
    "longDescription": "The Bream is a fish that can be found in the river during all seasons, after 6PM.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "largemouthBass",
    "type": "fish",
    "value": 100,
    "source": "Mountain Lake, ",
    "basicDescription": "basicDescription",
    "longDescription": "longDescription",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "smallmouthBass",
    "type": "fish",
    "value": 50,
    "source": "River and Forest Pond",
    "basicDescription": "A freshwater fish that is very sensitive to pollution",
    "longDescription": "The Smallmouth Bass is a fish that can be found in the river and forest pond during the Spring and Fall.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "rainbowTrout",
    "type": "fish",
    "value": 65,
    "source": "River and Mountain Lake",
    "basicDescription": "A freshwater trout with colorful markings.",
    "longDescription": "The Rainbow Trout is a fish that can be found in the river and mountain lake during the Summer.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "salmon",
    "type": "fish",
    "value": 75,
    "source": "River from 6AM-7PM in the Fall for any weather.",
    "basicDescription": "Swims upstream to lay its eggs.",
    "longDescription": "The Salmon is a fish that can be found in the river during the Fall. It may also be purchased from the Traveling Cart for 225-1,000g or found in Garbage Cans during Fall.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "walleye",
    "type": "fish",
    "value": 105,
    "source": "River, Mountain Lake, Forest Pond, Forest Farm Pond",
    "basicDescription": "A freshwater fish caught at night",
    "longDescription": "The Walleye is a fish that can be found in the river, lake, and forest pond during the Fall or Winter when it is raining. (A Rain Totem is required to make it rain in Winter.) It can also be found in Garbage Cans, during Fall and Winter, or it may randomly appear in the Traveling Cart's stock for Gold.png315-1,000g. If the player chooses the Forest Farm, walleye can also be caught in the farm pond.",
    "energy": 30,
    "heal": 13
  },
  {
    "name": "perch",
    "type": "fish",
    "value": 55,
    "source": "Mountain Lake, Forest River & Pond",
    "basicDescription": "A freshwater fish of the winter.",
    "longDescription": "The Perch is a fish that can be found in the Mountain Lake and river, and the Cindersap Forest river and pond during the Winter. It may also be purchased from the Traveling Cart for Gold.png165-1,000g, or found in Garbage Cans during Winter.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "carp",
    "type": "fish",
    "value": 30,
    "source": "Mountain Lake, Forest Pond, Secret Woods, The Sewers, Mutant Bug Lair",
    "basicDescription": "A common pond fish.",
    "longDescription": "The Carp is a fish that can be caught during any season. The best place to try to find one may be from the west side of the mountain lake, near the mines (during Spring, Summer, or Fall). Carp can be found in the pond in Cindersap Forest during Spring, Summer, or Fall as well. It is also available during any season in the pond in the Secret Woods. in The Sewers, or the Mutant Bug Lair.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "catfish",
    "type": "fish",
    "value": 200,
    "source": "Forest Pond, River, Secret Woods, Witch's Swamp",
    "basicDescription": "An uncommon fish found in streams",
    "longDescription": "The Catfish is a fish that can be found in the river (Town+Forest) and the pond in Cindersap Forest during the Spring and Fall during rainy weather. It can also be caught in Winter if a Rain Totem is used. In the Summer, it can be found in the Secret Woods or Witch's Swamp. It can also be found in Garbage Cans in Spring, Fall, or Winter. The Catfish can be caught on the Riverlands Farm or Hill-top Farm during rainy weather as well.",
    "energy": 50,
    "heal": 22
  },
  {
    "name": "pike",
    "type": "fish",
    "value": 100,
    "source": "River, Forest Pond",
    "basicDescription": "A freshwater fish that's difficult to catch.",
    "longDescription": "The Pike is a fish that can be found in the river (Town+Forest) and the pond in Cindersap Forest during the Summer and Winter.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "sunfish",
    "type": "fish",
    "value": 30,
    "source": "River",
    "basicDescription": "A common river fish.",
    "longDescription": "The Sunfish is a fish that can be found in the river during Spring and Summer. It may also be purchased from the Traveling Cart for Gold.png100-1,000g, or found in Garbage Cans during Spring and Summer. The Sunfish may also be caught on the Riverlands Farm or on the Hill-top Farm.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "redMullet",
    "type": "fish",
    "value": 75,
    "source": "Ocean",
    "basicDescription": "Long ago these were kept as pets.",
    "longDescription": "The Red Mullet is a fish that can be found in the ocean during the Summer and Winter.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "herring",
    "type": "fish",
    "value": 30,
    "source": "Ocean",
    "basicDescription": "A common ocean fish.",
    "longDescription": "The Herring is a fish that can be found in the ocean during the Spring and Winter.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "eel",
    "type": "fish",
    "value": 85,
    "source": "Ocean",
    "basicDescription": "A long, slippery little fish",
    "longDescription": "The Eel is a fish that can be found in the ocean during the Spring and Fall, when it's raining, from 4 PM to 2 AM. It can also rarely be found in Garbage Cans during Spring or Fall.",
    "energy": 30,
    "heal": 13
  },
  {
    "name": "octopus",
    "type": "fish",
    "value": 150,
    "source": "Ocean",
    "basicDescription": "A mysterious and intelligent creature.",
    "longDescription": "The Octopus is a fish that can be found during Summer in the ocean and (more rarely) in Garbage Cans. It can randomly rotate into daily stock at the Traveling Cart for Gold.png450-1,000g during any season. It can also be caught in the deep-sea submarine ride at the Night Market (2% chance). This is one of the most difficult fish to catch in the game, even compared to Legendary Fish. To make it even more demanding, the odds of an octopus biting are very rare, and the window of time available to catch it is comparatively small. The most sure-fire tactic is maxing out your fishing skill, equip the Iridium Rod, eat a Dish o' The Sea, Lobster Bisque, or Fish Stew, and attach a Trap Bobber to your fishing pole. Using a combination of a maxed out fishing skill and the Iridium Rod is often insufficient."
  },
  {
    "name": "redSnapper",
    "type": "fish",
    "value": 50,
    "source": "Ocean",
    "basicDescription": "A popular fish with a nice red color",
    "longDescription": "The Red Snapper is a fish that can be found in the ocean during the Summer and Fall during rainy weather. It can also be caught in the ocean during Winter if a Rain Totem is used.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "squid",
    "type": "fish",
    "value": 80,
    "source": "Ocean",
    "basicDescription": "A deep sea creature that can grow to enormous size",
    "longDescription": "The Squid is a fish that can be found in the ocean in the evening during the Winter. It can also be found in trash cans.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "seaCucumber",
    "type": "fish",
    "value": 75,
    "source": "Ocean",
    "basicDescription": "A slippery, slimy creature found on the ocean floor.",
    "longDescription": "The Sea Cucumber is a fish that can be found in the ocean or (rarely) in Garbage Cans during the Fall and Winter. It can also be purchased from the Traveling Cart for Gold.png225-1,000g. There is a 5% chance to catch a Sea Cucumber during the deep-sea submarine ride at the Night Market during Winter 15-17.",
    "energy": -25
  },
  {
    "name": "superCucumber",
    "type": "fish",
    "value": 250,
    "source": "Ocean",
    "basicDescription": "A rare, purple variety of sea cucumber.",
    "longDescription": "The Super Cucumber is a fish that can be found in the evening from 6pm to 2am, in the ocean during the Summer and Fall or (rarely) in a Garbage Can during the same seasons. It can also be caught during the deep-sea submarine ride at the Night Market (4% chance).",
    "energy": 125,
    "heal": 56
  },
  {
    "name": "ghostfish",
    "type": "fish",
    "value": 45,
    "source": "The Mines",
    "basicDescription": "A pale, blind fish found in underground lakes.",
    "longDescription": "The Ghostfish is a fish that can be found in The Mines on the 20th and 60th floor during all seasons. A Ghost may also drop a Ghostfish (8% chance) when slain.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "stonefish",
    "type": "fish",
    "value": 300,
    "source": "The mines, level 20",
    "basicDescription": "A bizarre fish that's shaped like a brick.",
    "longDescription": "The Stonefish is a fish that can be found in The Mines on the 20th floor during all seasons. It requires Fishing level 3, either naturally or using Fishing Buffs. It is the only fish, besides the Ghostfish, that may be caught on the 20th floor of the Mines."
  },
  {
    "name": "icePip",
    "type": "fish",
    "value": 500,
    "source": "The Mines, Level 60",
    "basicDescription": "A rare fish that thrives in extremely cold conditions",
    "longDescription": "The Ice Pip is a fish that can be found in the Mines on the 60th floor during all seasons. It requires fishing level 5, either naturally or using fishing Buffs. It is the only fish, besides the Ghostfish, that may be caught on the 60th floor of the Mines.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "lavaEel",
    "type": "fish",
    "value": 700,
    "source": "The Mines, Level 100",
    "basicDescription": "It can somehow survive in pools of red-hot lava.",
    "longDescription": "The Lava Eel is a fish that can be found in the Mines on the 100th floor during all seasons. It requires Fishing Level 7, either naturally or using Fishing Buffs. It is the only fish that may be caught on the 100th floor of the Mines and spawns rarely. Other than Legendary Fish, it is the second most difficult fish to catch and the fish with the highest sell price.",
    "energy": 50,
    "heal": 22
  },
  {
    "name": "sandfish",
    "type": "fish",
    "value": 75,
    "source": "The Desert",
    "basicDescription": "It tries to hide using camouflage",
    "longDescription": "The Sandfish is a fish that can be found in The Desert during all seasons. It may randomly roll into stock at the Traveling Cart for Gold.png225-1,000g. Due to the small size of the fishing area, it may be impossible to catch gold quality fish in the desert pond.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "scorpionCarp",
    "type": "fish",
    "value": 150,
    "source": "The Desert",
    "basicDescription": "It's like a regular carp but with a sharp stinger.",
    "longDescription": "The Scorpion Carp is a fish that can be found in The Desert during all seasons (6am-8pm)and can also randomly be purchased from the Traveling Cart for between Gold.png450-1,000g. It is the only other fish that can be caught in the Desert, besides the Sandfish. Since it is more valuable than the Sandfish, it is also more rare to get a bite from a Scorpion Carp, and the difficulty is significantly greater. Catching the Scorpion Carp requires Fishing level 4, either naturally or by using fishing Buffs. Due to the small size of the fishing area, it may be impossible to catch gold quality fish in the desert pond.",
    "energy": -125
  },
  {
    "name": "sturgeon",
    "type": "fish",
    "value": 200,
    "source": "Mountain Lake",
    "basicDescription": "An ancient bottom-feeder with a dwindling population. Females can live up to 150 years.",
    "longDescription": "The Sturgeon is a fish that can be found in the mountain lake during the Summer and Winter. It may also randomly appear in Krobus' shop on Wednesdays.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "tigerTrout",
    "type": "fish",
    "value": 150,
    "source": "River",
    "basicDescription": "A rare hybrid trout that cannot bear offspring of its own.",
    "longDescription": "The Tiger Trout is a fish that can be found in the river (6am-7pm) in Pelican Town and the Cindersap Forest during the Fall and Winter. It may also randomly appear in Krobus' shop on Wednesdays.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "bullhead",
    "type": "fish",
    "value": 75,
    "source": "Mountain Lake",
    "basicDescription": "A relative of the catfish that eats a variety of foods off the lake bottom.",
    "longDescription": "The Bullhead is a fish that can be found in the mountain lake during all seasons. It may also randomly appear in Krobus' shop on Wednesdays.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "tilapia",
    "type": "fish",
    "value": 75,
    "source": "Ocean",
    "basicDescription": "A primarily vegetarian fish that prefers warm water.",
    "longDescription": "The Tilapia is a fish that can be found in the ocean during the Summer and Fall. It may also randomly appear in Krobus' shop on Wednesdays or at the Traveling Cart.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "chub",
    "type": "fish",
    "value": 50,
    "source": "Mountain lake, River",
    "basicDescription": "A common freshwater fish known for its voracious appetite.",
    "longDescription": "The Chub is a fish that can be found in the mountain lake and river, as well as the Cindersap Forest river, during all seasons. It may also randomly appear in Krobus' shop on Wednesdays.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "dorado",
    "type": "fish",
    "value": 100,
    "source": "Forest River",
    "basicDescription": "A fierce carnivore with brilliant orange scales.",
    "longDescription": "The Dorado is a fish that can be found in the forest river during the Summer from 6am to 7pm. It may also randomly appear in Krobus' shop on Wednesdays.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "albacore",
    "type": "fish",
    "value": 75,
    "source": "Ocean",
    "basicDescription": "Prefers temperature 'edges' where cool and warm water meet.",
    "longDescription": "The Albacore is a fish that can be found in the ocean during the Fall and Winter in the early morning and at night. It may also randomly appear in Krobus' shop on Wednesdays.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "shad",
    "type": "fish",
    "value": 60,
    "source": "River",
    "basicDescription": "Lives in a school at sea, but returns to rivers to spawn.",
    "longDescription": "The Shad is a fish that can be found in the river during the Spring, Summer, and Fall during rainy weather from 9am to 2am. It may also randomly appear in Krobus' shop on Wednesdays.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "lingcod",
    "type": "fish",
    "value": 120,
    "source": "River, Mountain Lake",
    "basicDescription": "A fearsome predator that will eat almost anything it can cram into its mouth.",
    "longDescription": "The Lingcod is a fish that can be found in the river or Mountain Lake during the Winter. It may also randomly appear in Krobus' shop on Wednesdays or the Traveling Cart's stock for Gold.png360-1,000g.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "halibut",
    "type": "fish",
    "value": 80,
    "source": "Ocean",
    "basicDescription": "A flat fish that lives on the ocean floor",
    "longDescription": "Halibut is a fish that can be found in the ocean during the Spring, Summer, and Winter. It may also randomly appear in Krobus' shop on Wednesdays. from 6am-11am and 7pm-2am.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "woodskip",
    "type": "fish",
    "value": 75,
    "source": "Secret Woods, Forest Farm",
    "basicDescription": "A very sensitive fish that can only live in pools deep in the forest.",
    "longDescription": "The Woodskip is a fish that can be found in the Secret Woods in any season. It can also be found on The Farm, provided the player chose the Forest Farm.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "voidSalmon",
    "type": "fish",
    "value": 150,
    "source": "Witch's Swamp",
    "basicDescription": "A salmon, twisted by void energy. The fresh meat is jet black, but rapidly turns pink when exposed to air.",
    "longDescription": "The Void Salmon is a fish that can only be found in the Witch's Swamp through the cave beside the train platform. Players must complete the quest Dark Talisman before the passage to the Witch's Swamp will open. The fish can be caught there in any season during any weather at any time. Once the cave passage has been opened, the player can return there whenever they wish.",
    "energy": 63,
    "heal": 28
  },
  {
    "name": "slimejack",
    "type": "fish",
    "value": 100,
    "source": "Mutant Bug Lair thru the Sewers.",
    "basicDescription": "He's coated in a very thick layer of slime. He keeps slipping out of your hands!",
    "longDescription": "The Slimejack is a fish that can be found only in the Mutant Bug Lair through The Sewers. Players must be on the quest Dark Talisman before the passage to the Mutant Bug Lair will open. The fish can be caught there in any season during any weather at any time. Once the passage has been opened the player can return there whenever they wish. It's challenging to fish for Slimejack, as the Mutant Flies inside the Mutant Bug Lair will continuously spawn and attack the player while fishing.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "midnightSquid",
    "type": "fish",
    "value": 100,
    "source": "Submarine at Night Market",
    "basicDescription": "A strange and mysterious denizen of the ocean's twilight depths.",
    "longDescription": "The Midnight Squid is a fish that can be found only in the submarine ride at the Night Market, which takes place at The Beach during Winter 15-17. Due to the small size of the fishing area, it may be impossible to catch gold quality fish in the submarine.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "spookFish",
    "type": "fish",
    "value": 220,
    "source": "Submarine at Night Market",
    "basicDescription": "The huge eyes can detect the faint silhouettes of prey.",
    "longDescription": "The Spook Fish is a fish that can be found only in the submarine ride at the Night Market, which takes place at The Beach during Winter 15-17. Due to the small size of the fishing area, it may be impossible to catch gold quality fish in the submarine.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "blobfish",
    "type": "fish",
    "value": 500,
    "source": "Submarine at Night Market",
    "basicDescription": "This odd creature floats above the ocean floor, consuming any edible material in its path.",
    "longDescription": "The Blobfish is a fish that can be found only in the submarine ride at the Night Market, which takes place at The Beach during Winter 15-17. Due to the small size of the fishing area, it may be impossible to catch gold quality fish in the submarine.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "crimsonfish",
    "type": "fish",
    "value": 1500,
    "source": "Ocean",
    "basicDescription": "Lives deep in the ocean but likes to lay its eggs in the warm summer water.",
    "longDescription": "The Crimsonfish is a fish that can be found in the ocean during Summer on the eastern pier of the beach (on the east side of the small bridge that requires 300 wood to repair). It requires Fishing level 5, either naturally or using Fishing Buffs. It is also known as one of the five Legendary Fish. You can only catch it once per save file.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "angler",
    "type": "fish",
    "value": 900,
    "source": "Pelican Town",
    "basicDescription": "Uses a bioluminescent dangler to attract prey.",
    "longDescription": "The Angler is a fish that can be found north of Joja Mart on the wooden plank bridge during the Fall, with a fishing level of at least 3. Stand in the center of the wooden plank and cast north. (Casting south is also possible, if casting 3 or fewer tiles away from the bridge.) It is also known as one of the five Legendary Fish. You can only catch it once per save file.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "legend",
    "type": "fish",
    "value": 5000,
    "source": "Mountain Lake",
    "basicDescription": "The king of all fish! They said he'd never be caught.",
    "longDescription": "The Legend is a fish that can be found during Spring in the mountain lake while raining. Deep water. High bite chance near the log. Requires level 10 fishing, either naturally or using a cooking buff. It is known as one of the five Legendary Fish. Unlike the other Legendary Fish which can be caught only once, you can catch as many Legend fish as you are able, within one save file. Of all the items in the game, it has the highest potential sell price per a single item.",
    "energy": 500,
    "heal": 225
  },
  {
    "name": "glacierfish",
    "type": "fish",
    "value": 1000,
    "source": "Cindersap Forest",
    "basicDescription": "Builds a nest on the underside of claciers.",
    "longDescription": "The Glacierfish is a fish that can be found in Cindersap Forest during the Winter. It requires fishing level 7, either naturally or by using fishing Buffs. It is also known as one of the five Legendary Fish. You can only catch it once per save file.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "mutantCarp",
    "type": "fish",
    "value": 1000,
    "source": "The Sewers",
    "basicDescription": "The strange waters of the sewer turned this carp into a monstrosity.",
    "longDescription": "The Mutant Carp is a fish that can be found in the Sewers during all seasons. It is also known as one of the five Legendary Fish. You can only catch it once per save file. A strategy to catch this fish is to stay in the middle of the fishing minigame area until the fish begins resting somewhere else (such as the bottom or top), then stay there. The fish will move up and down continuously to shake you off and staying in the middle will allow for a slow but continuous catch.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "lobster",
    "type": "fish",
    "value": 120,
    "source": "Ocean with a Crab Pot",
    "basicDescription": "A large ocean-dwelling crustacean with a strong tail.",
    "longDescription": "The Lobster is a fish that can be found in the ocean during any season using a Crab Pot."
  },
  {
    "name": "clam",
    "type": "fish",
    "value": 50,
    "source": "Crab Pots, Foraging at the Beach",
    "basicDescription": "Someone lived here once.",
    "longDescription": "The Clam is a fish that can be found in the ocean during any season using a Crab Pot. It can also be foraged from The Beach."
  },
  {
    "name": "crayfish",
    "type": "fish",
    "value": 75,
    "source": "Farm Ponds, River, Mountain Lake, Forest Pond, all using a Crab Pot",
    "basicDescription": "A small freshwater relative of the lobster.",
    "longDescription": "The Crayfish is a fish that can be found in freshwater during any season using a Crab Pot. It may also randomly appear in the Traveling Cart's stock for Gold.png225-1,000g."
  },
  {
    "name": "crab",
    "type": "fish",
    "value": 100,
    "source": "Ocean using a Crab Pot",
    "basicDescription": "A marine crustacean with two powerful pincers.",
    "longDescription": "The Crab is a fish that can be found in the ocean during any season using a Crab Pot. It can also be dropped by a Rock Crab (15% chance) or Lava Crab (25% chance) when slain."
  },
  {
    "name": "cockle",
    "type": "fish",
    "value": 50,
    "source": "Ocean, The Beach using a Crab Pot",
    "basicDescription": "A common saltwater clam.",
    "longDescription": "The Cockle is a fish that can be found in the ocean during any season using a crab pot. It can also be foraged from the Beach."
  },
  {
    "name": "mussel",
    "type": "fish",
    "value": 30,
    "source": "Ocean, The Beach, using a Crab Pot",
    "basicDescription": "A common bivalve that often lives in clusters.",
    "longDescription": "The Mussel is a fish that can be found in the ocean during any season using a Crab Pot. It can also be foraged from the Beach."
  },
  {
    "name": "shrimp",
    "type": "fish",
    "value": 60,
    "source": "Ocean using a Crab Pot",
    "basicDescription": "A scavenger that feeds off the ocean floor. Widely prized for its meat.",
    "longDescription": "The Shrimp is a fish that can be found in the ocean during any season using a Crab Pot."
  },
  {
    "name": "snail",
    "type": "fish",
    "value": 65,
    "source": "Farm Ponds, River, Mountain Lake, Forest Pond with a Crab Pot",
    "basicDescription": "A wide-ranging mollusc that lives in a spiral shell.",
    "longDescription": "The Snail is a fish that can be found in freshwater in any season by using a Crab Pot."
  },
  {
    "name": "periwinkle",
    "type": "fish",
    "value": 20,
    "source": "Farm Ponds, River, Lake, using a Crab Pot",
    "basicDescription": "A tiny freshwater snail that lives in a blue shell.",
    "longDescription": "The Periwinkle is a fish that can be found in freshwater during any season using a Crab Pot."
  },
  {
    "name": "oyster",
    "type": "fish",
    "value": 40,
    "source": "Ocean, The Beach, using a Crab Pot.",
    "basicDescription": "Constantly filters water to find food. In the process, it removes dangerous toxins from the environment.",
    "longDescription": "The Oyster is a fish that can be found in the ocean during any season using a crab pot. It can also be foraged from the Beach."
  },
  {
    "name": "seaweed",
    "type": "fish",
    "value": 20,
    "source": "Fishing in the Ocean",
    "basicDescription": "It can be used in cooking.",
    "longDescription": "Seaweed is an item that can be found in the ocean by fishing during all seasons. There is a 41% chance to catch Seaweed while fishing in the deep-sea submarine ride at the Night Market. Catching Seaweed gives 3 Fishing XP.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "greenAlgae",
    "type": "fish",
    "value": 15,
    "source": "Fishing, Green Slimes.",
    "basicDescription": "It's really slimy.",
    "longDescription": "Green Algae is an item that can be found in all fishing spots during all seasons, with the exception of the Farm Pond of the Standard Farm. When caught while fishing, Green Algae gives 3 Fishing XP. It's also a rare drop from Green Slimes.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "whiteAlgae",
    "type": "fish",
    "value": 25,
    "source": "Fishing, Monster Drops",
    "basicDescription": "It's super slimy.",
    "longDescription": "White Algae is an item which can be commonly caught while Fishing in The Mines, The Sewers, The Mutant Bug Lair,The Witch's Swamp or rarely in the Ocean. When caught while fishing, White Algae gives 3 Fishing XP. White Algae can also be dropped by several Monsters: Grubs, Mutant Grubs, Flies, Mutant Flies, Bugs, and Red and Purple Slimes.",
    "energy": 20,
    "heal": 9
  },

  {
    "name": "amaranth",
    "type": "crops",
    "value": 150,
    "source": "Amaranth Seeds in the Fall",
    "basicDescription": "A purple grain cultivated by an ancient civilization",
    "longDescription": "Amaranth is a vegetable crop that grows from Amaranth Seeds after 7 days. Amaranth is harvested using a Scythe.",
    "energy": 50,
    "heal": 22,
    "recipe": [
      "amaranthSeeds"
    ]
  },
  {
    "name": "artichoke",
    "type": "crops",
    "value": 160,
    "source": "Artichoke Seeds in the Fall",
    "basicDescription": "The bud of a thistle plant. The spiny outer leaves conceal a fleshy, filling interior.",
    "longDescription": "The Artichoke is a vegetable crop that grows from Artichoke Seeds after 8 days. The seeds are available from Pierre's General Store starting in Year 2.",
    "energy": 30,
    "heal": 13,
    "recipe": [
      "artichokeSeeds"
    ]
  },
  {
    "name": "beet",
    "type": "crops",
    "value": 100,
    "source": "Beet Seeds in the Fall",
    "basicDescription": "A sweet and earthy root vegatable. As a bonus, the leaves make a great salad",
    "longDescription": "The Beet is a vegetable crop that grows from Beet Seeds after 6 days. Beet Seeds can be purchased from the Oasis. Players have the ability to craft Sugar from Beets by using a Mill. Once placed in the mill, one Beet will make three sugar. Sugar will appear in the box on the right side of the mill the following morning.",
    "energy": 30,
    "heal": 13,
    "recipe": [
      "beetSeeds"
    ]
  },
  {
    "name": "bokChoy",
    "type": "crops",
    "value": 80,
    "source": "Bok Choy Seeds in the Fall",
    "basicDescription": "The leafy greens and fibrous stalks are healthy and delicious",
    "longDescription": "Bok Choy is a vegetable crop that grows from Bok Choy Seeds after 4 days.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "bokChoySeeds"
    ]
  },
  {
    "name": "cauliflower",
    "type": "crops",
    "value": 175,
    "source": "Cauliflower Seeds in the Spring",
    "basicDescription": "Valuable, but slow-growing. Despite its pale color, the florets are packed with nutrients.",
    "longDescription": "Cauliflower is a vegetable crop that grows from Cauliflower Seeds after 12 days. Cauliflower is one of only three crops that can grow into a giant crop.",
    "energy": 75,
    "heal": 33,
    "recipe": [
      "cauliflowerSeeds"
    ]
  },
  {
    "name": "corn",
    "type": "crops",
    "value": 50,
    "source": "Corn Seeds in the Summer and Fall",
    "basicDescription": "One of the most popular grains. The sweet, fresh cobs are a summer favorite.",
    "longDescription": "Corn is a vegetable crop that grows from Corn Seeds after 14 days.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "cornSeeds"
    ]
  },
  {
    "name": "eggplant",
    "type": "crops",
    "value": 60,
    "source": "Eggplant Seeds in the Fall",
    "basicDescription": "A rich and wholesome relative of the tomato. Delicious fried or stewed.",
    "longDescription": "Eggplant is a vegetable crop that grows from Eggplant Seeds after 5 days.",
    "energy": 20,
    "heal": 9,
    "recipe": [
      "eggplantSeeds"
    ]
  },
  {
    "name": "fiddleheadFern",
    "type": "crops",
    "value": 90,
    "source": "Foraging in the Secret Woods in the Summer",
    "basicDescription": "The young shoots are an edible Specialty.",
    "longDescription": "The Fiddlehead Fern is a foraged vegetable found in the Secret Woods during Summer. Despite being a foraged item, its sell price increases by the Tiller profession bonus amount (10%), even though that profession is associated with skill in farming.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "garlic",
    "type": "crops",
    "value": 60,
    "source": "Garlic Seeds in the Spring",
    "basicDescription": "Adds a wonderful zestiness to dishes. High quality garlic can be pretty spicy.",
    "longDescription": "Garlic is a vegetable crop that grows from Garlic Seeds after 4 days. The seeds are available at Pierre's General Store starting in Year 2.",
    "energy": 20,
    "heal": 9,
    "recipe": [
      "garlicSeeds"
    ]
  },
  {
    "name": "greenBean",
    "type": "crops",
    "value": 40,
    "source": "Bean Starter in the Spring",
    "basicDescription": "A juicy little bean with a cool, crist snap.",
    "longDescription": "The Green Bean is a vegetable crop that grows from Bean Starter after 10 days. This crop uses a trellis, and continues to produce after maturity. Be aware, you cannot move onto a tile with a trellis, but you must be adjacent to a planted tile in order to harvest the plant. You must plan the layout of your plantings in order to guarantee access for harvesting.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "beanStarter"
    ]
  },
    {
      "name": "hops",
      "type": "crops",
      "value": 300,
      "source": "Hops starter in the Summer",
      "basicDescription": "A bitter, tangy flower used to flavor beer.",
      "longDescription": "Hops is a vegetable crop that grows from Hops Starter after 11 days in the Summer. Hops can be put into a Keg to make Pale Ale. Pale Ale has one of the highest returns on investment in the game, surpassed only by Starfruit wine.",
      "energy": 45,
      "heal": 20,
      "recipe": [
        "hopsStarter"
      ]
    },
  {
    "name": "kale",
    "type": "crops",
    "value": 110,
    "source": "Kale Seeds in the Spring",
    "basicDescription": "The waxy leaves are great in soups and stir frys.",
    "longDescription": "Kale is a vegetable crop that grows from Kale Seeds after 6 days. Kale is harvested using a Scythe.",
    "energy": 50,
    "heal": 22,
    "recipe": [
      "kaleSeeds"
    ]
  },
  {
    "name": "parsnip",
    "type": "crops",
    "value": 35,
    "source": "Parsnip Seeds in the Spring",
    "basicDescription": "A spring tuber closely related to the carrot. It has an earthy taste and is full of nutrients.",
    "longDescription": "The Parsnip is a vegetable crop that grows from Parsnip Seeds after 4 days.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "parsnipSeeds"
    ]
  },
  {
    "name": "potato",
    "type": "crops",
    "value": 80,
    "source": "Potato Seeds in the Spring",
    "basicDescription": "A widly cultivated tuber.",
    "longDescription": "The Potato is a vegetable crop that grows in the Spring from Potato Seeds after 6 days.  When harvested, each Potato plant gives 1 potato, with a random chance to produce extra potatoes, partially based on Daily Luck.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "potatoSeeds"
    ]
  },
  {
    "name": "pumpkin",
    "type": "crops",
    "value": 320,
    "source": "Pumpkin Seeds in the Fall",
    "basicDescription": "A fall favorite, grown for its crunchy seeds and delicately flavored flesh. As a bonus, the hollow shell can be carved into a festive decoration.",
    "longDescription": "The Pumpkin is a vegetable crop that grows from Pumpkin Seeds after 13 days. It is one of three crops which might produce a giant crop, along with Cauliflower and Melon. After Starfruit it has the second-highest per unit base price of all the normal crops.",
    "recipe": [
      "pumpkinSeeds"
    ]
  },
  {
    "name": "radish",
    "type": "crops",
    "value": 90,
    "source": "Radish Seeds in the Summer",
    "basicDescription": "A crisp and refreshing root vegetable with hints of pepper when eaten raw.",
    "longDescription": "The Radish is a vegetable crop that grows from Radish Seeds after 6 days.",
    "energy": 45,
    "heal": 20,
    "recipe": [
      "radishSeeds"
    ]
  },
  {
    "name": "redCabbage",
    "type": "crops",
    "value": 260,
    "source": "Red Cabbage Seeds in the Summer",
    "basicDescription": "Often used in salads and coleslaws. The color can range from purple to blue to green-yellow depending on soil conditions.",
    "longDescription": "Red Cabbage is a vegetable crop that grows from Red Cabbage Seeds after 9 days. The seeds are available starting in Year 2. There is a small chance of buying Red Cabbage or Red Cabbage Seeds from the Traveling Cart.",
    "energy": 75,
    "heal": 33,
    "recipe": [
      "redCabbageSeeds"
    ]
  },
  {
    "name": "tomato",
    "type": "crops",
    "value": 60,
    "source": "Tomato Seeds in the Summer",
    "basicDescription": "Rich and slightly tangy, the Tomato has a wide variety of culinary uses.",
    "longDescription": "The Tomato is a vegetable crop that grows from Tomato Seeds after 11 days. When harvested, each Tomato plant gives 1 Tomato every 4 days, with a small random chance for more Tomatoes.",
    "heal": 9,
    "energy": 20,
    "recipe": [
      "tomatoSeeds"
    ]
  },
  {
    "name": "wheat",
    "type": "crops",
    "value": 25,
    "source": "Wheat Seeds in the Summer and Fall",
    "basicDescription": "One of the most widely cultivated grains. Makes a great flour for breads and cakes.",
    "longDescription": "Wheat is a vegetable crop that grows from Wheat Seeds after 4 days. Wheat is harvested using a Scythe. In addition to Beer, players have the ability to craft Wheat Flour from Wheat by using a Mill. Once placed in the mill, one wheat will make one wheat flour. Wheat flour will appear in the box on the right side of the mill the following morning.",
    "recipe": [
      "wheatSeeds"
    ]
  },
  {
    "name": "yam",
    "type": "crops",
    "value": 160,
    "source": "Yam Seeds in the Fall",
    "basicDescription": "A starchy tuber with a lot of culinary verstatility",
    "longDescription": "The Yam is a vegetable crop that grows from Yam Seeds after 10 days. It also has a 3% chance of dropping from Duggies.",
    "energy": 45,
    "heal": 20,
    "recipe": [
      "yamSeeds"
    ]
  },
  {
    "name": "wildHorseradish",
    "type": "food",
    "value": 50,
    "source": "Foraging in Spring",
    "basicDescription": "A spicy root found in the spring",
    "longDescription": "Wild Horseradish is found via foraging in the Spring, or grown from Spring Seeds. Putting a Wild Horseradish in a Seed Maker will generate 1-3 Spring Seeds.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "daffodil",
    "type": "forageables",
    "value": 30,
    "source": "Foraging in the Spring or grown from Spring Seeds",
    "basicDescription": "A traditional spring flower that makes a nice gift.",
    "longDescription": "The Daffodil is found via foraging in the Spring, or grown from Spring Seeds. Although it is a flower in its description (and in real life), the game classifies it as 'Forage' and not 'Flower'.",
    "energy": 0,
    "heal": 0,
    "recipe": [
      "springSeeds"
    ]
  },
  {
    "name": "leek",
    "type": "food",
    "value": 60,
    "source": "Foraging, Spring Seeds",
    "basicDescription": "A tasty relative of the onion.",
    "longDescription": "The Leek is found via foraging in the Spring, or grown from Spring Seeds. On Tuesdays, Evelyn may say that they can be found in the mountains, where they may be more common, but Leeks can be found above ground throughout Stardew Valley.",
    "heal": 18,
    "energy": 40
  },
  {
    "name": "dandelion",
    "type": "food",
    "value": 40,
    "source": "Foraging, Spring Seeds, Flower Dance",
    "basicDescription": "Not the prettiest flower, but the leaves make a good salad.",
    "longDescription": "The Dandelion is found via foraging in the Spring, or grown from Spring Seeds. Up to ten can also be purchased from Pierre at the Flower Dance. Although it is a flower in its description (and in real life), the game classifies it as 'Forage' and not 'Flower'.",
    "heal": 18,
    "energy": 40
  },
  {
    "name": "springOnion",
    "type": "food",
    "value": 8,
    "source": "Foraging in Cindersap Forest",
    "basicDescription": "These grow wild during the spring",
    "longDescription": "The Spring Onion is found via foraging in Spring in Cindersap Forest in the area north of the Sewer entrance. The Livin' Off The Land Television channel airs a tip about Spring Onions on day 4. Spring Onions also can be purchased from Traveling Cart for Gold.png100-1,000g. Once the player has earned 8 hearts of friendship with Jas and Vincent, Spring Onion Mastery can be obtained, which permanently increases the sell price of Spring Onions by 5.",
    "energy": 13,
    "heal": 5
  },
  {
    "name": "morel",
    "type": "food",
    "value": 150,
    "source": "Foraging in the Secret Woods or grown in The Cave",
    "basicDescription": "Sought after for its unique nutty flavor",
    "longDescription": "The Morel is a mushroom found in the Spring via foraging in the Secret Woods or on the Forest Farm. It can also be found in the the Cave after choosing the mushroom option.",
    "energy": 20,
    "heal": 9
  },
  {
    "name": "commonMushroom",
    "type": "food",
    "value": 40,
    "source": "Foraging around Stardew Valley, or grown in The Cave",
    "basicDescription": "Slightly nutty, with a good texture",
    "longDescription": "The Common Mushroom is a mushroom found via foraging throughout Stardew Valley in the Fall. They can also be found in the Secret Woods during Spring and Fall and on the Forest Farm during Summer. They can be grown from Wild Seeds (Fa) or in mushroom bins in the The Cave if the mushroom option is chosen. They can also be obtained by tapping a Mushroom Tree. Putting a Common Mushroom in a Seed Maker will generate 1-3 Fall Seeds.",
    "energy": 38,
    "heal": 17
  },
  {
    "name": "salmonberry",
    "type": "food",
    "value": 5,
    "source": "Foraging in bushes around Stardew Valley",
    "basicDescription": "A spring-time berry with the flavor of the forest",
    "longDescription": "The Salmonberry is a foraged fruit found on bushes in Stardew Valley during Salmonberry Season (Spring 15-18). It won't be found in the wild outside those days. It can be found at any time (randomly) in the Farm Cave if the fruit bat option is chosen. At Foraging Skill Level 4, two berries will be harvested from each bush instead of one. At Foraging Skill Level 8, three berries will be harvested from each bush. If Foraging Skill is temporarily increased to 12 or 13 by consuming food, then 4 berries will be harvested from each bush. However, Salmonberries themselves give no foraging experience when harvested. Salmonberry has the lowest sell value of any foraged item, making it one of the few fruits that is worth more as a Jelly than a Wine. It can also make them more useful for gifting or eating than for selling. Salmonberries shaken from bushes during Salmonberry Season will always be regular quality, unless the Botanist Profession is chosen, in which case they will always be iridium quality. Salmonberries found in The Farm Cave can be normal, silver, or gold quality unless the Botanist Profession is chosen, in which case they will always be iridium quality.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "spiceBerry",
    "type": "food",
    "value": 80,
    "source": "Foraging in the Summer, or grown from Summer Seeds",
    "basicDescription": "It fills the air with a pungent aroma",
    "longDescription": "The Spice Berry is a fruit found via foraging in the Summer or grown from Summer Seeds. Putting a Spice Berry in a Seed Maker will generate 1-3 Summer Seeds.",
    "energy": 25,
    "heal": 11
  },
  {
    "name": "grape",
    "type": "crops",
    "value": 80,
    "source": "Foraging in the Summer or grown in the Fall",
    "basicDescription": "A sweet cluster of fruit.",
    "longDescription": "The Grape is a fruit crop that grows from Grape Starter in the Fall, which takes 10 days to grow. They can also be foraged in Pelican Town, in the Summer, or grown from Summer Seeds. The sales price of grapes that are grown as a crop (in Fall) receive the Tiller profession bonus (as do all crops). However, the sales price of grapes foraged (in Summer), do not receive the bonus. (Note: there seems to be a program bug in the price that arises when you sell a mixture of crop and forage grapes at the same time.)",
    "energy": 38,
    "heal": 17,
    "recipe": [
      "grapeStarter",
      "summerSeeds"
    ]
  },
  {
    "name": "sweetPea",
    "type": "crops",
    "value": 50,
    "source": "Foraging in the Summer or grown from Summer Wild Seeds",
    "basicDescription": "A gragrant summer flower",
    "longDescription": "The Sweet Pea is a flower found via foraging in the Summer or grown from Summer wild seeds.",
    "energy": 0,
    "heal": 0,
    "recipe": [
      "summerSeeds"
    ]
  },
  {
    "name": "redMushroom",
    "type": "food",
    "value": 75,
    "source": "Foraging in the Secret Woods in the Summer or grown in The Cave",
    "basicDescription": "A spotted mushroom sometimes found in caves",
    "longDescription": "The Red Mushroom is found in The Mines, via foraging in the Secret Woods in the Summer and (more rarely) Fall, grown in the The Farm Cave if the mushroom option is chosen, on the farm in fall if the Forest Farm Map has been chosen, or from a tapped Mushroom Tree. It may also be occasionally found in Garbage Cans or at the Traveling Cart.",
    "energy": -50
  },
  {
    "name": "wildPlum",
    "type": "crops",
    "value": 80,
    "source": "Foraging in the Fall or grown from Fall Seeds",
    "basicDescription": "Tart and juicy with a pungent aroma",
    "longDescription": "The Wild Plum is a fruit found via foraging throughout Stardew Valley in the Fall. It can also be grown from Fall Seeds.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "fallSeeds"
    ]
  },
  {
    "name": "hazelnut",
    "type": "crops",
    "value": 90,
    "source": "Foraging in the Fall or grown from Fall Seeds",
    "basicDescription": "That's one big hazelnut!",
    "longDescription": "The Hazelnut is found via foraging throughout Stardew Valley in the Fall. It can also be grown from Fall Seeds. Clicking on a Maple Tree during Fall has a chance to cause a hazelnut to drop from the tree.",
    "energy": 30,
    "heal": 13,
    "recipe": [
      "fallSeeds"
    ]
  },
  {
    "name": "blackberry",
    "type": "crops",
    "value": 20,
    "source": "Foraging in the Fall or grown from Fall Seeds",
    "basicDescription": "An early-fall treat.",
    "longDescription": "The Blackberry is a Fruit found via Foraging throughout Stardew Valley. It can be found on the ground during Fall and on bushes during Blackberry Season (Fall 8-11). It can also be grown from Wild Seeds (Fa) (also known as Fall Seeds). During blackberry season, the number of berries obtained from each blackberry bush increases as Foraging Skill increases. At Level 4, two berries will be harvested from each bush instead of one. At Level 8, three berries will be harvested from each bush. If Foraging Skill is temporarily increased to 12 or 13 by consuming food, then 4 berries will be harvested from each bush. Blackberries shaken from bushes during Blackberry Season will always be regular quality, unless the Botanist Profession is chosen, in which case they will always be iridium quality. Blackberries picked up from the ground or grown from Fall Seeds will be normal, silver, or gold quality unless the Botanist Profession is chosen, in which case they will always be iridium quality.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "fallSeeds"
    ]
  },
  {
    "name": "chanterelle",
    "type": "food",
    "value": 160,
    "source": "Foraging in the Fall or grown in The Cave",
    "basicDescription": "A tasty mushroom with a fruity smell and slightly peppery flavor.",
    "longDescription": "The Chanterelle is found via foraging in the Secret Woods in the Fall or grown in The Farm Cave if the Mushroom option is chosen.",
    "energy": 75,
    "heal": 33
  },
  {
    "name": "winterRoot",
    "type": "food",
    "value": 70,
    "source": "Foraging in the Winter or grown from Winter Seeds or from Tilling the soil",
    "basicDescription": "A starchy tuber",
    "longDescription": "The Winter Root is a foraging item found only in Winter. Unlike other forage items found on the ground, to obtain a Winter Root, you must dig with the Hoe. It's not necessary to dig at an Artifact Spot, although Winter Root may be found at Artifact Spots. A Winter Root may be found by digging any tillable soil in Stardew Valley outside of The Farm, including The Desert. They may also be grown from Winter Wild Seeds. Occasionally they may be sold at the Traveling Cart or found in Garbage Cans in Winter. They may also be dropped by Blue Slimes (8% chance) in The Mines (floors 40-80) or Secret Woods. Putting a Winter Root in a Seed Maker will generate 1-3 Winter Seeds. Winter Roots give no foraging experience when harvested around town.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "winterSeeds"
    ]
  },
  {
    "name": "crystalFruit",
    "type": "crops",
    "value": 150,
    "source": "Foraging in the winter or grown from Winter Seeds",
    "basicDescription": "A delicate fruit that pops up from the snow.",
    "longDescription": "The Crystal Fruit is found via foraging in the Winter, by killing Dust Sprites in The Mines (floors 40 to 80), or by growing Winter wild seeds.",
    "energy": 63,
    "heal": 28,
    "recipe": [
      "winterSeeds"
    ]
  },
  {
    "name": "snowYam",
    "type": "crops",
    "value": 100,
    "source": "Tilling the soil or grown from Winter Seeds or foraging in the Winter",
    "basicDescription": "This little yam was hiding beneath the snow",
    "longDescription": "he Snow Yam is a foraging item found only in Winter. Unlike other forage items found on the ground, to obtain a Snow Yam, you must dig with the Hoe. It's not necessary to dig at an Artifact Spot, although Snow Yams may be found at Artifact Spots. Snow Yams may be found by digging any tillable soil in Stardew Valley outside of The Farm (including The Desert). They may also be grown from Winter Wild Seeds. Snow Yams give no foraging experience when harvested around town.",
    "energy": 30,
    "heal": 13,
    "recipe": [
      "winterSeeds"
    ]
  },
  {
    "name": "crocus",
    "type": "crops",
    "value": 60,
    "source": "Foraging in the Winter or grown from Winter Seeds",
    "basicDescription": "A flower that can bloom in the winter",
    "longDescription": "The Crocus is a flower found via foraging in the Winter, or grown from Winter wild seeds",
    "energy": 0,
    "heal": 0,
    "recipe": [
      "winterSeeds"
    ]
  },
  {
    "name": "holly",
    "type": "food",
    "value": 80,
    "source": "Foraging in the winter",
    "basicDescription": "The leaves and bright red berries make a popular winter decoration.",
    "longDescription": "Holly is found via foraging in the Winter. Holly can be found throughout Stardew Valley, including in the Secret Woods",
    "energy": -37,
    "heal": 0
  },
  {
    "name": "nautilusShell",
    "type": "forageables",
    "value": 120,
    "source": "Foraging on The Beach in the Winter",
    "basicDescription": "An ancient shell",
    "longDescription": "The Nautilus Shell is found via foraging at The Beach in winter. The player may randomly receive one in the mail from Demetrius. It can also be received as a gift at the Feast of the Winter Star."
  },
  {
    "name": "coral",
    "type": "forageables",
    "value": 80,
    "source": "The Beach",
    "basicDescription": "A colony of tiny creatures that clump together to form beautiful structures.",
    "longDescription": "Coral is found via foraging at The Beach in all seasons."
  },
  {
    "name": "seaUrchin",
    "type": "forageables",
    "value": 160,
    "source": "The Beach",
    "basicDescription": " A slow-moving spiny creature that some consider a delicacy.",
    "longDescription": "The Sea Urchin is found via foraging at The Beach in all seasons. They spawn regularly across the broken bridge, which can be repaired with 300 wood (see The Beach). Emily may occasionally send you a Sea Urchin in the mail as a gift."
  },
  {
    "name": "rainbowShell",
    "type": "forageables",
    "value": 300,
    "source": "Foraging the Beach in the Summer",
    "basicDescription": "It's a very beautiful shell.",
    "longDescription": "The Rainbow Shell is found via foraging at The Beach in the Summer. During the off-seasons, it can be obtained through the Traveling Cart. It may also be sent in the mail as a gift from Demetrius. It can also be received as a gift from Jas or Vincent at the Feast of the Winter Star."
  },
  {
    "name": "caveCarrot",
    "type": "forageables",
    "value": 25,
    "source": "Foraging The Mines or Garbage Cans",
    "basicDescription": "A starchy snack found in caves. It helps miners work longer",
    "longDescription": "The Cave Carrot is found via foraging in The Mines. It can also be found in Garbage Cans. Large quantities can be easily obtained by digging underground patches of dirt in The Mines (on levels 10-20) with the Hoe.",
    "energy": 30,
    "heal": 13
  },
  {
    "name": "coconut",
    "type": "forageables",
    "value": 100,
    "source": "Foraging in the Calico Desert or bought at Oasis",
    "basicDescription": "A seed of the coconut palm. It has many culinary uses",
    "longDescription": "The Coconut is an inedible Foraged Fruit found only in the Calico Desert. It can also be bought at the Oasis on Mondays for Gold.png200g or may randomly appear in the Traveling Cart's stock for Gold.png300-1,000g. Although it is inedible, it may be put in a Preserves Jar to make Coconut Jelly, or in a Keg to make Coconut Wine. Coconuts can not be planted to create Palm Trees."
  },
  {
    "name": "cactusFruit",
    "type": "forageables",
    "value": 75,
    "source": "Foraging in the Calico Desert or bought in the Oasis or grown from Cactus Seeds",
    "basicDescription": "The sweet fruit of the prickly pear cactus",
    "longDescription": "The Cactus Fruit is found via foraging in the Calico Desert. It can also be bought at the Oasis on Tuesdays for Gold.png150g or randomly at the Traveling Cart for Gold.png225-1,000g. Cactus Fruit may also be grown from Cactus Seeds. Cactus Fruit grown from Cactus Seeds benefits from the Tiller Profession bonus.",
    "energy": 75,
    "heal": 33,
    "recipe": [
      "cactusSeeds"
    ]
  },
  {
    "name": "tulip",
    "type": "crops",
    "value": 30,
    "source": "Grown from Tulip Bulbs in the Spring",
    "basicDescription": "The most popular spring flower.  Has a very faint sweet smell.",
    "longDescription": "The Tulip is a flower crop that grows from Tulip Bulbs after 6 days. Tulips can be purchased from the Traveling Cart for Gold.png100-1,000g.",
    "energy": 45,
    "heal": 20,
    "recipe": [
      "tulipBulb"
    ]
  },
  {
    "name": "summerSpangle",
    "type": "crops",
    "value": 90,
    "source": "Grown from Spangle Seeds in the Summer",
    "basicDescription": "A tropical bloom that thrives in the humid summer air. Has a sweet, tangy aroma",
    "longDescription": "Summer Spangle is a flower crop that grows from Spangle Seeds after 8 days.",
    "energy": 45,
    "heal": 20,
    "recipe": [
      "spangleSeeds"
    ]
  },
  {
    "name": "fairyRose",
    "type": "crops",
    "value": 290,
    "source": "Fairy Seeds grown in the Fall",
    "basicDescription": "An old folk legend suggests that the sweet smell of this flower attracts fairies.",
    "longDescription": "The Fairy Rose is a flower crop that grows from Fairy Seeds after 12 days. Although the profit margins on the Fairy Rose are not exceptional, the Honey made from the flowers represents the most profitable honey.",
    "energy": 45,
    "heal": 20,
    "recipe": [
      "fairySeeds"
    ]
  },
  {
    "name": "blueJazz",
    "type": "crops",
    "value": 50,
    "source": "Jazz Seeds grown in the Spring",
    "basicDescription": "The flower grows in a sphere to invite as many butterflies as possible.",
    "longDescription": "Blue Jazz is a flower crop that grows from Jazz Seeds after 7 days.",
    "energy": 45,
    "heal": 20,
    "recipe": [
      "jazzSeeds"
    ]
  },
  {
    "name": "rhubarb",
    "type": "crops",
    "value": 220,
    "source": "Rhubarb Seeds grown in the Spring",
    "basicDescription": "The stalks are extremely tart, but make a great dessert when sweetened.",
    "longDescription": "Rhubarb is a fruit crop that grows from Rhubarb Seeds after 13 days. Rhubarb seeds can be purchased only from the Oasis, or occasionally from the Traveling Cart.",
    "recipe": [
      "rhubarbSeeds"
    ]
  },
  {
    "name": "hotPepper",
    "type": "crops",
    "value": 40,
    "source": "Pepper Sees grown in the Summer",
    "basicDescription": "Fiery hot with a hint of sweetness.",
    "longDescription": "The Hot Pepper is a fruit crop that grows from Pepper Seeds after 5 days. When harvested, each Hot Pepper plant gives 1 Hot Pepper every 3 days, with a small random chance for more Hot Peppers.",
    "energy": 13,
    "heal": 5,
    "recipe": [
      "pepperSeeds"
    ]
  },
  {
    "name": "poppy",
    "type": "crops",
    "value": 140,
    "source": "Poppy Seeds grown in the Summer",
    "basicDescription": "In addition to its colorful flower, the Poppy has culinary and medicinal uses",
    "longDescription": "The Poppy is a flower crop that grows from Poppy Seeds after 7 days.",
    "energy": 45,
    "heal": 20,
    "recipe": [
      "poppySeeds"
    ]
  },
  {
    "name": "melon",
    "type": "crops",
    "value": 250,
    "source": "Melon Seeds grown in the Summer",
    "basicDescription": "A cool, sweet summer treat.",
    "longDescription": "The Melon is a fruit crop that grows from Melon Seeds after 12 days. Melon is one of only three crops that can grow into a giant crop.",
    "energy": 113,
    "heal": 50,
    "recipe": [
      "melonSeeds"
    ]
  },
  {
    "name": "blueberry",
    "type": "crops",
    "value": 50,
    "source": "Blueberry Seeds grown in the Summer",
    "basicDescription": "A popular berry reported to have many health benefits. The blue skin has the highest nutrient concentration.",
    "longDescription": "The Blueberry is a fruit crop that grows from Blueberry Seeds after 13 days. A Preserves Jar can make Blueberries into jelly, and a Keg can make them into wine, which can then be aged in a Cask. When sold, blueberry prices benefit from the Tiller profession, and its jelly and wine prices benefit from the Artisan profession. Each harvest yields 3 Blueberries, with a small random chance for more.",
    "energy": 25,
    "heal": 11,
    "recipe": [
      "blueberrySeeds"
    ]
  },
  {
    "name": "cranberries",
    "type": "crops",
    "value": 75,
    "source": "Cranberry Seeds grown in the Fall",
    "basicDescription": "",
    "longDescription": "Cranberries are a fruit crop that grows from Cranberry Seeds after 7 days, and keeps producing fruit every 5 days after maturity. When harvested, each Cranberry plant gives 2 Cranberries every 5 days, with a small random chance for more Cranberries.",
    "energy": 38,
    "heal": 17,
    "recipe": [
      "cranberrySeeds"
    ]
  },
  {
    "name": "apple",
    "type": "crops",
    "value": 100,
    "source": "Apple Tree grown from an Apple Tree harvested in the Fall",
    "basicDescription": "A crisp fruit used for juice and cider.",
    "longDescription": "The Apple is a fruit grown by planting an Apple Sapling, waiting 28 days for it to grow into an Apple Tree, and harvesting the tree during the Fall. An Apple may be purchased at the Traveling Cart for Gold.png300-1,000g or found in The Farm Cave, if the fruit bat option is chosen.",
    "energy": 38,
    "heal": 17,
    "recipe": [
      "appleSapling"
    ]
  },
  {
    "name": "apricot",
    "type": "crops",
    "value": 50,
    "source": "Apricot Tree grown from an Apricot Sapling harvested in the Spring",
    "basicDescription": "A tender little fruit with a rock-hard pit",
    "longDescription": "The Apricot is a fruit grown by planting an Apricot Sapling, waiting 28 days for it to grow into an Apricot Tree, and harvesting the tree during the Spring. An Apricot may be purchased at the Traveling Cart for Gold.png150-1,000g or found in The Farm Cave, if the fruit bat option is chosen.",
    "energy": 38,
    "heal": 17,
    "recipe": [
      "apricotSapling"
    ]
  },
  {
    "name": "mapleSyrup",
    "type": "crops",
    "value": 200,
    "source": "Using a Tapper on a Maple Tree after 7 to 8 days",
    "basicDescription": "A sweet syrup with a unique flavor.",
    "longDescription": "Maple Syrup is Tree sap made from the Tapper when it is placed on a Maple Tree, taking Time Icon.png 7 to 8 days. Maple Syrup can be obtained by tapping Maple Trees growing on The Farm or growing naturally in Stardew Valley (e.g., in Cindersap Forest). Although Maple Syrup is labeled 'Artisan Good' in-game, it does not benefit from the Artisan Profession, but instead from the Tapper Profession (+25% sell price).",
    "energy": 50,
    "heal": 22,
    "recipe": [
      "mapleSeed"
    ]
  },
  {
    "name": "mapleSeed",
    "type": "crops",
    "value": 5,
    "source": "Chopping a Maple Tree",
    "basicDescription": "Place this on your farm to plant a maple tree",
    "longDescription": "The Maple Seed is a seed that grows into a Maple Tree. It can be obtained by shaking/chopping down a Maple Tree at Foraging level 1, in Garbage Cans, or by using an Axe or Pickaxe to dig up a Maple Seed dropped by a fully grown Maple Tree on The Farm. A maple seed has approximately a 20% chance to grow to the next stage each night during Spring, Summer, or Fall. The median time to maturity is about 18 days, with over 90% of seeds maturing in less than 32 growing days."
  },
  {
    "name": "lifeElixir",
    "type": "food",
    "value": 500,
    "source": "Crafting",
    "basicDescription": "Restores health to full.",
    "longDescription": "Life Elixir is an edible crafted item. The recipe is earned at Combat skill level 2. Iridium Bats in the Skull Cavern may drop a Life Elixir when slain (5% chance). Despite the numbers listed on the tooltip, the Life Elixir will fully restore Health to maximum regardless of how low it currently is.",
    "energy": 200,
    "heal": 90,
    "recipe": [
      "redMushroom",
      "purpleMushroom",
      "morel",
      "chanterelle"
    ]
  },
  {
    "name": "purpleMushroom",
    "type": "forageables",
    "value": 250,
    "source": "The Mines, The Cave",
    "basicDescription": "A rare mushroom found deep in caves.",
    "longDescription": "The Purple Mushroom is found via foraging in The Mines (starting at level 81), the Skull Cavern, from a tapped Mushroom Tree (rarely), or grown in the Mushroom Cave (rarely). It can also be received as a gift at the Feast of the Winter Star. Purple Mushrooms can also be found on the Forest Farm Map during the Fall.",
    "energy": 125,
    "heal": 56
  },
  {
    "name": "parsnipSoup",
    "type": "food",
    "value": 120,
    "source": "Cooking",
    "basicDescription": "It's fresh and hearty",
    "longDescription": "Parsnip Soup is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Parsnip Soup may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe is obtained thru the mail after obtaining three friendship hearts with Caroline.",
    "energy": 85,
    "heal": 38,
    "recipe": [
      "parsnip",
      "milk",
      "vinegar"
    ]
  },
  {
    "name": "vegetableMedley",
    "type": "food",
    "value": 120,
    "source": "Cooking",
    "basicDescription": "This is very nutritious",
    "longDescription": "Vegetable Medley (also called 'Vegetable Stew' in the Cooking interface) is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Vegetable Medley may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe is obtained thru the mail after gaining 7 friendship hearts with Caroline.",
    "energy": 165,
    "heal": 74,
    "recipe": [
      "tomato",
      "beet"
    ]
  },
  {
    "name": "friedCalamari",
    "type": "food",
    "value": 150,
    "source": "Cooking",
    "basicDescription": "It's so chewy",
    "longDescription": "Fried Calamari is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Fried Calamari may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. Although a type of squid, Midnight Squid does not count towards the recipe for Fried Calamari",
    "energy": 80,
    "heal": 36,
    "recipe": [
      "squid",
      "wheatFlour",
      "oil"
    ]
  },
  {
    "name": "strangeBun",
    "type": "food",
    "value": 225,
    "source": "Cooking, Monster drop, Traveling Cart",
    "basicDescription": "What's inside?",
    "longDescription": "The Strange Bun is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Strange Bun may be dropped by a Shadow Brute (4% chance), and may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. It may also randomly rotate into stock at the Traveling Cart for Gold.png675-1,125g. By offering a Strange Bun to the Dark Shrine of Night Terrors in the Witch's Hut, players can toggle monster spawning on or off on their farm.",
    "energy": 100,
    "heal": 45,
    "recipe": [
      "wheatFlour",
      "periwinkle",
      "voidMayonnaise"
    ]
  },
  {
    "name": "luckyLunch",
    "type": "food",
    "value": 250,
    "source": "Cooking",
    "basicDescription": "A special little meal.",
    "longDescription": "Lucky Lunch is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Lucky Lunch may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe is obtained thru The Queen of Sauce on Year 2, Spring 28",
    "energy": 100,
    "heal": 45,
    "recipe": [
      "seaCucumber",
      "tortilla",
      "blueJazz"
    ]
  },
  {
    "name": "friedMushroom",
    "type": "food",
    "value": 200,
    "source": "Cooking",
    "basicDescription": "Earthy and aromatic",
    "longDescription": "Fried Mushroom is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Fried Mushroom may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. Recipe obtained from Demetrius thru the mail after gaining 3 friendship hearts.",
    "energy": 135,
    "heal": 60,
    "recipe": [
      "commonMushroom",
      "morel",
      "oil"
    ]
  },
  {
    "name": "beanHotpot",
    "type": "food",
    "value": 100,
    "source": "Cooking",
    "basicDescription": "It sure is healthy",
    "longDescription": "Bean Hotpot is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Bean Hotpot may randomly appear in Krobus' shop on Saturdays or in The Stardrop Saloon's rotating stock. Recipe obtained from Clint thru the mail after gaining 7 hearts of friendship.",
    "energy": 125,
    "heal": 56,
    "recipe": [
      "greenBean",
      "greenBean"
    ]
  },
  {
    "name": "glazedYams",
    "type": "food",
    "value": 200,
    "source": "Cooking",
    "basicDescription": "Sweet and satisfying.. The sugar gies it a hint of caramel",
    "longDescription": "Glazed Yams is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Glazed Yams may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock.",
    "energy": 200,
    "heal": 90,
    "recipe": [
      "yam",
      "sugar"
    ]
  },
  {
    "name": "carpSurprise",
    "type": "food",
    "value": 150,
    "source": "Cooking",
    "basicDescription": "It's bland and oily.",
    "longDescription": "Carp Surprise is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Turning the Carp into Sashimi will be even more profitable, however. Carp Surprise may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from The Queen of Sauce on Year 2 on Summer 7.",
    "energy": 90,
    "heal": 40,
    "recipe": [
      "carp",
      "carp",
      "carp",
      "carp"
    ]
  },
  {
    "name": "fishTaco",
    "type": "food",
    "value": 500,
    "source": "Cooking",
    "basicDescription": "It smells delicious",
    "longDescription": "Fish Taco is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Fish Taco may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe is obtained from Linus thru the mail after obtaining 7 hearts of friendship.",
    "energy": 165,
    "heal": 74,
    "recipe": [
      "tuna",
      "tortilla",
      "redCabbage",
      "mayonnaise"
    ]
  },
  {
    "name": "crispyBass",
    "type": "food",
    "value": 150,
    "source": "Cooking",
    "basicDescription": "Wow, the breading is perfect.",
    "longDescription": "Crispy Bass is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Crispy Bass may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe is obtained from Kent thru the mail after obtaining 3 hearts of friendship.",
    "energy": 90,
    "heal": 40,
    "recipe": [
      "largemouthBass",
      "wheatFlour",
      "oil"
    ]
  },
  {
    "name": "pepperPoppers",
    "type": "food",
    "value": 200,
    "source": "Cooking",
    "basicDescription": "Spicy breaded peppers filled with cheese.",
    "longDescription": "Pepper Poppers is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Pepper Poppers may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe is obtained from Shane thru the mail after obtaining 3 hearts of friendship with him.",
    "energy": 130,
    "heal": 58,
    "recipe": [
      "hotPepper",
      "cheese"
    ]
  },
  {
    "name": "tomKhaSoup",
    "type": "food",
    "value": 250,
    "source": "Cooking",
    "basicDescription": "These flavors are incredible!",
    "longDescription": "Tom Kha Soup is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Tom Kha Soup may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from Sandy thru the mail after obtaining 7 hearts of friendship.",
    "energy": 175,
    "heal": 78,
    "recipe": [
      "coconut",
      "shrimp",
      "commonMushroom"
    ]
  },
  {
    "name": "troutSoup",
    "type": "food",
    "value": 100,
    "source": "Cooking or Fish Shop",
    "basicDescription": "Pretty salty",
    "longDescription": "Trout Soup is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It may also be purchased at Willy's Fish Shop for Gold.png250g. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Trout Soup may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from the Queen of Sauce on Year 1, Fall 14",
    "energy": 100,
    "heal": 45,
    "recipe": [
      "rainbowTrout",
      "greenAlgae"
    ]
  },
  {
    "name": "chocolateCake",
    "type": "food",
    "value": 200,
    "source": "Cooking",
    "basicDescription": "Rich and moist with a thick fudge icing.",
    "longDescription": "Chocolate Cake is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Three Chocolate Cakes are the reward for completing the Bundle Red.png 2,500 Bundle in the Vault. Chocolate Cake may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from The Queen of Sauce on Year 1, Winter 14.",
    "energy": 150,
    "heal": 67,
    "recipe": [
      "wheatFlour",
      "sugar",
      "egg"
    ]
  },
  {
    "name": "pinkCake",
    "type": "food",
    "value": 480,
    "source": "Cooking",
    "basicDescription": "There's little heart candies on top.",
    "longDescription": "Pink Cake is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Three Pink Cakes are the reward for completing the Bundle Red.png Chef's Bundle on the Bulletin Board. Pink Cake can be received as a gift at the Feast of the Winter Star. It may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. If the player's character is male, after he earns Gold.png120,000g he will receive a letter from mom with a Pink Cake enclosed. The recipe can be obtained from The Queen of Sauce on Year 2 of Summer 21.",
    "energy": 250,
    "heal": 112,
    "recipe": [
      "melon",
      "wheatFlour",
      "sugar",
      "egg"
    ]
  },
  {
    "name": "rhubarbPie",
    "type": "food",
    "value": 400,
    "source": "Cooking",
    "basicDescription": "Mmm, tangy and sweet!",
    "longDescription": "Rhubarb Pie is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality rhubarb as well as wheat flour and sugar from the Mill. Rhubarb Pie may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe is obtained from Marnie thru the mail after obtaining 7 hearts of friendship.",
    "energy": 215,
    "heal": 96,
    "recipe": [
      "rhubarb",
      "wheatFlour",
      "sugar"
    ]
  },
  {
    "name": "cookie",
    "type": "food",
    "value": 140,
    "source": "Cooking",
    "basicDescription": "Very chewy.",
    "longDescription": "Cookie is a cooked dish prepared using the kitchen inside an upgraded farmhouse. Cookies can be received as a gift from Evelyn at the Feast of the Winter Star, and are rarely found in the Garbage Can outside George and Evelyn's home. Cookies may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. If the player's character is male, after he earns Gold.png5,000g he will receive a letter from mom with cookies enclosed. The recipe is obtained from Evelyn after reaching 4 hearts of friendship.",
    "energy": 90,
    "heal": 40,
    "recipe": [
      "wheatFlour",
      "sugar",
      "egg"
    ]
  },
  {
    "name": "friedEel",
    "type": "food",
    "value": 120,
    "source": "Cooking",
    "basicDescription": "Greasy but powerful",
    "longDescription": "Fried Eel is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Fried Eel may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from George in the mail after three hearts of friendship.",
    "energy": 75,
    "heal": 33,
    "recipe": [
      "eel",
      "oil"
    ]
  },
  {
    "name": "spicyEel",
    "type": "food",
    "value": 175,
    "source": "Cooking",
    "basicDescription": "It's really spicy! Be careful.",
    "longDescription": "Spicy Eel is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It can also be dropped by a Serpent in the Skull Cavern (6% chance). Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Spicy Eel may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from George thru the mail after 7 hearts of friendship",
    "energy": 115,
    "heal": 51,
    "recipe": [
      "eel",
      "hotPepper"
    ]
  },
  {
    "name": "sashimi",
    "type": "food",
    "value": 75,
    "source": "75",
    "basicDescription": "Raw fish sliced into thin pieces.",
    "longDescription": "Sashimi is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Sashimi may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. Note: This recipe can be profitable if using fish worth less than Gold.png75g (see When to turn your fish into sashimi for more info). Saving fish worth less than Gold.png75g for Help Wanted quests may be a better option, though, since these quests generally pay triple the fish's base value. (Periwinkle is an exception -- at Gold.png20g base price it's more profitable to turn into Sashimi than save for quests).",
    "energy": 75,
    "heal": 33,
    "recipe": [
      "anyFish"
    ]
  },
  {
    "name": "anyFish",
    "type": "fish",
    "value": 1,
    "source": "The water",
    "basicDescription": "An ingredient that includes any fish available in the game.",
    "longDescription": "An ingredient that includes any fish available in the game.",
    "energy": 1,
    "heal": 1
  },
  {
    "name": "makiRoll",
    "type": "food",
    "value": 220,
    "source": "Cooking",
    "basicDescription": "Fish and rice wrapped in seaweed",
    "longDescription": "Maki Roll is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Maki Roll may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from the Saloon or Queen of Sauce on Year 1 of Summer 21",
    "energy": 100,
    "heal": 45,
    "recipe": [
      "anyFish",
      "seaweed",
      "rice"
    ]
  },
  {
    "name": "tortilla",
    "type": "food",
    "value": 50,
    "source": "Cooking",
    "basicDescription": "Can be used as a vessel for food",
    "longDescription": "Tortilla is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Tortilla may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained thru the Queen of Sauce on Year 1, Fall 7 or purchased at the Saloon",
    "energy": 50,
    "heal": 22,
    "recipe": [
      "corn"
    ]
  },
  {
    "name": "redPlate",
    "type": "food",
    "value": 400,
    "source": "Cooking",
    "basicDescription": "Full of antioxidants",
    "longDescription": "Red Plate is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Red Plate may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. Recipe can be obtained from Emily thru the mail after reaching 7 hearts",
    "energy": 240,
    "heal": 108,
    "recipe": [
      "redCabbage",
      "radish"
    ]
  },
  {
    "name": "eggplantParmesan",
    "type": "food",
    "value": 200,
    "source": "Cooking",
    "basicDescription": "Tangy, cheesy, and wonderful",
    "longDescription": "Red Plate is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Red Plate may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from Lewis after 7 friendship hearts.",
    "energy": 175,
    "heal": 78,
    "recipe": [
      "eggplant",
      "tomato"
    ]
  },
  {
    "name": "ricePudding",
    "type": "food",
    "value": 260,
    "source": "Cooking",
    "basicDescription": "It's creamy, sweet and fun to eat.",
    "longDescription": "Rice Pudding is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Rice Pudding may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from evelyn after 7 hearts of friendship",
    "energy": 115,
    "heal": 51,
    "recipe": [
      "milk",
      "sugar",
      "rice"
    ]
  },
  {
    "name": "iceCream",
    "type": "food",
    "value": 120,
    "source": "Cooking",
    "basicDescription": "It's hard to find someone who doesn't like this",
    "longDescription": "Ice Cream is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It can also be purchased from Alex during Summer at the Ice Cream Stand for Gold.png250g, or at the Oasis on Sundays (year-round) for Gold.png240g. Ice Cream may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from Jodi after 7 hearts of friendship",
    "energy": 100,
    "heal": 45,
    "recipe": [
      "milk",
      "sugar"
    ]
  },
  {
    "name": "blueberryTart",
    "type": "food",
    "value": 150,
    "source": "Cooking",
    "basicDescription": "It's subtle and refreshing",
    "longDescription": "Blueberry Tart is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Blueberry Tart may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from Pierre after 3 hearts of friendship",
    "energy": 145,
    "heal": 56,
    "recipe": [
      "blueberry",
      "wheatFlour",
      "sugar",
      "egg"
    ]
  },
  {
    "name": "autumnsBounty",
    "type": "food",
    "value": 350,
    "source": "Cooking",
    "basicDescription": "A taste of the season",
    "longDescription": "Autumn's Bounty is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Five Autumn's Bounties are the reward for completing the Bundle Purple.png Exotic Foraging Bundle in the Crafts Room. Autumn's Bounty may randomly appear in Krobus' shop on Saturdays or in The Stardrop Saloon's rotating stock. The recipe can be obtained from Demetrius thru the mail after 7 hearts of friendship.",
    "energy": 220,
    "heal": 99,
    "recipe": [
      "yam",
      "pumpkin"
    ]
  },
  {
    "name": "pumpkinSoup",
    "type": "food",
    "value": 300,
    "source": "Cooking",
    "basicDescription": "A seasonal favorite.",
    "longDescription": "Pumpkin Soup is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Pumpkin Soup may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from Robin thru the mail after 7 hearts of friendship.",
    "energy": 200,
    "heal": 90,
    "recipe": [
      "pumpkin",
      "milk"
    ]
  },
  {
    "name": "superMeal",
    "type": "food",
    "value": 220,
    "source": "Cooking",
    "basicDescription": "It's a really energizing meal.",
    "longDescription": "Super Meal is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Super Meal may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from Kent after 7 hearts of friendship.",
    "energy": 160,
    "heal": 72,
    "recipe": [
      "bokChoy",
      "cranberries",
      "artichoke"
    ]
  },
  {
    "name": "cranberrySauce",
    "type": "food",
    "value": 120,
    "source": "Cooking",
    "basicDescription": "A festive treat",
    "longDescription": "Cranberry Sauce is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Cranberry Sauce may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from Gus after 7 friendship hearts.",
    "energy": 125,
    "heal": 56,
    "recipe": [
      "cranberries",
      "sugar"
    ]
  },
  {
    "name": "stuffing",
    "type": "food",
    "value": 165,
    "source": "Cooking",
    "basicDescription": "Ahh... the smell of warm bread and sage.",
    "longDescription": "Stuffing is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Stuffing may randomly appear in Krobus' shop on Saturdays or in the Stardrop Saloon's rotating stock. The recipe can be obtained from Pam after 7 hearts of friendship.",
    "energy": 170,
    "heal": 76,
    "recipe": [
      "bread",
      "cranberries",
      "hazelnut"
    ]
  },
  {
    "name": "farmersLunch",
    "type": "food",
    "value": 150,
    "source": "Cooking",
    "basicDescription": "This'll keep you going.",
    "longDescription": "Farmer's Lunch is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It may also randomly appear in Krobus' shop on Saturdays. The recipe can be obtained after Farming Level 3",
    "energy": 200,
    "heal": 90,
    "recipe": [
      "omelet",
      "parsnip"
    ]
  },
  {
    "name": "survivalBurger",
    "type": "food",
    "value": 180,
    "source": "Cooking",
    "basicDescription": "A convenient snack for the explorer",
    "longDescription": "The Survival Burger is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It is also cooked by Gus during the Stardew Valley Fair and can be eaten for free. Survival Burger may randomly appear in Krobus' shop on Saturdays. The recipe can be obtained after Foraging Level 2.",
    "energy": 125,
    "heal": 56,
    "recipe": [
      "bread",
      "caveCarrot",
      "eggplant"
    ]
  },
  {
    "name": "dishOTheSea",
    "type": "food",
    "value": 220,
    "source": "Cooking",
    "basicDescription": "This'll keep you warm in the cold sea air.",
    "longDescription": "Dish O' The Sea is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The reward for completing the Bundle Red.png Specialty Fish Bundle in the Fish Tank is 5 Dish O' The Sea. Dish O' The Sea may randomly appear in Krobus' shop on Saturdays. The recipe is obtained after Fishing level 3.",
    "energy": 125,
    "heal": 56,
    "recipe": [
      "sardine",
      "sardine",
      "hashbrowns"
    ]
  },
  {
    "name": "minersTreat",
    "type": "food",
    "value": 200,
    "source": "Cooking",
    "basicDescription": "This should keep your energy up",
    "longDescription": "Miner's Treat is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It can also be purchased any day from the Dwarf for Gold.png1,000g or randomly from Krobus' shop on Saturdays. Mummies in the Skull Cavern have a 4% chance of dropping a Miner's Treat. The recipe is obtained at Mining Level 3",
    "energy": 125,
    "heal": 56,
    "recipe": [
      "caveCarrot",
      "sugar",
      "milk"
    ]
  },
  {
    "name": "rootsPlatter",
    "type": "food",
    "value": 100,
    "source": "Cooking",
    "basicDescription": "This'll get you digging for more.",
    "longDescription": "Roots Platter is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. Roots Platter may randomly appear in Krobus' shop on Saturdays. The recipe is obtained after Combat Level 3.",
    "energy": 125,
    "heal": 56,
    "recipe": [
      "caveCarrot",
      "winterRoot"
    ]
  },
  {
    "name": "algaeSoup",
    "type": "food",
    "value": 100,
    "source": "Cooking",
    "basicDescription": "It's a little slimy.",
    "longDescription": "Algae Soup is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It may also be dropped by a Mutant Grub (10% chance). Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. The recipe is obtained from Clint after 3 friendship hearts.",
    "energy": 75,
    "heal": 33,
    "recipe": [
      "greenAlgae",
      "greenAlgae",
      "greenAlgae",
      "greenAlgae"
    ]
  },
  {
    "name": "paleBroth",
    "type": "food",
    "value": 150,
    "source": "Cooking",
    "basicDescription": "A delicate broth with a hint of sulfur",
    "longDescription": "Pale Broth is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. The recipe is obtained from Marnie after 3 hearts of friendship.",
    "energy": 125,
    "heal": 56,
    "recipe": [
      "whiteAlgae",
      "whiteAlgae"
    ]
  },
  {
    "name": "plumPudding",
    "type": "food",
    "value": 260,
    "source": "Cooking",
    "basicDescription": "A traditional holiday treat.",
    "longDescription": "Plum Pudding is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe is obtained from The Queen of Sauce on Year 1, Winter 7.",
    "energy": 175,
    "heal": 78,
    "recipe": [
      "wildPlum",
      "wildPlum",
      "wheatFlour",
      "sugar"
    ]
  },
  {
    "name": "artichokeDip",
    "type": "food",
    "value": 210,
    "source": "Cooking",
    "basicDescription": "It's cool and refreshing",
    "longDescription": "Artichoke Dip is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe is obtained from The Queen of Sauce in year 1 Fall 28.",
    "energy": 100,
    "heal": 45,
    "recipe": [
      "artichoke",
      "milk"
    ]
  },
  {
    "name": "stirFry",
    "type": "food",
    "value": 335,
    "source": "Cooking",
    "basicDescription": "Julienned vegetables on a bed of rice.",
    "longDescription": "Stir Fry is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients and made with homemade Oil. The recipe can be obtained from The Queen of Sauce on Year 1, Spring 7.",
    "energy": 200,
    "heal": 90,
    "recipe": [
      "caveCarrot",
      "commonMushroom",
      "kale",
      "oil"
    ]
  },
  {
    "name": "roastedHazelnuts",
    "type": "food",
    "value": 270,
    "source": "Cooking",
    "basicDescription": "The roasting process creates a rich forest flavor.",
    "longDescription": "Roasted Hazelnuts is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe is obtained from The Queen of Sauce from Year 2, Summer 28.",
    "energy": 175,
    "heal": 78,
    "recipe": [
      "hazelnut",
      "hazelnut",
      "hazelnut"
    ]
  },
  {
    "name": "pumpkinPie",
    "type": "food",
    "value": 385,
    "source": "Cooking",
    "basicDescription": "Silky pumpkin cream in a flakey crust.",
    "longDescription": "Pumpkin Pie is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It can also be received as a gift at the Feast of the Winter Star. The recipe is obtained from The Queen of Sauce from Year 1, Winter 21.",
    "energy": 225,
    "heal": 101,
    "recipe": [
      "pumpkin",
      "wheatFlour",
      "milk",
      "sugar"
    ]
  },
  {
    "name": "radishSalad",
    "type": "food",
    "value": 300,
    "source": "Cooking",
    "basicDescription": "The radishes are so crisp!",
    "longDescription": "Radish Salad is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe is obtained from The Queen of Sauce from Year 1, Spring 21.",
    "energy": 200,
    "heal": 90,
    "recipe": [
      "oil",
      "vinegar",
      "radish"
    ]
  },
  {
    "name": "fruitSalad",
    "type": "food",
    "value": 450,
    "source": "Cooking",
    "basicDescription": "A delicious combination of summer fruits.",
    "longDescription": "Fruit Salad is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients. The recipe is obtained from The Queen of Sauce from Year 2, Fall 7.",
    "energy": 263,
    "heal": 118,
    "recipe": [
      "blueberry",
      "melon",
      "apricot"
    ]
  },
  {
    "name": "blackberryCobbler",
    "type": "food",
    "value": 260,
    "source": "Cooking",
    "basicDescription": "There's quite nothing like it.",
    "longDescription": "Blackberry Cobbler is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It can also be received as a gift at the Feast of the Winter Star. Note: this recipe can be profitable - it will result in profit when using the lowest quality ingredients without Bear's Knowledge, or if using Wheat Flour and/or Sugar from the Mill. If the player has Bear's Knowledge and purchases Sugar and Wheat Flour from Pierre's General Store, using the lowest quality blackberry will result in the cost being equal to the sell price. The recipe is obtained from The Queen of Sauce from Year 2, Fall 14.",
    "energy": 175,
    "heal": 78,
    "recipe": [
      "blackberry",
      "sugar",
      "wheatFlour"
    ]
  },
  {
    "name": "cranberryCandy",
    "type": "food",
    "value": 175,
    "source": "Cooking",
    "basicDescription": "It's sweet enough to mask the bitter fruit",
    "longDescription": "Cranberry Candy is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe is obtained from The Queen of Sauce from Year 1, Winter 28.",
    "energy": 125,
    "heal": 56,
    "recipe": [
      "cranberries",
      "apple",
      "sugar"
    ]
  },
  {
    "name": "bruschetta",
    "type": "food",
    "value": 210,
    "source": "Cooking",
    "basicDescription": "Roasted tomatoes on a crisp white bread.",
    "longDescription": "Bruschetta is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe is obtained from The Queen of Sauce from Year 2, Winter 21",
    "energy": 113,
    "heal": 50,
    "recipe": [
      "bread",
      "oil",
      "tomato"
    ]
  },
  {
    "name": "coleslaw",
    "type": "food",
    "value": 345,
    "source": "Cooking",
    "basicDescription": "It's light, fresh and very healthy",
    "longDescription": "Coleslaw is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe is obtained from The Queen of Sauce from Year 1, Spring 14.",
    "energy": 213,
    "heal": 95,
    "recipe": [
      "redCabbage",
      "vinegar",
      "mayonnaise"
    ]
  },
  {
    "name": "fiddleheadRisotto",
    "type": "food",
    "value": 350,
    "source": "Cooking",
    "basicDescription": "A creamy rice dish served with sauteed fern heads. It's a little bland.",
    "longDescription": "Fiddlehead Risotto is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using the lowest quality ingredients and made with homemade Oil. The recipe is obtained from The Queen of Sauce from Year 2, Fall 28.",
    "energy": 225,
    "heal": 101,
    "recipe": [
      "oil",
      "fiddleheadFern",
      "garlic"
    ]
  },
  {
    "name": "poppyseedMuffin",
    "type": "food",
    "value": 250,
    "source": "Cooking",
    "basicDescription": "It has a soothing effect.",
    "longDescription": "The Poppyseed Muffin is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It can also be received as a gift at the Feast of the Winter Star or bought at the Traveling Cart for Gold.png750-1,250g. Note: this recipe is profitable - it will always result in profit when using the lowest quality poppies as well as wheat flour and sugar from the Mill. The recipe is obtained from The Queen of Sauce from Year 2, Winter 7.",
    "energy": 150,
    "heal": 67,
    "recipe": [
      "poppy",
      "wheatFlour",
      "sugar"
    ]
  },
  {
    "name": "chowder",
    "type": "food",
    "value": 135,
    "source": "Cooking",
    "basicDescription": "A perfect way to warm yourself after a cold night at sea.",
    "longDescription": "Chowder is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe can be obtained from Willy after 3 hearts of friendship.",
    "energy": 225,
    "heal": 101,
    "recipe": [
      "clam",
      "milk"
    ]
  },
  {
    "name": "lobsterBisque",
    "type": "food",
    "value": 205,
    "source": "Cooking",
    "basicDescription": "This delicate soup is a secret family recipe of Willy's",
    "longDescription": "Lobster Bisque is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe can be obtained from Willy after 9 hearts of friendship or through the Queen of Sauce of Year 2, Winter 14.",
    "energy": 225,
    "heal": 101,
    "recipe": [
      "lobster",
      "milk"
    ]
  },
  {
    "name": "escargot",
    "type": "food",
    "value": 125,
    "source": "Cooking",
    "basicDescription": "Butter-soaked snails cooked to perfection.",
    "longDescription": "Escargot is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe can be obtained from Willy after 5 friendship hearts.",
    "energy": 225,
    "heal": 101,
    "recipe": [
      "snail",
      "garlic"
    ]
  },
  {
    "name": "fishStew",
    "type": "food",
    "value": 175,
    "source": "Cooking",
    "basicDescription": "It smells alot like the sea. Tastes better, though.",
    "longDescription": "Fish Stew is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. This recipe can be obtained from Willy after 7 friendship hearts.",
    "energy": 225,
    "heal": 101,
    "recipe": [
      "crayfish",
      "mussel",
      "periwinkle",
      "tomato"
    ]
  },
  {
    "name": "mapleBar",
    "type": "food",
    "value": 300,
    "source": "Cooking",
    "basicDescription": "It's a sweet doughnut topped with a rich maple glaze.",
    "longDescription": "Maple Bar is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. The recipe can be obtained through the Queen of Sauce on Year 2, Summer 14.",
    "energy": 225,
    "heal": 101,
    "recipe": [
      "mapleSyrup",
      "sugar",
      "wheatFlour"
    ]
  },
  {
    "name": "crabCakes",
    "type": "food",
    "value": 275,
    "source": "Cooking",
    "basicDescription": "",
    "longDescription": "Crab Cakes are a cooked dish. They are prepared using the kitchen inside an upgraded farmhouse. Iridium Crabs in the Skull Cavern may drop Crab Cakes when slain (50% chance). Gus will also sell an unlimited number of Crab Cakes at The Stardrop Saloon for Gold.png550g each for approximately 4 days after viewing Willy's 6-heart cutscene. The recipe can be obtained through the Queen of Sauce on Year 2, Fall 21.",
    "energy": 225,
    "heal": 101,
    "recipe": [
      "crab",
      "wheatFlour",
      "egg",
      "oil"
    ]
  },
  {
    "name": "quartz",
    "type": "minerals",
    "value": 25,
    "source": "The Mines",
    "basicDescription": "A clear crystal commonly found in caves and mines",
    "longDescription": "Quartz is a Mineral that can be found by foraging in The Mines. It can also occasionally be found in Garbage Cans. Stone Golems have a 10% chance to drop Quartz when slain. Quartz can be destroyed by bombs. Quartz can be used along with 1 coal in a furnace to produce Refined Quartz, taking 1.5 in-game hours to smelt."
  },
  {
    "name": "earthCrystal",
    "type": "minerals",
    "value": 50,
    "source": "The Mines floors 1-39",
    "basicDescription": "A resinous substance found near the surface",
    "longDescription": "An Earth Crystal is a type of Mineral. It can be foraged in The Mines (especially floors 1 - 39), or obtained from Geodes and Omni Geodes, dropped from Duggies in the Mines (floors 1 - 29), or from panning. It can also be found in Fishing Treasure Chests. Wilderness Golems on the Wilderness Farm map have a 0.05% chance of dropping an Earth Crystal when slain. Earth Crystals can be destroyed by bombs."
  },
  {
    "name": "frozenTear",
    "type": "minerals",
    "value": 75,
    "source": "The Mines floors 40-79",
    "basicDescription": "A crystal fabled to be the frozen tears of a yeti",
    "longDescription": "The Frozen Tear is a Mineral. It can be foraged in the Mines (floors 40 - 79), or dropped by Dust Sprites (2% drop rate). It can also be found by panning, inside Frozen Geodes and Omni Geodes, or in Fishing Treasure Chests. It may occasionally be found in a Garbage Can after the player reaches level 40 of the mines. It can be destroyed by bombs."
  },
  {
    "name": "emerald",
    "type": "minerals",
    "value": 250,
    "source": "The Mines from an Emerald Node or Gem Node",
    "basicDescription": "A precious stone with a brilliant green color",
    "longDescription": "The Emerald is a Mineral. It can be obtained from Emerald Nodes and Gem Nodes in the Mines, from panning, or in Fishing Treasure Chests. It may occasionally be found in a Garbage Can after the player has reached level 81 of the mines. It can also be received as a gift at the Feast of the Winter Star."
  },
  {
    "name": "fireQuartz",
    "type": "minerals",
    "value": 100,
    "source": "The Mines floors 80+",
    "basicDescription": "A glowing red crystal commonly found near hot lava",
    "longDescription": "Fire Quartz is a Mineral. It can be foraged in the Mines (floors 80+) or found inside a Magma Geode or Omni Geode. It can also be found by panning or inside Fishing Treasure Chests. It may occasionally be found in a Garbage Can after the player reaches level 81 of the mines. Fire Quartz can be destroyed by bombs. Fire Quartz can be used along with 1 coal in a furnace to produce 3 Refined Quartz, taking 1.5 in-game hours to smelt."
  },
  {
    "name": "aquamarine",
    "type": "minerals",
    "value": 180,
    "source": "The Mines floors 40+",
    "basicDescription": "A shimmery blue-green gem",
    "longDescription": "Aquamarine is a Mineral. It can be obtained from Aquamarine Nodes and Gem Nodes in the Mines (floors 40+), from panning, and from Fishing Treasure Chests. It may occasionally be found in a Garbage Can after the player has reached level 41 of the mines."
  },
  {
    "name": "ruby",
    "type": "minerals",
    "value": 250,
    "source": "The Mines floors 80+",
    "basicDescription": "A precious stone that is sought after for its rich color and beautiful luster.",
    "longDescription": "The Ruby is a Mineral that can be found in Ruby Nodes and Gem Nodes in the Mines (floors 80+), by panning, in Fishing Treasure Chests, or received as a gift at the Feast of the Winter Star. It may also occasionally be found in a Garbage Can after the player has reached level 81 of the mines."
  },
  {
    "name": "amethyst",
    "type": "minerals",
    "value": 100,
    "source": "The Mines",
    "basicDescription": "A purple variant of quartz",
    "longDescription": "Amethyst is a Mineral that can be obtained from Amethyst Nodes and Gem Nodes in the Mines, panning, or as a rare drop from Green Slimes. It may also occasionally be found in Fishing Treasure Chests or in a Garbage Can."
  },
  {
    "name": "topaz",
    "type": "minerals",
    "value": 80,
    "source": "The Mines",
    "basicDescription": "Fairly common but still prized for its beauty.",
    "longDescription": "Topaz is a type of Mineral that can be obtained from Topaz Nodes and Gem Nodes in The Mines, from panning, or found in Fishing Treasure Chests. It may occasionally be found in a Garbage Can."
  },
  {
    "name": "jade",
    "type": "minerals",
    "value": 200,
    "source": "The Mines floor 40+",
    "basicDescription": "A pale green ornamental stone.",
    "longDescription": "Jade is a Mineral that can be found in Jade Nodes and Gem Nodes in the Mines (floors 40+), dropped by Blue Slimes, in Fishing Treasure Chests, or received as a gift at the Feast of the Winter Star. Jade may also occasionally be found in a Garbage Can after the player has reached level 41 of the mines."
  },
  {
    "name": "diamond",
    "type": "minerals",
    "value": 750,
    "source": "The Mines floors 50+",
    "basicDescription": "A rare and valuable gem.",
    "longDescription": "The Diamond is a Mineral that can be obtained from Diamond Nodes and Gem Nodes in the Mines on floors 50+. A diamond may also be dropped by any Monster once you have reached the bottom of the Mines. Before reaching the bottom of the Mines, a Diamond may be dropped by a Red or Purple Slime, or a Duggy. A Wilderness Golem may also rarely drop a diamond (0.1% chance). Diamonds may also be found in Fishing Treasure Chests or by panning. After the player has reached level 40 of the Mines, they may also be found in Garbage Cans. A Diamond is arguably the best gem to duplicate in the Crystalarium, providing the largest source of money as a gem."
  },
  {
    "name": "tigerseye",
    "type": "minerals",
    "value": 275,
    "source": "The Mines",
    "basicDescription": "A stripe of shimmering gold gives this gem a warm luster.",
    "longDescription": "Tigerseye is a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "opal",
    "type": "minerals",
    "value": 150,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "Its internal structure causes it to reflect a rainbow of light.",
    "longDescription": "Opal is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "fireOpal",
    "type": "minerals",
    "value": 350,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "A rare variety of opal, named for its red spots.",
    "longDescription": "Fire Opal is a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "alamite",
    "type": "minerals",
    "value": 150,
    "source": "Geode, Omni Geode",
    "basicDescription": "ts distinctive fluorescence makes it a favorite among rock collectors.",
    "longDescription": "Alamite is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "bixite",
    "type": "minerals",
    "value": 300,
    "source": "Magma Geode, Omni Geode, Black Slime",
    "basicDescription": "A dark metallic Mineral sought after for its cubic structure.",
    "longDescription": "Bixite is a mineral that can be found in the Magma Geode and the Omni Geode. It can also be dropped by Black Slimes."
  },
  {
    "name": "baryte",
    "type": "minerals",
    "value": 50,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "The best specimens resemble a desert rose.",
    "longDescription": "Baryte is a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "aerinite",
    "type": "minerals",
    "value": 125,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "These crystals are curiously light.",
    "longDescription": "Aerinite is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "calcite",
    "type": "minerals",
    "value": 75,
    "source": "Geode, Omni Geode",
    "basicDescription": "This yellow crystal is speckled with shimmering nodules.",
    "longDescription": "Calcite is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "dolomite",
    "type": "minerals",
    "value": 300,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "It can occur in coral reefs, often near an underwater volcano.",
    "longDescription": "Dolomite is a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "esperite",
    "type": "minerals",
    "value": 100,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "The crystals glow bright green when stimulated.",
    "longDescription": "Esperite is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "fluorapatite",
    "type": "minerals",
    "value": 200,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "Small amounts are found in human teeth.",
    "longDescription": "Fluorapatite is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "geminite",
    "type": "minerals",
    "value": 150,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "Occurs in brilliant clusters.",
    "longDescription": "Geminite is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "helvite",
    "type": "minerals",
    "value": 450,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "It grows in a triangular column.",
    "longDescription": "Helvite is a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "jamborite",
    "type": "minerals",
    "value": 150,
    "source": "Geode, Omni Geode",
    "basicDescription": "The crystals are so tightly packed it almost looks fuzzy.",
    "longDescription": "Jamborite is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "jagoite",
    "type": "minerals",
    "value": 115,
    "source": "Geode, Omni Geode",
    "basicDescription": "A high volume of tiny crystals makes it very glittery.",
    "longDescription": "Jagoite is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "kyanite",
    "type": "minerals",
    "value": 250,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "The geometric faces are as smooth as glass.",
    "longDescription": "Kyanite is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "lunarite",
    "type": "minerals",
    "value": 200,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "The cratered white orbs form a tight cluster.",
    "longDescription": "Lunarite is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "malachite",
    "type": "minerals",
    "value": 100,
    "source": "Geode, Omni Geode",
    "basicDescription": "A popular ornamental stone, used in sculpture and to make green paint.",
    "longDescription": "Malachite is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "neptunite",
    "type": "minerals",
    "value": 400,
    "source": "Magma Geode, Omni Geode, Black Slime",
    "basicDescription": "A jet-black crystal that is unusually reflective.",
    "longDescription": "Neptunite is a mineral that can be found in the Magma Geode and the Omni Geode. It can also be dropped by Black Slimes."
  },
  {
    "name": "lemonStone",
    "type": "minerals",
    "value": 200,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "Some claim the powdered crystal is a dwarvish delicacy.",
    "longDescription": "Lemon Stone is a mineral that can be found in the Magma Geode and the Omni Geode. Despite its description, the dwarf doesn't actually enjoy being gifted one."
  },
  {
    "name": "nekoite",
    "type": "minerals",
    "value": 80,
    "source": "Geode, Omni Geode",
    "basicDescription": "The delicate shards form a tiny pink meadow.",
    "longDescription": "Nekoite is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "orpiment",
    "type": "minerals",
    "value": 80,
    "source": "Geode, Omni Geode",
    "basicDescription": "Despite its high toxicity, this Mineral is widely used in manufacturing and folk medicine.",
    "longDescription": "Orpiment is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "petrifiedSlime",
    "type": "minerals",
    "value": 120,
    "source": "Geode, Omni Geode, Slime Ball",
    "basicDescription": "This little guy may be 100,000 years old.",
    "longDescription": "Petrified Slime is a mineral that can be found in the Geode and the Omni Geode. It may also be found inside Slime Balls produced in a Slime Hutch."
  },
  {
    "name": "thunderEgg",
    "type": "minerals",
    "value": 100,
    "source": "Geode, Omni Geode",
    "basicDescription": "According to legend, angry thunder spirits would throw these stones at one another.",
    "longDescription": "Thunder Egg is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "pyrite",
    "type": "minerals",
    "value": 120,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "Commonly known as 'Fool's Gold'.",
    "longDescription": "Pyrite is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "oceanStone",
    "type": "minerals",
    "value": 220,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "An old legend claims these stones are the mosaics of ancient mermaids.",
    "longDescription": "Ocean Stone is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "ghostCrystal",
    "type": "minerals",
    "value": 200,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "There is an aura of coldness around this crystal.",
    "longDescription": "Ghost Crystal is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "jasper",
    "type": "minerals",
    "value": 150,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "When polished, this stone becomes attactively luminous. Prized by ancient peoples for thousands of years.",
    "longDescription": "Jasper is a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "celestine",
    "type": "minerals",
    "value": 125,
    "source": "Geode, Omni Geode",
    "basicDescription": "Some early life forms had bones made from this.",
    "longDescription": "Celestine is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "marble",
    "type": "minerals",
    "value": 110,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "A very popular material for sculptures and construction.",
    "longDescription": "Marble is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "sandstone",
    "type": "minerals",
    "value": 60,
    "source": "Geode, Omni Geode",
    "basicDescription": "A common type of stone with red and brown striations.",
    "longDescription": "Sandstone is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "granite",
    "type": "minerals",
    "value": 75,
    "source": "Geode, Omni Geode",
    "basicDescription": "A speckled Mineral that is commonly used in construction.",
    "longDescription": "Granite is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "basalt",
    "type": "minerals",
    "value": 175,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "Forms near searing hot magma.",
    "longDescription": "Basalt is a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "limestone",
    "type": "minerals",
    "value": 15,
    "source": "Geode, Omni Geode",
    "basicDescription": "A very common type of stone. It's not worth very much.",
    "longDescription": "Limestone is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "soapstone",
    "type": "minerals",
    "value": 120,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "Because of its relatively soft consistency, this stone is very popular for carving.",
    "longDescription": "Soapstone is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "hematite",
    "type": "minerals",
    "value": 150,
    "source": "Frozen Geode, Omni Geode",
    "basicDescription": "An iron-based Mineral with interesting magnetic properties.",
    "longDescription": "Hematite is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "mudstone",
    "type": "minerals",
    "value": 25,
    "source": "Geode, Omni Geode",
    "basicDescription": "A fine-grained rock made from ancient clay or mud.",
    "longDescription": "Mudstone is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "obsidian",
    "type": "minerals",
    "value": 200,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "A volcanic glass that forms when lava cools rapidly.",
    "longDescription": "Obsidian is a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "slate",
    "type": "minerals",
    "value": 85,
    "source": "Geode, Omni Geode",
    "basicDescription": "t's extremely resistant to water, making it a good roofing material.",
    "longDescription": "Slate is a mineral that can be found in the Geode and the Omni Geode."
  },
  {
    "name": "fairyStone",
    "type": "minerals",
    "value": 250,
    "source": "Frozen Stone, Omni Geode",
    "basicDescription": "An old miner's song suggests these are made from the bones of ancient fairies.",
    "longDescription": "Fairy Stone is a mineral that can be found in the Frozen Geode and the Omni Geode."
  },
  {
    "name": "starShards",
    "type": "minerals",
    "value": 500,
    "source": "Magma Geode, Omni Geode",
    "basicDescription": "No one knows how these form. Some scientists claim that the microscopic structure displays unnatural regularity.",
    "longDescription": "Star Shards are a mineral that can be found in the Magma Geode and the Omni Geode."
  },
  {
    "name": "geode",
    "type": "minerals",
    "value": 50,
    "source": "The Mines floors 1-39",
    "basicDescription": "A blacksmith can break this open for you.",
    "longDescription": "The Geode is a Mineral deposit that contains minerals, artifacts, ores, or basic resources. It can be obtained from breaking rocks above ground in Stardew Valley and in The Mines (especially floors 1 - 39), or dropped by Duggies. It may also be found in Fishing Treasure Chests or received as a gift at the Feast of the Winter Star. The geode can be broken open by Clint in the Blacksmith shop for Gold.png25g."
  },
  {
    "name": "frozenGeode",
    "type": "minerals",
    "value": 100,
    "source": "The Mines floors 41-79",
    "basicDescription": "A blacksmith can break this open for you.",
    "longDescription": "The Frozen Geode is a Mineral deposit that contains minerals, artifacts, ores, or basic resources. It can be found on levels 41 to 79 of The Mines, on the farm in the Winter, or inside a Fishing Treasure Chest. It can also be received as a gift at the Feast of the Winter Star. The Frozen Geode can be broken open by Clint in the Blacksmith shop for Gold.png25g."
  },
  {
    "name": "magmaGeode",
    "type": "minerals",
    "value": 150,
    "source": "The Mines floors 81-119",
    "basicDescription": " blacksmith can break this open for you.",
    "longDescription": "The Magma Geode is a Mineral deposit that contains minerals, artifacts, ores, or basic resources. It can be found on levels 81 to 119 of The Mines or in Fishing Treasure Chests. It can also be received as a gift at the Feast of the Winter Star. It may be additionally be found by breaking boxes and barrels in the Skull Cavern. The Magma Geode can be broken open by Clint in the Blacksmith shop for Gold.png25g."
  },
  {
    "name": "omniGeode",
    "type": "minerals",
    "value": 0,
    "source": "The Mines from rocks",
    "basicDescription": "A blacksmith can break this open for you. These geodes contain a wide variety of Minerals.",
    "longDescription": "The Omni Geode is a Mineral deposit found primarily by breaking rocks in The Mines. It must be broken open at the Blacksmith for Gold.png25g to obtain the items inside. Omni Geodes can contain minerals, artifacts, ores, or basic resources. Omni Geodes can be found while panning, on all levels of The Mines, and on all levels of the Skull Cavern. Carbon Ghosts have a 99% chance to drop one Omni Geode when slain. Omni Geodes can also be purchased from the Oasis on Wednesdays for Gold.png1,000g, and from Krobus on Tuesdays for Gold.png300g. Five Omni Geodes are the reward for completing the Bundle Purple.png Geologist's Bundle in the Boiler Room. Neither daily luck nor luck buffs affect the contents of an Omni Geode."
  }
]

