[
  {
    "name": "ruby",
    "type": "minerals",
    "value": 100,
    "source": "Cave",
    "basicDescription": "A valuable and red stone",
    "longDescription": ""
  },
  {
    "name": "axe",
    "type": "tools",
    "value": 50,
    "source": "Obtained from the start of the game.",
    "basicDescription": "A handy tool to chop down trees",
    "longDescription": ""
  },
  {
    "name": "sapphire",
    "type": "minerals",
    "value": 150,
    "source": "Cave",
    "basicDescription": "A valuable and blue stone",
    "longDescription": ""
  },
  {
    "name": "omelette",
    "type": "food",
    "value": 250,
    "source": "Cooking",
    "basicDescription": "Eggs that have been cooked together with other various ingredients. ",
    "longDescription": "",
    "recipe": [
        "egg",
        "milk"
    ],
    "heal": 50,
    "stamina": 25
  },
  {
    "name": "emerald",
    "type": "minerals",
    "value": 1000,
    "source": "Mines",
    "basicDescription": "Beautiful green rock ",
    "longDescription": ""
  },
  {
    "name": "aquamarine",
    "type": "minerals",
    "value": 1200,
    "source": "Mines",
    "basicDescription": "Beautiful light blue rock ",
    "longDescription": ""
  },
  {
    "name": "daffodil",
    "type": "crops",
    "value": 25,
    "source": "Fields",
    "basicDescription": "Pretty flower",
    "longDescription": ""
  },
  {
    "name": "poppy",
    "type": "crops",
    "value": 30,
    "source": "Fields",
    "basicDescription": "Nice flower ",
    "longDescription": ""
  },
  {
    "name": "egg",
    "type": "food",
    "value": 75,
    "source": "Chicken",
    "basicDescription": "Nutritious snack",
    "longDescription": "",
    "heal": 40,
    "stamina": 10
  },
  {
    "name": "milk",
    "type": "food",
    "value": 95,
    "source": "Cow",
    "basicDescription": "Healthy Beverage",
    "longDescription": "",
    "heal": 70,
    "stamina": 30
  },
  {
    "name": "barn",
    "type": "building",
    "value": 500,
    "source": "Carpenter's Shop",
    "basicDescription": "Normal sized barn for animals",
    "longDescription": "",
    "recipe": [
        "egg",
        "milk"
    ]
  },
  {
    "name": "bigBarn",
    "type": "building",
    "value": 1000,
    "source": "Carpenter's Shop",
    "basicDescription": "Huge barn for animals",
    "longDescription": "",
    "recipe": [
        "barn"
    ]
  },
  {
    "name": "bigBarn",
    "type": "building",
    "value": 1000,
    "source": "Carpenter's Shop",
    "basicDescription": "Huge barn for animals",
    "longDescription": "",
    "recipe": [
        "barn"
    ]
  },
  {
    "name": "grassStarter",
    "type": "crops",
    "value": 50,
    "source": "General Store, Joja Mart",
    "basicDescription": "Place this on your farm to start a new patch of grass.",
    "longDescription": "Instantly places a patch of Grass when used on the ground.  Over time, it'll grow and spread to surrounding tiles.  Grass can be harvested with the Sycthe to produce Hay once a Silo is built.  On Winter 1st, all grass on the farm will die.",
    "seasonToGrow": [
        "spring",
        "summer",
        "fall"
    ]
  },
  {
    "name": "sugar",
    "type": "food",
    "value": 50,
    "source": "Mill, General Store, Joja Mart",
    "basicDescription": "Adds sweetness to pastries and candies.  Too much can be unhealthy.",
    "longDescription": "A cooking ingredient used in many recipes. Using a Mill, three Sugars can be crafted from one Beet.  Beets placed inside will appear as Sugar beside the Mill the next morning.  Sugar made this way is profitable when using regular or silver quality Beets at 150g for three Sugars.  However it is better to create Beet Pickles using the preserves jar to sell at 250g.",
    "heal": 11,
    "stamina": 25
  },
  {
    "name": "wheatFlour",
    "type": "food",
    "value": 50,
    "source": "Mill, General Store, Joja Mart",
    "basicDescription": "A common cooking ingredient made from crushed wheat seeds.",
    "longDescription": "A cooking ingredient that can be consumed by itself.  One Wheat Flour can be crafted from one Wheat using a Mill.  Wheat placed inside the Mill will appear in the box beside the Mill the next morning.  Doing this is profitable at 50g per item.  It can then be cooked into Bread for another 10g profit, but using the Wheat to create Beer is more profitable at 200g per item.",
    "heal": 5,
    "stamina": 13
  },
  {
    "name": "rice",
    "type": "food",
    "value": 100,
    "source": "General Store, Joja Mart",
    "basicDescription": "A basic grain often served under vegetables.",
    "longDescription": "A cooking ingredient that can be used in a variety of recipes.  I like to eat it everyday.",
    "heal": 5,
    "stamina": 13
  },
  {
    "name": "oil",
    "type": "food",
    "value": 100,
    "source": "General Store, Joja Mart",
    "basicDescription": "All purpose cooking oil.",
    "longDescription": "An Artison Good and common cooking ingredient made from the Oil Maker.  There is no quality rating so its sell price doesn't benefit from quality increeases.  Also it's sell price doesn't benefit from the Artisan Profession.  Oil made from base quality Sunflowers, cultivated sunflower seeds and all qualities of corn is profitable, though corn is more profitable in the Keg or Preserves Jar.  The processing times vary by ingredient.  1 Corn takes 16.66 hours, 1 Sunflower Seeds takes 53.33 hours and 1 Sunflower takes 1 hour.  ",
    "heal": 5,
    "stamina": 13
  },
  {
    "name": "vinegar",
    "type": "food",
    "value": 100,
    "source": "General Store",
    "basicDescription": "An Aged fermented liquid used in many cooking recipes.",
    "longDescription": "Used as a cooking ingredient that can be used in a variety of recipes. ",
    "heal": 5,
    "stamina": 13
  },
  {
    "name": "basicFertilizer",
    "type": "crafting",
    "value": 2,
    "source": "General Store, Crafting",
    "basicDescription": "Improves soil quality a little, increasing your chance to grow quality crops. Mix into tilled soil.",
    "longDescription": "A Fertilizer that helps by improving soil quality. It can be crafted with a recipe gained through Farming Level 1. It must be placed on tilled soil before planting a seed.  It affects only the basic harvest (Potatoes, Blueberries, Cranberries, etc.), meaning that extra crops gained at a single harvest will be regular quality.",
    "recipe": [
      "sap",
      "sap"
    ]
  },
  {
    "name": "qualityFertilizer",
    "type": "crafting",
    "value": 10,
    "source": "General Store after year 2, Crafting",
    "basicDescription": "Improves soil quality, increasing your chance to grow quality crops. Mix into tilled soil.",
    "longDescription": "A Fertilizer that improves the chance to grow a Quality Crop. It can be crafted with a recipe gained through Farming Level 9. It may occasionally be sold by the Travelling Card for 100-1000g. It must be placed on tilled soil before planting a seed.  It affects only the basic harvest (Potatoes, Blueberries, Cranberries, etc.), meaning that extra crops gained at a single harvest will be regular quality.",
    "recipe": [
      "sap",
      "sap",
      "anyFish"
    ]
  },
  {
    "name": "basicRetainingSoil",
    "type": "crafting",
    "value": 4,
    "source": "General Store, Crafting",
    "basicDescription": "This soil has a chance of staying watered overnight. Mix into tilled soil.",
    "longDescription": "A fertilizer that helps by keeping soil watered.  Can be placed on tilled soil before or after planting a seed, or at any stage of crop growth.  The chance for retaining water is about 33%.  The recipe can be obtained at Farming Level 4.",
    "recipe": [
      "stone",
      "stone"
    ]
  },
  {
    "name": "qualityRetainingSoil",
    "type": "crafting",
    "value": 5,
    "source": "General Store, Crafting, Oasis",
    "basicDescription": "This soil has a good chance of staying watered overnight. Mix into tilled soil.",
    "longDescription": "A fertilizer that helps by keeping soil watered.  Can be placed on tilled soil before or after planting a seed, or at any stage of crop growth.  The chance for retaining water is about 66%.  The recipe can be obtained at Farming Level 7 and produces 2 items per craft.",
    "recipe": [
      "stone",
      "stone",
      "clay"
    ]
  },
  {
    "name": "speedGro",
    "type": "crafting",
    "value": 20,
    "source": "General Store, Crafting, Oasis",
    "basicDescription": "Stimulates leaf production. Guaranteed to increase growth rate by at least 10%. Mix into tilled soil.",
    "longDescription": "A Fertilizer that helps by speeding crop growth.  Can be placed on tilled soil before or after planting a seed, or at any stage of crop growth (but as of v1.2, there's a bug that prevents any effect unless applied before planting a seed). The recipe can be obtained at Farming Level 3 and produces 5 items per craft. Crafting is always cheaper than purchasing it regardless of the Clam quality.",
    "recipe": [
      "pineTar",
      "clam"
    ]
  },
  {
    "name": "deluxeSpeedGro",
    "type": "crafting",
    "value": 40,
    "source": "General Store, Crafting, Oasis",
    "basicDescription": "Stimulates leaf production. Guaranteed to increase growth rate by at least 25%. Mix into tilled soil.",
    "longDescription": "A Fertilizer that helps by speeding crop growth.  Can be placed on tilled soil before or after planting a seed, or at any stage of crop growth (but as of v1.2, there's a bug that prevents any effect unless applied before planting a seed).  The chance for retaining water is about 66%.  The recipe can be obtained at Farming Level 8 and produces 5 items per craft. Crafting is always cheaper than purchasing it regardless of the Clam quality.  It is sold at the Pierre's General Store in year 2 onwards.",
    "recipe": [
      "oakResin",
      "coral"
    ]
  },
  {
    "name": "wallpaper",
    "type": "furniture",
    "value": 0,
    "source": "General Store, JojaMart",
    "basicDescription": "Decorates the walls of one room.",
    "longDescription": "A new wallpaper is available at the store each day.  The wallpaper sold at JojaMart will be sold the next day at Pierre's.  It can also be bought from a Catalogue. Wallpaper is a one time use and does not stack.  They cover the whole room they're placed in and can be also placed on hallway walls between rooms."
  },
  {
    "name": "flooring",
    "type": "furniture",
    "value": 0,
    "source": "General Store, JojaMart",
    "basicDescription": "Decorates the floor of one room.",
    "longDescription": "A new flooring is available at the store each day.  The flooring sold at JojaMart will be sold the next day at Pierre's.  It can also be bought from a Catalogue. Wallpaper is a one time use and does not stack.  They cover the whole room they're placed in and can be also placed on hallway walls between rooms."
  },
  {
    "name": "cherrySapling",
    "type": "crops",
    "value": 850,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Cherry Tree. Bears fruit in the spring. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into a Cherry Tree, after which will produce one fruit each day during the Spring.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 3400g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["winter"]
  },
  {
    "name": "apricotSapling",
    "type": "crops",
    "value": 500,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Apricot Tree. Bears fruit in the spring. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Apricot Tree, after which will produce one fruit each day during the Spring.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 2000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["winter"]
  },
  {
    "name": "orangeSapling",
    "type": "crops",
    "value": 1000,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Orange Tree. Bears fruit in the summer. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Orange Tree, after which will produce one fruit each day during the Summer.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 4000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "peachSapling",
    "type": "crops",
    "value": 1500,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Peach Tree. Bears fruit in the summer. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Peach Tree, after which will produce one fruit each day during the Summer.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 6000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "pomegranateSapling",
    "type": "crops",
    "value": 1500,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Pomegranate Tree. Bears fruit in the summer. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Pomegranate Tree, after which will produce one fruit each day during the Fall.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 6000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "appleSapling",
    "type": "crops",
    "value": 1000,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Takes 28 days to produce a mature Apple Tree. Bears fruit in the summer. Only grows if the 8 surrounding 'tiles' are empty.",
    "longDescription": "A Fruit Tree that takes 28 days to grow into an Apple Tree, after which will produce one fruit each day during the Fall.  Like all Fruit Trees, it will produce fruit all year round if planted in the Greenhouse. It is a good deal to buy it at the Traveling Cart if it is 4000g or less (which is the price at the General Store).",
    "growthTimeDays": 28,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "catalogue",
    "type": "furniture",
    "value": 0,
    "source": "General Store",
    "basicDescription": "Provides unlimited access to all wallpapers and floors... from the convenience of your home!",
    "longDescription": "A piece of Furniture that once placed, allows the player to purchase every Wallpaper and Flooring item for 0g in unlimited quantity.  This item is similar to the Furniture Catalogue sold at the Carpenter's Shop which gives access to Furniture items."
  },
  {
    "name": "bouquet",
    "type": "all",
    "value": 100,
    "source": "General Store",
    "basicDescription": "A gift that shows your romantic interest.",
    "longDescription": "A special gift that you can give to any or all marriage candidates whom you've gained an 8-heart friendship with. Giving this to a marriage candidate results in their status changing to boyfriend or girlfriend on the Social tab of the pause menu.  Giving this unfreezes the friendship level with each recipient allowing it to increase to 10 hearsts, and to decay (meaning friendship will go down if they are not talked to each day). "
  },
  {
    "name": "largePack",
    "type": "tools",
    "value": 0,
    "source": "General Store",
    "basicDescription": "Unlocks the 2nd row of inventory (12 more slots, total 24).",
    "longDescription": "Available at the start of the game, this will unlock 12 more slots upon purchase."
  },
  {
    "name": "deluxePack",
    "type": "tools",
    "value": 0,
    "source": "General Store",
    "basicDescription": "Unlocks the 3rd row of inventory (12 more slots, total 36).",
    "longDescription": "Available after purchasing the Large Pack, this will unlock 12 more slots upon purchase."
  },
  {
    "name": "parsnipSeeds",
    "type": "crops",
    "value": 10,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 4 days to mature.",
    "longDescription": "A type of seed which grows and produces Parsnips when mature. These can be obtained via the Seed Maker as well as having a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 20g.",
    "growthTimeDays": 4,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "beanStarter",
    "type": "crops",
    "value": 30,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 10 days to mature, but keeps producing after that. Yields multiple beans per harvest. Grows on a trellis.",
    "longDescription": "A type of seed which grows and produces Green Beans when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 60g.",
    "growthTimeDays": 10,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "cauliflowerSeeds",
    "type": "crops",
    "value": 40,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 12 days to produce a large cauliflower.",
    "longDescription": "A type of seed which grows and produces Cauliflower when mature. These can be obtained via the Seed Maker as well as having a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 80g. Nine seeds can be obtained from Gunther at the Museum after donating 5 items.",
    "growthTimeDays": 12,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "potatoSeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 6 days to mature, and has a chance of yielding multiple potatoes at harvest.",
    "longDescription": "A type of seed which grows and produces Potatoes when mature. These can be obtained via the Seed Maker as well as having a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 50g.  Potato seeds have a random chance to produce extra potatoes partially based upon Daily Luck.",
    "growthTimeDays": 6,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "tulipBulb",
    "type": "crops",
    "value": 10,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in spring. Takes 6 days to produce a colorful flower. Assorted colors.",
    "longDescription": "A type of seed which grows and produces Tulips when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 20g.",
    "growthTimeDays": 6,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "kaleSeeds",
    "type": "crops",
    "value": 35,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 6 days to mature. Harvest with the scythe.",
    "longDescription": "A type of seed which grows and produces Kale when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 70g.",
    "growthTimeDays": 6,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "jazzSeeds",
    "type": "crops",
    "value": 15,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in spring. Takes 7 days to produce a blue puffball flower.",
    "longDescription": "A type of seed which grows and produces Blue Jazz flowers when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 30g.",
    "growthTimeDays": 7,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "garlicSeeds",
    "type": "crops",
    "value": 20,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the spring. Takes 4 days to mature.",
    "longDescription": "A type of seed which grows and produces Garlic when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 40g.  These are only available in the General Store starting from year 2.",
    "growthTimeDays": 4,
    "seasonToGrow": ["spring"]
  },
  {
    "name": "melonSeeds",
    "type": "crops",
    "value": 40,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 12 days to mature.",
    "longDescription": "A type of seed which grows and produces Melons when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 80g.  Nine seeds can be obtained from Gunther at the Museum after donating 10 items.",
    "growthTimeDays": 12,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "tomatoSeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 11 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Tomatoes when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 50g.  When harvested, each tomato plant gives 1 Tomato every 4 days, with a small random chance for more tomatoes.",
    "growthTimeDays": 11,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "blueberrySeeds",
    "type": "crops",
    "value": 40,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 13 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Blueberries when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 80g.  When harvested, each blueberry plant gives 3 Blueberries every 4 days with a small chance formore Blueberries.",
    "growthTimeDays": 13,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "pepperSeeds",
    "type": "crops",
    "value": 20,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 5 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Hot Peppers when mature. These can be obtained via the Seed Maker as well as a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 40g.  When harvested each Hot Pepper plant gives 1 Hot Pepper every 3 days with a small chance for more Hot Peppers. ",
    "growthTimeDays": 5,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "wheatSeeds",
    "type": "crops",
    "value": 5,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer or fall. Takes 4 days to mature. Harvest with the scythe.",
    "longDescription": "A type of seed which grows and produces Wheat when mature. These can be obtained via the Seed Maker as well as a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 10g.",
    "growthTimeDays": 4,
    "seasonToGrow": ["summer", "fall"]
  },
  {
    "name": "radishSeeds",
    "type": "crops",
    "value": 20,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 6 days to mature.",
    "longDescription": "A type of seed which grows and produces Radishes when mature. These can be obtained via the Seed Maker as well as a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 40g.",
    "growthTimeDays": 6,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "poppySeeds",
    "type": "crops",
    "value": 50,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in summer. Produces a bright red flower in 7 days.",
    "longDescription": "A type of seed which grows and produces Poppy flowers when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 100g.",
    "growthTimeDays": 7,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "spangleSeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in summer. Takes 8 days to produce a vibrant tropical flower. Assorted colors.",
    "longDescription": "A type of seed which grows and produces Summer Spangle flowers when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 50g.",
    "growthTimeDays": 8,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "hopsStarter",
    "type": "crops",
    "value": 30,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 11 days to grow, but keeps producing after that. Grows on a trellis.",
    "longDescription": "A type of seed which grows and produces Hops when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 60g.",
    "growthTimeDays": 11,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "cornSeeds",
    "type": "crops",
    "value": 75,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant these in the summer or fall. Takes 14 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Corn when mature. These can be obtained via the Seed Maker as well as a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 150g. Corn plants continue to produces every 4 days.",
    "growthTimeDays": 14,
    "seasonToGrow": [
        "summer",
        "fall"
      ]
  },
  {
    "name": "sunflowerSeeds",
    "type": "crops",
    "value": 20,
    "source": "General Store, JojaMart, Traveling Cart",
    "basicDescription": "Plant in summer or fall. Takes 8 days to produce a large sunflower. Yields more seeds at harvest.",
    "longDescription": "A type of seed which grows and produces Sunflowers and 0-3 Sunflower Seeds when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the JoJaMart for 125g or potentially 100g at the Travelling Cart. It's sell price is 100g if it was purchased instead of harvested.  It can be used to create oil via an Oil Maker.",
    "growthTimeDays": 8,
    "seasonToGrow": ["summer", "fall"]
  },
  {
    "name": "redCabbageSeeds",
    "type": "crops",
    "value": 50,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the summer. Takes 9 days to mature.",
    "longDescription": "A type of seed which grows and produces Red Cabbage when mature. These can be obtained via the Seed Maker. This is only available at the General Store and Night Market starting year 2. It is cheapest to buy at the General Store or Night Market for 100g.",
    "growthTimeDays": 9,
    "seasonToGrow": ["summer"]
  },
  {
    "name": "eggplantSeeds",
    "type": "crops",
    "value": 10,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 5 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Eggplants when mature. These can be obtained via the Seed Maker and has a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 20g. When harvested, each Eggplant bush gives 1 Eggplant for every 5 days, with a very small random chance for more Eggplants",
    "growthTimeDays": 5,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "cornSeeds",
    "type": "crops",
    "value": 75,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the summer or fall. Takes 14 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Corn when mature. These can be obtained via the Seed Maker and has a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 150g. When harvested, each Corn plant gives 1 Corn for every 4 days.",
    "growthTimeDays": 14,
    "seasonToGrow": ["fall", "summer"]
  },
  {
    "name": "pumpkinSeeds",
    "type": "crops",
    "value": 50,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 13 days to mature.",
    "longDescription": "A type of seed which grows and produces Pumpkins when mature. These can be obtained via the Seed Maker and has a chance of being planted when using Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 150g.",
    "growthTimeDays": 13,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "bokChoySeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 4 days to mature.",
    "longDescription": "A type of seed which grows and produces Bok Choy when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 50g.",
    "growthTimeDays": 4,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "yamSeeds",
    "type": "crops",
    "value": 30,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 10 days to mature.",
    "longDescription": "A type of seed which grows and produces Bok Choy when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 60g.",
    "growthTimeDays": 10,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "bokChoySeeds",
    "type": "crops",
    "value": 25,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 4 days to mature.",
    "longDescription": "A type of seed which grows and produces Bok Choy when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 50g.",
    "growthTimeDays": 4,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "cranberrySeeds",
    "type": "crops",
    "value": 60,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 7 days to mature, and continues to produce after first harvest.",
    "longDescription": "A type of seed which grows and produces Cranberries when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 240 or possibly 180g at the Travelling Cart.  When harvested each plant gives 2 Cranberries every 5 days with a small chance for more Cranberries.",
    "growthTimeDays": 7,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "fairySeeds",
    "type": "crops",
    "value": 100,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant in fall. Takes 12 days to produce a mysterious flower. Assorted Colors.",
    "longDescription": "A type of seed which grows and produces Fairy Rose flowers when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 200g.",
    "growthTimeDays": 12,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "amaranthSeeds",
    "type": "crops",
    "value": 35,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 7 days to grow. Harvest with the scythe.",
    "longDescription": "A type of seed which grows and produces Amaranth when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 70g.",
    "growthTimeDays": 7,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "grapeStarter",
    "type": "crops",
    "value": 30,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 10 days to grow, but keeps producing after that. Grows on a trellis.",
    "longDescription": "A type of seed which grows and produces Grapes when mature. These can be obtained via the Seed Maker. It is cheapest to buy at the General Store or Night Market for 60g. Continues to produces grapes every 3 days",
    "growthTimeDays": 10,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "artichokeSeeds",
    "type": "crops",
    "value": 15,
    "source": "General Store, Traveling Cart",
    "basicDescription": "Plant these in the fall. Takes 8 days to mature.",
    "longDescription": "A type of seed which grows and produces Grapes when mature. These can be obtained via the Seed Maker or potentially from Mixed Seeds. It is cheapest to buy at the General Store or Night Market for 30g.  It is only available to buy at the General Store or Night Market starting year 2 but can be bought at the Travelling Cart from the start for 100g-1000g.",
    "growthTimeDays": 8,
    "seasonToGrow": ["fall"]
  },
  {
    "name": "energyTonic",
    "type": "food",
    "value": 500,
    "source": "Clinic",
    "basicDescription": "Restores a lot of energy.",
    "longDescription": "Restores a lot of energy.  Use it after a long day of work.",
    "heal": 200,
    "stamina": 500
  },
  {
    "name": "muscleRemedy",
    "type": "food",
    "value": 500,
    "source": "Clinic",
    "basicDescription": "When you've pushed your body too hard, drink this to remove 'Exhaustion'",
    "longDescription": "Use this when you're tired.  Helpful after a long day of work.",
    "heal": 22,
    "stamina": 50
  },
  {
    "name": "copperOre",
    "type": "minerals",
    "value": 5,
    "source": "Blacksmith, The Mines, Fishing, Artifact Spot, Geodes, Panning, Traveling Cart",
    "basicDescription": "A common ore that can be smelted into bars",
    "longDescription": "The Mines (Levels 31-39) have a high concentration of copper nodes. The surrounding regular rocks also have a high probability of dropping a single copper ore. Copper Ore is obtained from copper nodes with a pickaxe. Mining a copper node will yield between 1 and 3 copper ore. The Miner Profession can further increase this.  Copper ore can be smelted in a Furnace to create a Copper Bar. The smelting requires 5 copper ore and 1 coal to begin and takes 30 in-game minutes to complete. Can be bought at the Blacksmith for 75g each in year 1 and 150g each in year 2+."
  },
  {
    "name": "ironOre",
    "type": "minerals",
    "value": 10,
    "source": "Blacksmith, The Mines, Fishing, Artifact Spot, Geodes, Panning, Traveling Cart",
    "basicDescription": "A fairly common ore that can be smelted into bars.",
    "longDescription": "The Mines (Levels 41 - 79) have a high concentration of Iron Nodes with potential abundance at Levels 70 - 79. Iron Ore is obtained from Iron nodes with a pickaxe. Mining an Iron Node will yield between 1 and 3 Iron Ore. The Miner Profession can further increase this.  Iron ore can be smelted in a Furnace to create an Iron Bar. The smelting requires 5 iron ore and 1 coal to begin and takes 2 hours to complete. Can be bought at the Blacksmith for 150g each in year 1 and 250g each in year 2+."
  },
  {
    "name": "coal",
    "type": "minerals",
    "value": 15,
    "source": "Charcoal Kiln, Recycling Marchine, Blacksmith, The Mines, Fishing, Geodes, Panning, Traveling Cart",
    "basicDescription": "A combustible rock that is useful for crafting and smelting.",
    "longDescription": "Coal is a basic resource. It can be obtained in many different ways, primarily from rocks or Dust Sprites in The Mines, purchased from Clint at the Blacksmith shop, or using a Charcoal Kiln. It may also be produced by recycling trash or found in Fishing Treasure Chests. A random amount of coal may be found in addition to metal ores by Panning. Coal is used in some crafting recipes and is necessary for smelting ore or Quartz in a furnace. A Charcoal Kiln can be used to convert 10 wood into 1 coal. Coal purchased at the Blacksmith costs 150g during year 1, so it is cheaper in year 1 to buy 10 wood for 100g from Robin at the Carpenter's Shop and convert that wood into coal in the Charcoal Kiln. After year 1, wood pricing increases to 50g per piece but coal increases to only 250g, so it is cheaper to purchase coal directly."
  },
  {
    "name": "goldOre",
    "type": "minerals",
    "value": 25,
    "source": "Blacksmith, The Mines, Fishing, Frozen Geode, Magma Geode, Omni Geode, Panning, Traveling Cart",
    "basicDescription": "A fairly common ore that can be smelted into bars.",
    "longDescription": "Gold Ore is a resource that can be placed in a furnace, along with coal, to create a Gold Bar. Each bar requires 5 gold ore and one coal to create, taking about five in-game hours. Gold ore can be mined from gold nodes in the Mines at levels 80+, in the Skull Cavern rarely at levels 60+ and more commonly at levels 80+, and has a chance to spawn in the Quarry. Gold ore can also be found by breaking boxes and barrels in the mines. Other random sources of gold ore are fishing treasure chests and beachfront Artifact Spots. Gold ore may also be found inside Frozen Geodes, Magma Geodes, or Omni Geodes, or from Panning. The Traveling Cart may occasionally sell it for 100-1,000g. Gold ore can be sold for 25g each. It can be purchased for 400g each from the Blacksmith in year 1, totaling 2,000g per bar. In year 2+, it can be purchased from the Blacksmith for 750g each, totaling 3,750g per bar."
  },
  {
    "name": "copperHoe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Hoe",
    "basicDescription": " It is used primarily to till soil for Farming, and to dig up Artifact Spots.",
    "longDescription": "Upgrading to a Copper Hoe will increase the maximum area of effect to 3 tiles, in a line in front of you via holding down the action button."
  },
  {
    "name": "steelHoe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Copper Hoe",
    "basicDescription": " It is used primarily to till soil for Farming, and to dig up Artifact Spots.",
    "longDescription": "Upgrading to a Steel Hoe will increase the maximum area of effect to 5 tiles, in a line in front of you via holding down the action button."
  },
  {
    "name": "goldHoe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Steel Hoe",
    "basicDescription": " It is used primarily to till soil for Farming, and to dig up Artifact Spots.",
    "longDescription": "Upgrading to a Gold Hoe will increase the maximum area of effect to 3x3 tiles, in a line in front of you via holding down the action button."
  },
  {
    "name": "iridiumHoe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Gold Hoe",
    "basicDescription": " It is used primarily to till soil for Farming, and to dig up Artifact Spots.",
    "longDescription": "Upgrading to an Iridium Hoe will increase the maximum area of effect to 6x3 tiles, in a line in front of you via holding down the action button."
  },
  {
    "name": "copperPickaxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Pickaxe",
    "basicDescription": "It is used mainly for breaking stones and picking up placed equipment or furniture.",
    "longDescription": "Upgrading to a Copper Pickaxe will allow you to break large rocks in the mine. These give 10 stone. It reduces the hits needed for other rocks."
  },
  {
    "name": "steelPickaxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Copper Pickaxe",
    "basicDescription": "It is used mainly for breaking stones and picking up placed equipment or furniture.",
    "longDescription": "Upgrading to a Steel Pickaxe will allow you to break boulders on The Farm. Can mine the barrier inside the mine that blocks the player from talking with Dwarf. It further reduces the hits needed for other rocks."
  },
  {
    "name": "goldPickaxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Steel Pickaxe",
    "basicDescription": "It is used mainly for breaking stones and picking up placed equipment or furniture.",
    "longDescription": "Upgrading to a Gold Pickaxe allows you to break any meteorites that land on your farm. It further reduces the hits needed for other rocks."
  },
  {
    "name": "iridiumPickaxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Gold Pickaxe",
    "basicDescription": "It is used mainly for breaking stones and picking up placed equipment or furniture.",
    "longDescription": "Upgrading to an Iridium Pickaxe further reduces the hits needed for other rocks."
  },
  {
    "name": "copperAxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Axe",
    "basicDescription": "The Axe is a tool used to chop branches, trees and small stumps, as well as for removing or harvesting certain objects, especially important for obtaining Wood.",
    "longDescription": "Upgrading to a Copper Axe will allow you to chop Large Stumps. 8 hits to chop a fully-grown tree, and 4 hits for a small stump.  "
  },
  {
    "name": "steelAxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Copper Axe",
    "basicDescription": "The Axe is a tool used to chop branches, trees and small stumps, as well as for removing or harvesting certain objects, especially important for obtaining Wood.",
    "longDescription": "Upgrading to a Steel Axe will allow you to chop Large Logs. 6 hits to chop a fully-grown tree, and 3 hits for a small stump. The Steel Axe is required to remove the Large Log that blocks the entrance to the Secret Woods. "
  },
  {
    "name": "goldAxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Steel Axe",
    "basicDescription": "The Axe is a tool used to chop branches, trees and small stumps, as well as for removing or harvesting certain objects, especially important for obtaining Wood.",
    "longDescription": "Upgrading to a Gold Axe allows you to only need 4 hits to chop a fully-grown tree, and 2 hits for a small stump. 2 hits for a stage 4 tree, and one hit for a stage 3 tree and below."
  },
  {
    "name": "iridiumAxe",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Golden Axe",
    "basicDescription": "The Axe is a tool used to chop branches, trees and small stumps, as well as for removing or harvesting certain objects, especially important for obtaining Wood.",
    "longDescription": "Upgrading to an Iridium Axe allows you to only need 2 hits to chop a fully-grown tree, and 1 hit for a small stump. 1 hit for a stage 4 tree and below."
  },
  {
    "name": "copperWateringCan",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Watering Can",
    "basicDescription": "The Watering Can is a tool obtained at the beginning of the game that is used to water Crops.",
    "longDescription": "Upgrading to a Copper Watering Can will have the capacity increased to 55 charges. Also increases maximum area of effect to 3 tiles in a straight line."
  },
  {
    "name": "steelWateringCan",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Copper Watering Can",
    "basicDescription": "The Watering Can is a tool obtained at the beginning of the game that is used to water Crops.",
    "longDescription": "Upgrading to a Steel Watering Can will have the capacity increased to 70 charges. Also increases maximum area of effect to 5 tiles in a straight line."
  },
  {
    "name": "goldWateringCan",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Steel Watering Can",
    "basicDescription": "The Watering Can is a tool obtained at the beginning of the game that is used to water Crops.",
    "longDescription": "Upgrading to a Gold Watering Can will have the capacity increased to 85 charges. Also increases maximum area of effect to a 3x3 area (9 corresponding tiles)."
  },
  {
    "name": "iridiumWateringCan",
    "type": "tools",
    "value": 0,
    "source": "Blacksmith by upgrading a Gold Watering Can",
    "basicDescription": "The Watering Can is a tool obtained at the beginning of the game that is used to water Crops.",
    "longDescription": "Upgrading to a Iridium Watering Can will have the capacity increased to 100 charges. Also increases maximum area of effect to a 6x3 area (18 corresponding tiles)"
  },
  {
    "name": "jojaCola",
    "type": "food",
    "value": 25,
    "source": "Fishing, JojaMart, Vending Machine, Soda Machine, Garbage Cans",
    "basicDescription": "The flagship product of Joja Corporation",
    "longDescription": "Joja Cola is a type of trash. It can be found in all fishing spots during all seasons and in Garbage Cans. It can also be purchased at JojaMart for 75g or from the Vending Machine in The Stardrop Saloon. Players who choose to complete the Joja Warehouse instead of the Community Center will be rewarded with a Soda Machine that produces one Joja Cola per day. It is the only trash item that can be purchased. Along with the Rotten Plant, it cannot be recycled. When caught while fishing, Joja Cola gives 3 Fishing XP.",
    "heal": 5,
    "stamina": 13
  },
  {
    "name": "jojaWallpaper",
    "type": "furniture",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Decorates the walls of one room",
    "longDescription": "A great way to show your love and support to the Joja corporatation."
  },
  {
    "name": "jColaLight",
    "type": "furniture",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Can be placed inside your house.",
    "longDescription": "Another great way to show your love and support to the Joja corporatation."
  },
  {
    "name": "minecarts",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the minecart system that runs between the bus stop, the mountains, and Pelican Town.",
    "longDescription": "Repairs the minecart system that runs between the bus stop, the mountains, and Pelican Town."
  },
  {
    "name": "minecarts",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the minecart system that runs between the bus stop, the mountains, and Pelican Town.",
    "longDescription": "Destinations available from Town. The Minecart is a method of travel unlocked after completing the Boiler Room Bundles or by purchasing it from the Joja Community Development Form at JojaMart for 15,000g. After the Boiler room bundle is completed the 'minecart' is not usable till the day after because the Junimos fix it that night. Minecarts allow you to travel between four destinations throughout Stardew Valley."
  },
  {
    "name": "panning",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Removes the glimmering boulder near the mine entrance.",
    "longDescription": "Removes the glimmering boulder near the mine entrance."
  },
  {
    "name": "bridge",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the broken bridge in the mountains. The broken bridge east of The Mines will be repaired, enabling access to the Quarry.",
    "longDescription": "Repairs the broken bridge in the mountains. The broken bridge east of The Mines will be repaired, enabling access to the Quarry."
  },
  {
    "name": "greenhouse",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the old ruins on the farm, turning it into a greenhouse.",
    "longDescription": "Repairs the old ruins on the farm, turning it into a greenhouse."
  },
  {
    "name": "bus",
    "type": "unlockable",
    "value": 0,
    "source": "JojaMart",
    "basicDescription": "Repairs the bus that runs to Calico Desert.",
    "longDescription": "Repairs the bus that runs to Calico Desert."
  },
  {
    "name": "beer",
    "type": "food",
    "value": 200,
    "source": "Artisan Goods, The Saloon",
    "basicDescription": "Drink in Moderation",
    "longDescription": "Beer is an Artisan Good made from the Keg using Wheat, taking 1-2 days. It is also available at The Saloon for 400g. It can also be received as a gift at the Feast of the Winter Star. When consumed, Beer causes a Tipsy Buff that decreases Speed by 1. Beer can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Beer.",
    "heal": 22,
    "stamina": 50,
    "recipe": [
      "wheat"
    ]
  },
  {
    "name": "salad",
    "type": "food",
    "value": 110,
    "source": "Cooking, The Saloon",
    "basicDescription": "A healthy garden salad.",
    "longDescription": "Salad is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It is also available for purchase daily at The Stardrop Saloon for 220g and may randomly appear in Krobus' shop on Saturdays.",
    "heal": 50,
    "stamina": 113,
    "recipe": [
      "leek",
      "dandelion",
      "vinegar"
    ]
  },
  {
    "name": "bread",
    "type": "food",
    "value": 60,
    "source": "Cooking, The Saloon",
    "basicDescription": "A crusty baguette.",
    "longDescription": "Bread is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. Note: this recipe is profitable - it will always result in profit when using Wheat Flour made in the Mill. Bread is available at the Stardrop Saloon every day for 120g, and randomly from Krobus's shop on Saturdays. The recipe can be obtained at Stardrop Saloon for 500g or via The Queen of Sauce (TV) on Year 1, Summer day 28",
    "heal": 22,
    "stamina": 50,
    "recipe": [
      "wheatFlour"
    ]
  },
  {
    "name": "spaghetti",
    "type": "food",
    "value": 120,
    "source": "Cooking, The Saloon",
    "basicDescription": "An old favorite",
    "longDescription": "Spaghetti is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It is also available every day at The Stardrop Saloon for 240g and may randomly appear in Krobus' shop on Saturdays.  It can be obtained from Lewis via Mail after friendship has at least 3 hearts.",
    "heal": 75,
    "stamina": 33,
    "recipe": [
      "wheatFlour",
      "tomato"
    ]
  },
  {
    "name": "pizza",
    "type": "food",
    "value": 300,
    "source": "Cooking, The Saloon",
    "basicDescription": "It's popular for all the right reasons.",
    "longDescription": "Pizza is a cooked dish. It is prepared using the kitchen inside an upgraded farmhouse. It is also available for purchase daily at The Stardrop Saloon for 600g and may randomly appear in Krobus' shop on Saturdays. The recipe can be obtained at Stardrop Saloon for 600g or via The Queen of Sauce (TV) on Year 2, Spring day 7 ",
    "heal": 67,
    "stamina": 150,
    "recipe": [
      "wheatFlour",
      "tomato",
      "cheese"
    ]
  },
  {
    "name": "coffee",
    "type": "food",
    "value": 150,
    "source": "Artisan Goods, Night Market for free, The Saloon",
    "basicDescription": "It smells delicious.  This is sure to give you a boost.",
    "longDescription": "Coffee is an edible Artisan Good made by placing 5 Coffee Beans inside a Keg. It is also available at The Saloon for 300g. When consumed, it grants the player a unique speed boost for 1m 23s that stacks with speed boosts from other food items. The speed of the players horse is also increased. If consumed after midnight, Coffee does not give a speed boost until the player wakes up in the morning. Despite being considered an Artisan Good, the sale price of Coffee does not benefit from the Artisan Profession. Note that 5 beans of the same quality (normal, silver, or gold) must be used to make coffee; the keg will not accept beans that are not in one stack of 5.",
    "heal": 1,
    "stamina": 3,
    "recipe": [
      "coffeeBean",
      "coffeeBean",
      "coffeeBean",
      "coffeeBean",
      "coffeeBean"
    ]
  },
  {
    "name": "hashbrownsRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Hashbrowns.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 2 of Spring 14."
  },
  {
    "name": "omeletRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Omelet.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Spring 28."
  },
  {
    "name": "hashbrownsRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Hashbrowns.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 2 of Spring 14."
  },
  {
    "name": "pancakesRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Pancakes.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Summer 14."
  },
  {
    "name": "breadRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Bread.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Summer 28."
  },
  {
    "name": "tortillaRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Tortilla.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Fall 7."
  },
  {
    "name": "pizzaRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Pizza.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 2 of Spring 7."
  },
  {
    "name": "makiRollRecipe",
    "type": "unlockable",
    "value": 0,
    "source": "The Stardrop Saloon or Queen of Sauce",
    "basicDescription": "Unlocks the ability to create Maki Rolls.",
    "longDescription": "Also obtainable via The Queen of Sauce on Year 1 of Summer 21."
  },
  {
    "name": "leek",
    "type": "food",
    "value": 60,
    "source": "Foraging, Spring Seeds",
    "basicDescription": "A tasty relative of the onion.",
    "longDescription": "The Leek is found via foraging in the Spring, or grown from Spring Seeds. On Tuesdays, Evelyn may say that they can be found in the mountains, where they may be more common, but Leeks can be found above ground throughout Stardew Valley.",
    "heal": 18,
    "stamina": 40
  },
  {
    "name": "dandelion",
    "type": "food",
    "value": 40,
    "source": "Foraging, Spring Seeds, Flower Dance",
    "basicDescription": "Not the prettiest flower, but the leaves make a good salad.",
    "longDescription": "The Dandelion is found via foraging in the Spring, or grown from Spring Seeds. Up to ten can also be purchased from Pierre at the Flower Dance. Although it is a flower in its description (and in real life), the game classifies it as 'Forage' and not 'Flower'.",
    "heal": 18,
    "stamina": 40
  },
  {
    "name": "cheese",
    "type": "food",
    "value": 200,
    "source": "Cheese Press",
    "basicDescription": "It's your basic cheese.",
    "longDescription": "Cheese is an Artisan Good made from the Cheese Press, taking 3.3 hours. Using Milk will produce normal quality Cheese, while Large Milk will produce gold quality Cheese. Cheese can be placed inside a Cask to age from normal quality to silver, gold, and eventually iridium quality. Iridium quality doubles the base sell price of Cheese. Normal, silver, and gold quality Cheese can be prematurely removed from a cask at any time by striking the cask with an Axe, Hoe, or Pickaxe.",
    "heal": 18,
    "stamina": 40,
    "recipe": [
      "milk",
      "largeMilk"
    ]
  },
  {
    "name": "milk",
    "type": "food",
    "value": 125,
    "source": "Cow",
    "basicDescription": "A jug of cow's milk.",
    "longDescription": "Milk is an animal product obtained from a Cow by using a Milk Pail. It can also be obtained from Sandy at random, who will comment that the player looks thirsty. When a cow has a sufficient friendship and mood level, it can produce a Large Milk, which is more valuable. Milk can be used to make the following Artisan Goods. Note that regular Milk always produces regular quality Cheese, while Large Milk always produces gold-quality Cheese. The quality of the Milk is not a factor.",
    "heal": 17,
    "stamina": 38
  },
  {
    "name": "largeMilk",
    "type": "food",
    "value": 190,
    "source": "Cow",
    "basicDescription": "A large jug of cow's milk.",
    "longDescription": "Large Milk is an animal product obtained from a Cow with sufficient friendship and mood. It can also randomly rotate into the Traveling Cart's stock for 570-1,000g. Large Milk can be used to make the following Artisan Goods. Note that regular Milk always produces regular quality Cheese, while Large Milk always produces gold-quality Cheese. The quality of the Milk is not a factor. Cheese may be aged in Casks to increase its quality.",
    "heal": 22,
    "stamina": 50
  },
  {
    "name": "tomato",
    "type": "food",
    "value": 60,
    "source": "Tomato Seeds",
    "basicDescription": "Rich and slightly tangy, the Tomato has a wide variety of culinary uses.",
    "longDescription": "The Tomato is a vegetable crop that grows from Tomato Seeds after 11 days. When harvested, each Tomato plant gives 1 Tomato every 4 days, with a small random chance for more Tomatoes.",
    "heal": 9,
    "stamina": 20
  }
]






